[
    {
      "id": 1,
      "input": "Ma'daniyat nima?",
      "output": "Ma'daniyat insoniyatning ijtimoiy, iqtisodiy va madaniy faoliyatining jamlanmasidir."
    },
    {
      "id": 2,
      "input": "San'at nima?",
      "output": "San'at insonning ijodiy ifodasini, estetik go'zallikni yaratishni anglatadi."
    },
    {
      "id": 3,
      "input": "Muzeylar qanday vazifani bajaradi?",
      "output": "Muzeylar tarixiy va madaniy merosni saqlash va targ'ib qilish vazifasini bajaradi."
    },
    {
      "id": 4,
      "input": "O'zbek xalq musiqa san'ati qanday rivojlangan?",
      "output": "O'zbek musiqa san'ati o'zining boy folklori, an'anaviy ijro uslublari bilan ajralib turadi."
    },
    {
      "id": 5,
      "input": "O'zbekistonning eng mashhur san'atkorlari kimlar?",
      "output": "O'zbekistonning mashhur san'atkorlari orasida Alisher Navoiy, Mirzo Ulug'bek va boshqalar mavjud."
    },
    {
      "id": 6,
      "input": "Aktyorlik san'ati nima?",
      "output": "Aktyorlik san'ati teatrda yoki kinoda obraz yaratish, hikoya qilish san'ati hisoblanadi."
    },
    {
      "id": 7,
      "input": "San'atda realizm nima?",
      "output": "Realizm san'atda haqiqatni, kundalik hayotni to'g'ri aks ettirishga intilishdir."
    },
    {
      "id": 8,
      "input": "O'zbekcha rassomlik san'ati qachon rivojlanishni boshlagan?",
      "output": "O'zbek rassomlik san'ati XIX asr oxirida va XX asrning boshlarida rivojlanishni boshlagan."
    },
    {
      "id": 9,
      "input": "Zamaonaviy san'at va klassik san'at o'rtasidagi farq nima?",
      "output": "Zamaonaviy san'at yangi yondoshuvlar va eksperimentlarga asoslanadi, klassik san'at esa an'anaviy qoidalar va uslublarga tayanadi."
    },
    {
      "id": 10,
      "input": "O'zbek madaniyati va san'ati jahonda qanday tanilgan?",
      "output": "O'zbek madaniyati va san'ati o'zining boy tarixiy merosi, musiqasi, she'riyat va arxitekturasi bilan tanilgan."
    },
    {
      "id": 11,
      "input": "Tabiat va san'at o'rtasidagi aloqalar qanday?",
      "output": "Tabiat san'atkorlar uchun ilhom manbai bo'lib, san'at esa tabiatning go'zalligini ifodalaydi."
    },
    {
      "id": 12,
      "input": "Rassomlar tomonidan ishlatiladigan asosiy materiallar nimalar?",
      "output": "Rassomlar asosan bo'yoqlar, qalamlar, moy, qog'oz, mato, yog'och va gips kabi materiallarni ishlatadilar."
    },
    {
      "id": 13,
      "input": "Mavhum san'at nima?",
      "output": "Mavhum san'at tasviriy jihatdan aniq shakllar yoki tasvirlarni ko'rsatmasdan, kayfiyat va his-tuyg'ularni ifodalashga intiladi."
    },
    {
      "id": 14,
      "input": "Akvarel texnikasi qanday ishlanadi?",
      "output": "Akvarel texnikasida suyuq bo'yoqlar va suv yordamida rasm chiziladi, u ranglarni ochiq va yengil ifodalashni ta'minlaydi."
    },
    {
      "id": 15,
      "input": "Teatr san'ati qanday shakllarda rivojlanadi?",
      "output": "Teatr san'ati drama, komediya, tragediya va musiqali spektakllar kabi shakllarda rivojlanadi."
    },
    {
      "id": 16,
      "input": "Film san'ati qanday jihatlarga ega?",
      "output": "Film san'ati tasvir, ovoz, ssenariy va aktyorlikni birlashtirgan vizual va auditorial ijodiy ifoda turidir."
    },
    {
      "id": 17,
      "input": "Tilla bezaklar O'zbek san'atida qanday o'rin tutadi?",
      "output": "Tilla bezaklar O'zbek san'atida an'anaviy va diniy ramzlar, shuningdek, nafis san'at shakllarining bir qismi sifatida katta ahamiyatga ega."
    },
    {
      "id": 18,
      "input": "Avangard san'at nima?",
      "output": "Avangard san'ati san'atning an'anaviy qoidalariga qarshi chiqadigan va yangi yondashuvlarni izlovchi ijodiy harakatdir."
    },
    {
      "id": 19,
      "input": "O'zbek she'riyatida qanday asosiy mavzular mavjud?",
      "output": "O'zbek she'riyatida sevgi, tabiat, vatanga muhabbat, shoirning ichki kechinmalari kabi mavzular keng yoritiladi."
    },
    {
      "id": 20,
      "input": "Kino san'ati qanday rivojlangan?",
      "output": "Kino san'ati XX asrda texnologiyaning rivojlanishi bilan ajralib turuvchi yangi san'at shakli sifatida shakllandi."
    },
    {
      "id": 21,
      "input": "Sayohat san'ati qanday tushuniladi?",
      "output": "Sayohat san'ati boshqa xalqlarning madaniyatini, urf-odatlarini va san'atini o'rganish va targ'ib qilishdir."
    },
    {
      "id": 22,
      "input": "Foto san'ati nima?",
      "output": "Foto san'ati tasvirni kameralar yordamida yaratish va uni estetik jihatdan to'liq ifodalash san'atidir."
    },
    {
      "id": 23,
      "input": "O'zbek tilida qanday san'at asarlari mashhur?",
      "output": "O'zbek tilida yozilgan san'at asarlari orasida Alisher Navoiy, Abdulla Qodiriy va O'zbek milliy dostonlari mashhur."
    },
    {
      "id": 24,
      "input": "Xalqaro san'at ko'rgazmalari qanday ahamiyatga ega?",
      "output": "Xalqaro san'at ko'rgazmalari san'atkorlar uchun global miqyosda o'z ishlarini namoyish etish va madaniy aloqalarni rivojlantirish imkoniyatini yaratadi."
    },
    {
      "id": 25,
      "input": "Tizim san'ati nima?",
      "output": "Tizim san'ati bir necha elementlarning birlashuvi orqali murakkab tizimlarni yaratish san'atidir."
    },
    {
      "id": 26,
      "input": "Ijtimoiy san'at nima?",
      "output": "Ijtimoiy san'at jamiyatdagi muammolarni yoritish va odamlarni ijtimoiy o'zgarishlarga undashga intiladigan san'atdir."
    },
    {
      "id": 27,
      "input": "San'atning ijtimoiy ahamiyati nimada?",
      "output": "San'at jamiyatning ruhiy holatini aks ettiradi, estetik quvonch bag'ishlaydi va ijtimoiy o'zgarishlarni ilhomlantiradi."
    },
    {
      "id": 28,
      "input": "Aksessuarlar san'ati qanday shakllanadi?",
      "output": "Aksessuarlar san'ati kiyim va tashqi ko'rinishni bezatish uchun turli detallardan foydalanish san'atidir."
    },
    {
      "id": 29,
      "input": "O'zbek milliy musiqasi qanday asoslarga ega?",
      "output": "O'zbek milliy musiqasi maqom, kuy va bastakorlik an'analariga asoslanadi."
    },
    {
      "id": 30,
      "input": "Uyg'onish davri san'ati qanday xususiyatlarga ega?",
      "output": "Uyg'onish davri san'ati insonning aqliy va ruhiy qobiliyatlarini o'zgartirishga intilgan, klassik qadriyatlarni tiklashga harakat qilgan."
    },
    {
      "id": 31,
      "input": "Milliy qo'shiqlar va raqslarning san'atdagi o'rni qanday?",
      "output": "Milliy qo'shiqlar va raqslar xalqning tarixini, urf-odatlarini va ruhiyatini ifodalovchi san'at shakllaridir."
    },
    {
      "id": 32,
      "input": "San'atning zamonaviy shakllari qanday?",
      "output": "Zamonaviy san'at shakllari video san'ati, raqamli san'at, interaktiv san'at va media san'ati kabi yangi yo'nalishlarni o'z ichiga oladi."
    },
    {
      "id": 33,
      "input": "Rassom va san'atshunos o'rtasidagi farq nima?",
      "output": "Rassom san'atni yaratadi, san'atshunos esa san'at asarlarini o'rganadi va baholaydi."
    },
    {
      "id": 34,
      "input": "Ma'naviyat va san'at o'rtasidagi aloqalar qanday?",
      "output": "Ma'naviyat va san'at bir-birini to'ldiradi; san'at ruhiy va ma'naviy qadriyatlarni ifodalaydi va tarqatadi."
    },
    {
      "id": 35,
      "input": "Kinematografiyada realist yondashuv qanday ifodalanadi?",
      "output": "Realist kinematografiya haqiqatni aniqlik bilan ko'rsatish, aktorlarning tabiiyligini saqlash va realistik sahnalarni yaratish orqali amalga oshiriladi."
    },
    {
      "id": 36,
      "input": "San'at orqali insoniyat qanday muammolarni hal qilishi mumkin?",
      "output": "San'at jamiyatdagi muammolarni yoritadi, odamlarni o'ylashga va ijtimoiy o'zgarishlarni amalga oshirishga ilhomlantiradi."
    },
    {
      "id": 37,
      "input": "An'anaviy san'at nima?",
      "output": "An'anaviy san'at avloddan-avlodga o'tib kelgan, o'ziga xos uslublar va texnikalarga ega san'atdir."
    },
    {
      "id": 38,
      "input": "Madaniyatning shakllanishiga qanday omillar ta'sir qiladi?",
      "output": "Madaniyatga ijtimoiy, iqtisodiy, tarixiy va geografik omillar ta'sir qiladi."
    },
    {
      "id": 39,
      "input": "O'zbek xalqi madaniyatida qanday o'ziga xos elementlar mavjud?",
      "output": "O'zbek madaniyatida mehnat an'analari, musiqiy meros, xalq hunarmandchiligi va xonlik san'ati o'ziga xosdir."
    },
    {
      "id": 40,
      "input": "San'atning ta'limdagi roli nima?",
      "output": "San'at ta'limda ijodkorlikni rivojlantiradi, estetik didni shakllantiradi va shaxsiy rivojlanishga yordam beradi."
    },
    {
      "id": 41,
      "input": "San'at tarixida Impressionizm qanday ta'sir ko'rsatgan?",
      "output": "Impressionizm san'atda yorqin ranglar, tezkor teginishlar va tabiiy manzaralarga yangi qarashlarni kiritdi."
    },
    {
      "id": 42,
      "input": "Modernizm san'ati qanday xususiyatlarga ega?",
      "output": "Modernizm san'ati an'anaviy san'at shakllarini inkor qilib, yangilikka intiladi va o'zgarishlarga ochiq bo'ladi."
    },
    {
      "id": 43,
      "input": "O'zbek teatr san'ati qanday rivojlangan?",
      "output": "O'zbek teatr san'ati XX asr boshlarida milliy sahna san'ati shaklida rivojlanishni boshladi."
    },
    {
      "id": 44,
      "input": "Qadimiy misr san'ati qanday o'ziga xosdir?",
      "output": "Qadimiy Misr san'ati to'g'ridan-to'g'ri va geometrik shakllar, piramidalik va diniy ramzlar bilan ajralib turadi."
    },
    {
      "id": 45,
      "input": "Musiqa va san'at o'rtasidagi aloqalar qanday?",
      "output": "Musiqa san'atning muhim tarmog'i bo'lib, uning ritmi, melodiyasi va harakati boshqa san'at shakllari bilan uyg'unlikda ishlaydi."
    },
    {
      "id": 46,
      "input": "Folklor san'ati qanday shakllarda mavjud?",
      "output": "Folklor san'ati asosan qo'shiqlar, raqslar, afsonalar, ertaklar va xalq hikoyalari shaklida mavjud."
    },
    {
      "id": 47,
      "input": "Yangi san'at shakllari qanday paydo bo'ldi?",
      "output": "Yangi san'at shakllari texnologiyaning rivojlanishi bilan paydo bo'lib, raqamli san'at va interaktiv san'atni o'z ichiga oladi."
    },
    {
      "id": 48,
      "input": "Arxitektura san'ati qanday ifodalanadi?",
      "output": "Arxitektura san'ati inshootlarning dizaynida estetik va funksional yondoshuvni o'z ichiga oladi."
    },
    {
      "id": 49,
      "input": "O'zbek milliy kinolarining xususiyatlari nimalardan iborat?",
      "output": "O'zbek milliy kinolari xalqning turmush tarzini, an'anaviy qadriyatlarni va ijtimoiy masalalarni ko'rsatadi."
    },
    {
      "id": 50,
      "input": "San'atda ekspressionizm nima?",
      "output": "Ekspressionizm san'ati ichki kechinmalarni, hissiyotlarni va stressni kuchli va dramatik uslubda ifodalashga intiladi."
    },
    {
      "id": 51,
      "input": "Ayollar san'atda qanday rol o'ynagan?",
      "output": "Ayollar san'atda ijodkor va ilhom manbai sifatida muhim o'rin tutgan, ko'plab mashhur rassomlar, yozuvchilar va aktyorlar ayollardir."
    },
    {
      "id": 52,
      "input": "Arxitektura va san'atning aloqasi qanday?",
      "output": "Arxitektura san'ati estetik dizayn va inshootlarning funksional xususiyatlarini birlashtiradi, shu bilan san'at va texnologiya o'rtasidagi bog'liqlikni tashkil etadi."
    },
    {
      "id": 53,
      "input": "Minimalizm san'ati nima?",
      "output": "Minimalizm san'ati juda oddiy va toza shakllar, ranglar va strukturalarga asoslanadi, ortiqcha tafsilotlardan voz kechadi."
    },
    {
      "id": 54,
      "input": "O'zbek xalq o'yinlari san'ati qanday rivojlangan?",
      "output": "O'zbek xalq o'yinlari an'anaviy tabiatga ega, ular orqali milliy qadriyatlar va ma'naviyat namoyon bo'ladi."
    },
    {
      "id": 55,
      "input": "O'zbekistonning arxitektura yodgorliklari qanday ahamiyatga ega?",
      "output": "O'zbekistonning arxitektura yodgorliklari mamlakatning boy tarixiy va madaniy merosini aks ettiradi."
    },
    {
      "id": 56,
      "input": "Gibrid san'at nima?",
      "output": "Gibrid san'at turli san'at shakllarini birlashtirgan, an'anaviy va zamonaviy texnologiyalarni o'z ichiga olgan san'at turidir."
    },
    {
      "id": 57,
      "input": "O'zbek kinolarida milliy mavzular qanday yoritilgan?",
      "output": "O'zbek kinolarida milliy tarix, o'zlik va o'zbek xalqining ruhiy holati keng yoritilgan."
    },
    {
      "id": 58,
      "input": "O'yin-kulgi san'ati qanday rivojlanadi?",
      "output": "O'yin-kulgi san'ati kino, teatr, televidenie va boshqa ommaviy kommunikatsiya vositalari orqali odamlarni zavqlantirishga intiladi."
    },
    {
      "id": 59,
      "input": "Kalligrfiya san'ati qanday rivojlangan?",
      "output": "Kalligrfiya san'ati yozuvni go'zal va san'atli tarzda ijro etish, harflar va shakllar bilan ifodalashni o'z ichiga oladi."
    },
    {
      "id": 60,
      "input": "Videomastik san'ati nima?",
      "output": "Videomastik san'ati tasvirlar va videolarni eksperiment qilib, vizual san'atga aylantirishga qaratilgan."
    },
    {
      "id": 61,
      "input": "San'atda asimetriya qanday ishlatiladi?",
      "output": "Asimetriya san'atda tasvirlar va kompozitsiyalarni muvozanatli va dinamik qilish uchun ishlatiladi."
    },
    {
      "id": 62,
      "input": "Postmodernizm san'ati qanday xususiyatlarga ega?",
      "output": "Postmodernizm san'ati eski an'analarni tanqidiy tahlil qiladi, ironiya va parodiya usullaridan foydalanadi."
    },
    {
      "id": 63,
      "input": "Biznes va san'atning o'zaro bog'liqligi qanday?",
      "output": "Biznes va san'at o'zaro aloqada bo'lib, san'at asarlari savdosi va san'at galereyalari biznesni shakllantiradi."
    },
    {
      "id": 64,
      "input": "Kinematografiyada qahramonlar qanday yaratilib, rivojlanadi?",
      "output": "Kinematografiyada qahramonlar ssenariy va aktyorlik ijrosi orqali psixologik va dramatik jihatlarga ega bo'ladi."
    },
    {
      "id": 65,
      "input": "Surrealizm san'ati qanday ifodalanadi?",
      "output": "Surrealizm san'ati ong osti va irrational dunyoqarashni tasvirlaydi, odatiy realiteyni buzadi."
    },
    {
      "id": 66,
      "input": "Tabiatning san'atchilar uchun ahamiyati nima?",
      "output": "Tabiat san'atchilar uchun ilhom manbai, go'zallikni anglash va ifodalash vositasi sifatida katta ahamiyatga ega."
    },
    {
      "id": 67,
      "input": "San'at va madaniyatni saqlash qanday amalga oshiriladi?",
      "output": "San'at va madaniyatni saqlash muzeylar, arxivlar, san'at asarlarini tiklash va ilmiy tadqiqotlar orqali amalga oshiriladi."
    },
    {
      "id": 68,
      "input": "Madaniy merosni saqlashda texnologiyaning roli qanday?",
      "output": "Texnologiya san'at asarlarini raqamli saqlash, konservatsiya qilish va ularni keng ommaga taqdim etish imkonini yaratadi."
    },
    {
      "id": 69,
      "input": "Teatrda improvizatsiyaning ahamiyati qanday?",
      "output": "Improvizatsiya teatrda ijodiy erkinlik yaratadi, aktyorlarni voqealarga javob berishga va sahnada yangi yondashuvlar yaratishga undaydi."
    },
    {
      "id": 70,
      "input": "San'atda simmetriya nima?",
      "output": "Simmetriya san'atda shakllar va kompozitsiyalarni muvozanatli va estetik jihatdan tartibga solishdir."
    },
    {
      "id": 71,
      "input": "Ma'daniyatning evolyutsiyasi qanday jarayonni anglatadi?",
      "output": "Ma'daniyat evolyutsiyasi jamiyatning ijtimoiy, iqtisodiy va madaniy taraqqiyoti bilan uzviy bog'liq rivojlanish jarayonini anglatadi."
    },
    {
      "id": 72,
      "input": "O'zbek kino san'ati qanday o'ziga xosdir?",
      "output": "O'zbek kino san'ati o'z milliy qadriyatlari, til va madaniyatiga asoslangan hikoyalar bilan ajralib turadi."
    },
    {
      "id": 73,
      "input": "Yangi asr san'ati qanday xususiyatlarga ega?",
      "output": "Yangi asr san'ati texnologiyalarning rivojlanishi va globalizatsiyaning ta'siri ostida interaktiv va eksperimental yondashuvlarga asoslanadi."
    },
    {
      "id": 74,
      "input": "O'zbek xalq musiqasida qanday asarlar mavjud?",
      "output": "O'zbek xalq musiqasida maqom, kuylar, dastanlar va xalq qo'shiqlari kabi asarlar mavjud."
    },
    {
      "id": 75,
      "input": "Qaysi san'at shakli boshqa san'at shakllarini o'zida birlashtiradi?",
      "output": "Film san'ati musiqani, teatrni, tasviriy san'atni va boshqa san'at shakllarini birlashtiradi."
    },
    {
      "id": 76,
      "input": "Zamonaviya san'atda qanday materiallardan foydalaniladi?",
      "output": "Zamonaviya san'atda raqamli texnologiyalar, metall, yog'och, shisha, plastik va boshqa eksperiment materiallari qo'llaniladi."
    },
    {
      "id": 77,
      "input": "O'zbek san'atida milliy an'analar qanday saqlanadi?",
      "output": "O'zbek san'atida milliy an'analar musiqada, raqsda, xunarmandchilikda va tasviriy san'atda saqlanadi."
    },
    {
      "id": 78,
      "input": "O'lkashunoslik nima?",
      "output": "O'lkashunoslik turli hududning tabiiy va madaniy resurslarini o'rganish, xalqning urf-odatlari va tarixiy yodgorliklarini tahlil qilishga qaratilgan fan sohasidir."
    },
    {
      "id": 79,
      "input": "Nima uchun san'atkorlar ko'pincha jamiyatni tanqid qiladi?",
      "output": "San'atkorlar jamiyatdagi noxush holatlarni, ijtimoiy tengsizlikni va inson huquqlarining buzilishini san'at orqali tanqid qiladilar."
    },
    {
      "id": 80,
      "input": "Falsafa va san'at o'rtasidagi aloqalar qanday?",
      "output": "Falsafa va san'at bir-birini to'ldiradi, falsafa san'at orqali dunyoni tushunishga yordam beradi, san'at esa falsafiy g'oyalarni vizual va estetik shaklda ifodalaydi."
    },
    {
      "id": 81,
      "input": "San'at asarlarining qadri qanday baholanadi?",
      "output": "San'at asarlari uning tarixi, yaratilgan davri, ijodkorining o'ziga xosligi va umumiy estetik qiymati asosida baholanadi."
    },
    {
      "id": 82,
      "input": "Matematika va san'at o'rtasidagi aloqalar qanday?",
      "output": "Matematika va san'at orasida simmetriya, geometriya va dizayn kabi umumiy elementlar mavjud."
    },
    {
      "id": 83,
      "input": "San'atni qadrlashning ijtimoiy ahamiyati nima?",
      "output": "San'atni qadrlash jamiyatning estetik didini shakllantiradi, madaniy merosni saqlaydi va ijtimoiy ruhni yuksaltiradi."
    },
    {
      "id": 84,
      "input": "Dastanlar san'atning qaysi shakliga kiradi?",
      "output": "Dastanlar epik she'riyatning shakllaridan biri bo'lib, ular tarixiy voqealar va qahramonlik haqidagi hikoyalardan iborat."
    },
    {
      "id": 85,
      "input": "Diniy san'at nima?",
      "output": "Diniy san'at diniy tushunchalarni, ibodatlarni va xudolarni tasvirlashga qaratilgan san'at shaklidir."
    },
    {
      "id": 86,
      "input": "Musiqa va she'riyat qanday birlashadi?",
      "output": "Musiqa va she'riyat birlashib, qo'shiqlar va kuylarda so'z va melodiyaning uyg'unligi orqali ifodalanadi."
    },
    {
      "id": 87,
      "input": "Tasviriy san'atda \"landshaft\" nima?",
      "output": "Landshaft tasviriy san'atda tabiat manzaralarini, tog'lar, daryolar va o'rmonlarni ifodalovchi rasm yoki tasvirlarni anglatadi."
    },
    {
      "id": 88,
      "input": "Xalq amaliy san'ati qanday shakllarda namoyon bo'ladi?",
      "output": "Xalq amaliy san'ati hunarmandchilik, gilamchilik, naqshli kiyimlar, taqinchoqlar va boshqa an'anaviy ishlanmalarda namoyon bo'ladi."
    },
    {
      "id": 89,
      "input": "Uyg'onish davri san'atida qanday o'zgarishlar yuz berdi?",
      "output": "Uyg'onish davrida san'at gumanizm, anatomiya, perspektiva va tabiatga yangi qarashlarni rivojlantirdi."
    },
    {
      "id": 90,
      "input": "San'atda \"konstruktivizm\" nima?",
      "output": "Konstruktivizm san'atda shakllar va tuzilmalarga asoslangan, texnik va industriyaviy estetikani o'z ichiga olgan harakatdir."
    },
    {
      "id": 91,
      "input": "O'zbek xalq raqslarining xususiyatlari qanday?",
      "output": "O'zbek xalq raqslarining xususiyatlari qadimiy urf-odatlar, ayollarning nozik harakatlari va ritmik elementlar bilan ajralib turadi."
    },
    {
      "id": 92,
      "input": "Antik san'atning ahamiyati qanday?",
      "output": "Antik san'at qadimgi yunon va rim madaniyatlarining estetik, falsafiy va ijtimoiy qadriyatlarini aks ettiradi."
    },
    {
      "id": 93,
      "input": "Qo'lyozma san'ati nima?",
      "output": "Qo'lyozma san'ati qalam yoki brush yordamida yozilgan yoki chizilgan asarlarni, shu jumladan, xat yoki suratlarni o'z ichiga oladi."
    },
    {
      "id": 94,
      "input": "Postmodernizmda san'at qanday o'zgaradi?",
      "output": "Postmodernizmda san'at oldingi an'analarga qarshi chiqib, pluralizm, ironiya va kontekstualizatsiyani o'z ichiga oladi."
    },
    {
      "id": 95,
      "input": "Raqsning san'atdagi o'rni qanday?",
      "output": "Raqs san'atda harakat va hissiyotlarning vizual ifodasini yaratadi, va u odatda musiqaga yoki dramatik voqealarga javoban ijro etiladi."
    },
    {
      "id": 96,
      "input": "Zahiriy san'at va ichki dunyo qanday bog'liq?",
      "output": "Zahiriy san'at tashqi dunyoning tasvirini yaratgan bo'lsa, ichki dunyo san'ati insonning hissiyotlari va ichki kechinmalarini aks ettiradi."
    },
    {
      "id": 97,
      "input": "Nima uchun san'at tarixida monarxiya va din muhim o'rin tutgan?",
      "output": "Monarxiya va din san'atni moliyalashtirgan va ko'plab san'at asarlari bu ijtimoiy tizimlar uchun yaratilgan."
    },
    {
      "id": 98,
      "input": "Art-deko san'ati qanday xususiyatlarga ega?",
      "output": "Art-deko san'ati geometriya, simmetriya, o'ziga xos dizayn va nozik materiallardan foydalanishni afzal ko'radi."
    },
    {
      "id": 99,
      "input": "San'atda \"abstraktsionizm\" nima?",
      "output": "Abstraktsionizm san'ati shakllar va ranglar orqali tasvirni ifodalashni maqsad qilgan, obyektiv dunyoni tasvirlamaydi."
    },
    {
      "id": 100,
      "input": "San'at va siyosatning o'zaro aloqasi qanday?",
      "output": "San'at siyosatni tanqid qilish yoki tasvirlash, jamiyatdagi muammolarni yoritish uchun kuchli vosita bo'lishi mumkin."
    },
    {
      "id": 101,
      "input": "Madaniyatning ommaviylashuvi qanday o'zgarishlarga olib keldi?",
      "output": "Madaniyatning ommaviylashuvi orqali global miqyosda turli madaniyatlarning aralashuvi, yangi ommaviy san'at shakllarining paydo bo'lishiga sabab bo'ldi."
    },
    {
      "id": 102,
      "input": "O'zbek milliy teatrining rivojlanishida kimlar muhim rol o'ynagan?",
      "output": "O'zbek milliy teatrining rivojlanishida Abdulla Qodiriy, Munavvar qori va boshqa ko'plab san'atkorlar muhim rol o'ynagan."
    },
    {
      "id": 103,
      "input": "San'at va me'morchilik o'rtasidagi farq nima?",
      "output": "San'at estetik ifoda va hissiyotlarni tasvirlashga yo'naltirilgan, me'morchilik esa funksional va estetik dizaynni birlashtiradi."
    },
    {
      "id": 104,
      "input": "Musiqa asarlarini yaratishda qaysi elementlar muhim?",
      "output": "Melodiya, ritm, harmoniya va dinamika musiqa asarlarini yaratishda asosiy elementlardir."
    },
    {
      "id": 105,
      "input": "Tasviriy san'atda \"realizm\" nima?",
      "output": "Realizm san'atida tasvirlangan voqealar va sahnalar haqiqiy hayotdan olingan bo'lib, idealizatsiya va romantizmdan voz kechiladi."
    },
    {
      "id": 106,
      "input": "San'atda \"dekonstruktivizm\" nima?",
      "output": "Dekonstruktivizm san'ati an'anaviy strukturalarni tahlil qilish va ularni buzish orqali yangi shakllar yaratishga intiladi."
    },
    {
      "id": 107,
      "input": "Madaniyatni yaratishda tilning roli qanday?",
      "output": "Til madaniyatni yaratishda asosiy vosita bo'lib, odamlarning fikrini, qadriyatlarini va tarixini ifodalashga xizmat qiladi."
    },
    {
      "id": 108,
      "input": "\"Ekspressionizm\" san'ati qanday ifodalangan?",
      "output": "Ekspressionizm san'ati ichki kechinmalarni va hissiyotlarni, tashqi dunyo orqali emas, balki ichki qarash orqali tasvirlaydi."
    },
    {
      "id": 109,
      "input": "O'zbekistonning xalq amaliy san'ati qanday rivojlangan?",
      "output": "O'zbekistonning xalq amaliy san'ati ipak, gilamchilik, tikuvchilik va keramika kabi an'anaviy hunarmandchiliklar orqali rivojlangan."
    },
    {
      "id": 110,
      "input": "Qaysi san'at shakli inson tabiatining ichki kechinmalarini tasvirlashga intiladi?",
      "output": "Ekspressionizm san'ati insonning ichki kechinmalarini va ruhiy holatlarini kuchli va yorqin uslubda tasvirlaydi."
    },
    {
      "id": 111,
      "input": "San'atda \"kolorizm\" nima?",
      "output": "Kolorizm san'atda ranglarning o'ynashini, ularning estetik va emosional ta'sirini o'rganishga qaratilgan."
    },
    {
      "id": 112,
      "input": "O'zbekiston arxitekturasida qanday xususiyatlar mavjud?",
      "output": "O'zbekiston arxitekturasida islom san'ati, maqbaralar, minora va masjidlar kabi diniy va madaniy elementlar asosiy o'rinni egallaydi."
    },
    {
      "id": 113,
      "input": "Postmodernizm san'ati qanday xususiyatlarga ega?",
      "output": "Postmodernizm san'ati ironiya, parodiya va eklektizmni o'z ichiga olib, an'anaviy me'yorlardan chiqish va yangi shakllar yaratishga intiladi."
    },
    {
      "id": 114,
      "input": "Yangi san'at shakllarining o'ziga xosligi qanday?",
      "output": "Yangi san'at shakllari interaktivlik, raqamli texnologiyalar va eksperimentallikni o'z ichiga olib, san'atni yangi darajaga ko'taradi."
    },
    {
      "id": 115,
      "input": "Teatrda \"absurd\" nima?",
      "output": "Absurd teatrida voqealar va mantiqiy aloqalar buziladi, inson hayotining befoyda va maqsadsizligini ko'rsatishga intiladi."
    },
    {
      "id": 116,
      "input": "San'at va texnologiya o'rtasidagi bog'liqlik qanday?",
      "output": "Texnologiya san'atni yangi shakllarda yaratish, raqamli va interaktiv san'atni rivojlantirish imkoniyatlarini beradi."
    },
    {
      "id": 117,
      "input": "Raqs san'ati qaysi hissiyotlarni aks ettiradi?",
      "output": "Raqs san'ati odamning ichki his-tuyg'ularini, sevgi, qayg'u, quvonch kabi hissiyotlarni ifodalashga qaratilgan."
    },
    {
      "id": 118,
      "input": "San'atda \"romantizm\" nima?",
      "output": "Romantizm san'ati hissiyot, tabiat va insonning ichki dunyosini tasvirlashga yo'naltirilgan."
    },
    {
      "id": 119,
      "input": "O'zbek musiqasida maqomning o'rni qanday?",
      "output": "Maqam o'zbek musiqasining asosiy yo'nalishlaridan biri bo'lib, u melodiyalarni, ritmlarni va so'zlarni chuqur estetik tarzda ifodalaydi."
    },
    {
      "id": 120,
      "input": "San'atning ma'naviy rivojlanishdagi roli qanday?",
      "output": "San'at ma'naviy rivojlanishga hissa qo'shadi, insoniyatning madaniy va ruhiy dunyosini yoritadi."
    },
    {
      "id": 121,
      "input": "San'atda \"surrealizm\" nima?",
      "output": "Surrealizm san'ati real dunyo va tushlarning o'rtasida bog'lanish yaratadi, tasvirlangan voqealar ko'pincha noaniq va absurd bo'ladi."
    },
    {
      "id": 122,
      "input": "Arxitektura san'atida qaysi elementlar muhim?",
      "output": "Arxitektura san'atida simmetriya, miqyos, materiallar va funktsional dizayn asosiy elementlardir."
    },
    {
      "id": 123,
      "input": "San'atda \"minimalizm\" nima?",
      "output": "Minimalizm san'ati oddiylikni, tozalikni va ortiqcha tafsilotlardan voz kechishni ifodalaydi."
    },
    {
      "id": 124,
      "input": "O'zbek xalq dastanlarining xususiyatlari qanday?",
      "output": "O'zbek xalq dastanlari tarixiy voqealarni, qahramonlikni va ma'naviy qadriyatlarni ifodalaydi."
    },
    {
      "id": 125,
      "input": "Xalq san'ati va professional san'at o'rtasidagi farq nima?",
      "output": "Xalq san'ati ko'pincha an'anaviy va amaliy bo'lib, keng jamoatchilik uchun yaratilgan, professional san'at esa ko'pincha individual ifoda va estetik qadriyatlarni o'z ichiga oladi."
    },
    {
      "id": 126,
      "input": "San'at asarini yaratishda \"kompozitsiya\" nima?",
      "output": "Kompozitsiya san'at asaridagi elementlarning joylashuvi, tarzi va bir-biri bilan uyg'unligini tashkil etadi."
    },
    {
      "id": 127,
      "input": "Mavjud madaniyatlarning o'zaro ta'siri qanday?",
      "output": "Mavjud madaniyatlar o'zaro ta'sirda bo'lib, o'zaro o'rganish, almashish va yangi san'at shakllarining paydo bo'lishiga olib keladi."
    },
    {
      "id": 128,
      "input": "Teatr va kino san'atlarining o'zaro bog'liqligi qanday?",
      "output": "Teatr va kino san'ati bir-birini to'ldiradi, ikkalasida ham hikoya qilish, aktyorlik ijrosi va vizual ifoda muhim rol o'ynaydi."
    },
    {
      "id": 129,
      "input": "Mavjud san'at asarlarida \"nafislik\" qanday ko'rsatiladi?",
      "output": "Nafislik san'atda detallarga e'tibor, nozik uslub va estetik didni ifodalash orqali ko'rsatiladi."
    },
    {
      "id": 130,
      "input": "San'at va psixologiya o'rtasidagi aloqalar qanday?",
      "output": "San'at psixologiyani anglash va ifodalash uchun vosita bo'lib, inson ruhiyatini va ichki dunyosini tushunishga yordam beradi."
    },
    {
      "id": 131,
      "input": "\"Dadaizm\" san'ati qanday xususiyatlarga ega?",
      "output": "Dadaizm san'ati an'anaviy san'at va madaniyatga qarshi chiqadi, absurd va nonsensual elementlarni o'z ichiga oladi."
    },
    {
      "id": 132,
      "input": "Tasviriy san'atda \"abstrakt ekspressionizm\" nima?",
      "output": "Abstrakt ekspressionizm san'atida shakllar, ranglar va tuzilmalar orqali ichki his-tuyg'ularni ifodalashga harakat qilinadi."
    },
    {
      "id": 133,
      "input": "Rassomlikda \"perspektiva\" nima?",
      "output": "Perspektiva rassomlikda uzoqlikni va chuqurlikni tasvirlash uchun ishlatiladigan texnikadir."
    },
    {
      "id": 134,
      "input": "O'zbek teatrlari va kino tarixida kimlar yetakchi o'rin tutgan?",
      "output": "O'zbek teatrlari va kinolarida Halima Nosirova, Oybek, Erkin Vohidov kabi san'atkorlar yetakchi o'rin tutgan."
    },
    {
      "id": 135,
      "input": "Madaniyatda \"kult\" nima?",
      "output": "Kult ma'lum bir san'at asari, shaxs yoki hodisaning ommaviy qiziqish va sevgi bilan bog'liq bo'lgan madaniy fenomenidir."
    },
    {
      "id": 136,
      "input": "Rassomlarning ijodiy uslublari qanday shakllanadi?",
      "output": "Rassomlarning ijodiy uslublari ularning tasviriy va estetik qarashlari, ishlatgan texnikalari va materiallariga bog'liq ravishda shakllanadi."
    },
    {
      "id": 137,
      "input": "San'at asarlarini yaratishda ilhom manbalaridan nimalar bo'lishi mumkin?",
      "output": "San'at asarlarini yaratishda tabiat, inson hayoti, tarixiy voqealar, shaxsiy tajribalar va madaniy meros ilhom manbalari bo'lishi mumkin."
    },
    {
      "id": 138,
      "input": "Musiqa va san'atda improvisatsiyaning roli qanday?",
      "output": "Improvisatsiya musiqa va san'atda ijodiy erkinlikni, ifodaning tabiiyligini va shaxsiy his-tuyg'ularni yuzaga chiqarishga yordam beradi."
    },
    {
      "id": 139,
      "input": "Ijtimoiy san'at nima?",
      "output": "Ijtimoiy san'at ijtimoiy muammolarni yoritish, jamiyatni tanqid qilish va inson huquqlarini himoya qilishga yo'naltirilgan san'at shaklidir."
    },
    {
      "id": 140,
      "input": "San'atda \"futurizm\" nima?",
      "output": "Futurizm san'ati kelajakni tasvirlashga, texnologik taraqqiyot va yangi ijtimoiy tartiblarni aks ettirishga qaratilgan."
    },
    {
      "id": 141,
      "input": "Me'morchilikda \"gothic\" uslubining xususiyatlari qanday?",
      "output": "Gothic me'morchiligi baland minoralari, o'zgacha teshilgan derazalari va og'ir g'ishtli konstruksiyalar bilan ajralib turadi."
    },
    {
      "id": 142,
      "input": "Teatrda \"tragik\" va \"komik\" rollar o'rtasidagi farq nima?",
      "output": "Tragik rollar insonning og'ir hayotiy masalalarini va shaxsiy azoblarini tasvirlashga, komik rollar esa kulgili vaziyatlarni va ijtimoiy tanqidni ifodalashga yo'naltirilgan."
    },
    {
      "id": 143,
      "input": "San'at va dizayn o'rtasidagi asosiy farqlar nima?",
      "output": "San'at shaxsiy ifodani va estetik qiymatni aks ettirsa, dizayn amaliy ehtiyojlarni qondirish va funktsional muammolarni hal qilishga qaratilgan."
    },
    {
      "id": 144,
      "input": "O'zbek musiqasida maqomning tarixi qanday rivojlangan?",
      "output": "Maqam musiqasi o'zbek xalqining qadimiy musiqiy an'analari asosida rivojlanib, zamonaviy musiqaga ham ta'sir ko'rsatgan."
    },
    {
      "id": 145,
      "input": "Xalq amaliy san'ati va vizual san'at o'rtasidagi farq nima?",
      "output": "Xalq amaliy san'ati ko'pincha amaliy ehtiyojlar uchun yaratilgan bo'lsa, vizual san'at ko'proq estetik va hissiy ifodaga yo'naltiriladi."
    },
    {
      "id": 146,
      "input": "O'zbek teatrining rivojlanishida kimlar asosiy shaxslar bo'lib xizmat qilgan?",
      "output": "O'zbek teatrining rivojlanishida Muzaffar Uyg'ur, Shohjan Yusupov va Munavvar qori kabi shaxslar katta rol o'ynagan."
    },
    {
      "id": 147,
      "input": "San'atda \"konseptualizm\" nima?",
      "output": "Konseptualizm san'atida asar kontseptsiyasi, ya'ni g'oya va ma'no asarning shaklidan ko'ra muhimroq hisoblanadi."
    },
    {
      "id": 148,
      "input": "Yangi asr san'atida qaysi texnologiyalar asosiy vositalar sifatida qo'llaniladi?",
      "output": "Yangi asr san'atida raqamli texnologiyalar, video o'yinlar, virtual haqiqat va interaktiv media kabi texnologiyalar asosiy vositalar sifatida qo'llaniladi."
    },
    {
      "id": 149,
      "input": "Muzeyda saqlanayotgan san'at asarlarini qanday baholash mumkin?",
      "output": "Muzeyda saqlanayotgan san'at asarlari tarixiy ahamiyati, yaratilgan davri, san'atkorning ijodiy yondashuvi va estetik qiymatiga qarab baholanadi."
    },
    {
      "id": 150,
      "input": "O'zbek kino san'ati qaysi davrda eng yuqori rivojlanishga erishgan?",
      "output": "O'zbek kino san'ati 1970-80-yillarda, ayniqsa, \"O'zbekfilm\" studiyasining ishlari bilan yuqori rivojlanishga erishgan."
    },
    {
      "id": 151,
      "input": "Zamonaviya san'ati qanday xususiyatlarga ega?",
      "output": "Zamonaviya san'ati tez o'zgaruvchan texnologiyalardan foydalanish, globalizatsiya, ijtimoiy masalalarni yoritish va eksperimentallik bilan ajralib turadi."
    },
    {
      "id": 152,
      "input": "Antik san'atda odamlarning ideallarini qanday tasvirlashgan?",
      "output": "Antik san'atda odamlar go'zallik, kuch va aql-idrok ideallarini tasvirlash uchun baland ranglar va simmetrik shakllardan foydalanishgan."
    },
    {
      "id": 153,
      "input": "Dastanlar san'ati va kino o'rtasidagi o'xshashliklar qanday?",
      "output": "Dastanlar va kino san'ati hikoya qilishning turli shakllari bo'lib, ikkalasida ham vizual ifoda va qahramonlik temalari ko'rib chiqiladi."
    },
    {
      "id": 154,
      "input": "Raqsda \"improvisatsiya\" qanday ishlatiladi?",
      "output": "Raqsda improvisatsiya ijrochining hissiyotlari va jismoniy holatini ifodalash orqali yangi va noan'anaviy harakatlar yaratishga yordam beradi."
    },
    {
      "id": 155,
      "input": "San'atda \"futurizm\" va \"dadaizm\" o'rtasidagi farq nima?",
      "output": "Futurizm kelajak va texnologiyani tasvirlashga intilsa, dadaizm mavjud ijtimoiy va madaniy tuzilmalarni rad etib, absurdni yaratishga harakat qiladi."
    },
    {
      "id": 156,
      "input": "Rassomlar va yozuvchilar o'rtasidagi aloqalar qanday?",
      "output": "Rassomlar va yozuvchilar o'z asarlarida bir-birini ilhomlantirishi mumkin, bir birining ishlari orqali g'oya va mavzularni kengaytirishadi."
    },
    {
      "id": 157,
      "input": "Musiqa va rassomlikda \"abstraktsionizm\" qanday ishlatiladi?",
      "output": "Abstraktsionizm musiqa va rassomlikda real dunyoni emas, balki ichki hissiyotlar va abstrakt shakllarni ifodalashga qaratilgan."
    },
    {
      "id": 158,
      "input": "O'zbekistonning arxitektura tarixida eng mashhur yodgorliklar qaysilar?",
      "output": "O'zbekistonning arxitektura tarixida Registon maydoni, Shah-i Zinda, Bibi-Xonim masjidi va Xiva qishlog'ining ko'plab yodgorliklari mashhur."
    },
    {
      "id": 159,
      "input": "Tasviriy san'atda \"surrealizm\" va \"abstrakt ekspressionizm\" o'rtasidagi farq nima?",
      "output": "Surrealizm tush va real dunyo o'rtasidagi o'zgaruvchan bog'lanishni tasvirlasa, abstrakt ekspressionizm ichki kechinmalar va hissiyotlarni shakl va ranglar orqali ifodalaydi."
    },
    {
      "id": 160,
      "input": "Kino va teatr san'ati o'rtasidagi farq nima?",
      "output": "Kino va teatr san'ati o'rtasidagi farq texnologiyada, teatrda jonli ijro va sahna ishlari muhim bo'lsa, kinosahna film texnologiyalari yordamida suratga olinadi."
    },
    {
      "id": 161,
      "input": "San'atda \"nostaljiya\" qanday tasvirlanadi?",
      "output": "Nostaljiya san'atda o'tmishga bo'lgan sog'inch, yo'qolgan qadriyatlarni eslatib, o'sha davrning hissiy holatlarini aks ettiradi."
    },
    {
      "id": 162,
      "input": "Musiqa va teatrda \"ritm\"ning roli qanday?",
      "output": "Ritm musiqa va teatrda harakat, vaqt va ohangni tartibga soladi, voqealarni tizimli va oqilona ifodalashga yordam beradi."
    },
    {
      "id": 163,
      "input": "O'zbek madaniyatida \"nasr\"ning o'rni qanday?",
      "output": "Nasr o'zbek madaniyatida adabiyotning asosiy shakllaridan biri bo'lib, hikoya va romanlarning muhim qismini tashkil etadi."
    },
    {
      "id": 164,
      "input": "Rassomlar tarixiy voqealarni qanday ifodalaydi?",
      "output": "Rassomlar tarixiy voqealarni asarlarini yaratishda ranglar, shakllar va kompozitsiyalardan foydalanib tasvirlashadi."
    },
    {
      "id": 165,
      "input": "Madaniyatda \"interaktiv san'at\" qanday rivojlanmoqda?",
      "output": "Interaktiv san'at texnologiyalar yordamida tomoshabinlarni asar bilan bevosita aloqada bo'lishga chaqiradi, bu orqali yangi tajribalar va hissiyotlar yaratiladi."
    },
    {
      "id": 166,
      "input": "San'at asarlarida \"simvolizm\" qanday ishlatiladi?",
      "output": "Simvolizm san'atda ma'lum belgi yoki ranglar orqali chuqur ma'nolarni ifodalashni anglatadi."
    },
    {
      "id": 167,
      "input": "\"Maqom\" musiqasida qatnashadigan asboblar qanday?",
      "output": "Maqom musiqasida ud, rubob, tambur, doira kabi asboblar qatnashadi."
    },
    {
      "id": 168,
      "input": "Arxitektura va dizaynda \"minimalizm\"ning o'rni qanday?",
      "output": "Minimalizm arxitektura va dizaynda oddiylik, funksionallik va ortiqcha tafsilotlardan voz kechishni ifodalaydi."
    },
    {
      "id": 169,
      "input": "San'atda \"konstruktivizm\" nima?",
      "output": "Konstruktivizm san'ati ob'ektlarning strukturasi va shakllariga katta e'tibor qaratadi, amaliyotga va texnologiyaga asoslanadi."
    },
    {
      "id": 170,
      "input": "Musiqa va san'atda \"tembr\" nima?",
      "output": "Tembr musiqa va san'atda ovozning xususiyatlari, uning sifat va rangini ifodalash uchun ishlatiladigan atamadir."
    },
    {
      "id": 171,
      "input": "Rassomlikda \"post-impresionizm\" nima?",
      "output": "Post-impresionizm tasviriy san'atda rang va yorug'likdan ko'ra, shakllar, tuyg'ular va ichki holatlarni aks ettirishga qaratilgan."
    },
    {
      "id": 172,
      "input": "O'zbek kino san'atida \"romantizm\"ning o'rni qanday?",
      "output": "O'zbek kino san'atida romantizm sevgi, insoniylik va tabiiy go'zallikni yoritib, inson ruhiyatining nozik tomonlarini ochib beradi."
    },
    {
      "id": 173,
      "input": "Rassomlarning ijodida \"inspiratsiya\" qanday ro'l o'ynaydi?",
      "output": "Inspiratsiya rassomni ijod qilishga undaydi va yangi asar yaratishga imkon beradi, ko'pincha tabiat, tuyg'ular yoki boshqa san'at asarlaridan kelib chiqadi."
    },
    {
      "id": 174,
      "input": "Madaniyatda \"gumanizm\"ning roli qanday?",
      "output": "Gumanizm inson huquqlarini, erkinligini va ma'naviy qadriyatlarni hurmat qilishni ilgari suradi, san'at va madaniyatning rivojlanishiga katta ta'sir ko'rsatadi."
    },
    {
      "id": 175,
      "input": "San'atda \"minimalizm\" va \"maksimalizm\" o'rtasidagi farq nima?",
      "output": "Minimalizm kamroq elementlar va soddalikni ifodalashni maqsad qilsa, maksimalizm ortiqcha tafsilotlar va boylikka asoslanadi."
    },
    {
      "id": 176,
      "input": "Rassomlikda \"abstraktsionizm\" qanday ifodalanadi?",
      "output": "Abstraktsionizm rassomlikda shakl, rang va chiziqlar orqali ma'lum bir tasvirni emas, balki hissiyotlar va g'oyalarni ifodalaydi."
    },
    {
      "id": 177,
      "input": "O'zbek san'ati va xalq hunarmandchiliklari o'rtasidagi aloqalar qanday?",
      "output": "O'zbek san'ati va xalq hunarmandchiligi o'zaro bog'liq bo'lib, xalq san'ati an'anaviy elementlar va dastlabki madaniy qadriyatlarni ifodalaydi."
    },
    {
      "id": 178,
      "input": "San'atda \"eksperimentalizm\" nima?",
      "output": "Eksperimentalizm san'atda yangi texnikalar, shakllar va g'oyalar bilan tajriba o'tkazish va an'anaviy chegaralardan chiqishni anglatadi."
    },
    {
      "id": 179,
      "input": "Teatrda \"klassik\" va \"modern\" yondashuvlar o'rtasidagi farq nima?",
      "output": "Klassik teatr asarlari an'anaviy va qat'iy struktura asosida bo'lsa, modern teatr yangi shakllar va ijtimoiy masalalarni o'rganishga intiladi."
    },
    {
      "id": 180,
      "input": "San'atda \"simmetriya\" qanday ishlatiladi?",
      "output": "Simmetriya san'atda tasvirlarning uyg'unligini, muvozanat va tartibni yaratishga yordam beradi."
    },
    {
      "id": 181,
      "input": "O'zbek teatrida \"muzikal\" janrining xususiyatlari qanday?",
      "output": "O'zbek teatrida \"muzikal\" janri qo'shiqlar, raqslar va ijro etiladigan dramatik elementlarni birlashtiradi, tomoshabinlarni zavqlantiradi."
    },
    {
      "id": 182,
      "input": "San'atda \"sotsializm realizmi\" nima?",
      "output": "Sotsializm realizmi san'ati ijtimoiy voqelikni idealizatsiyalashga, kommunistik qadriyatlarni targ'ib qilishga qaratilgan."
    },
    {
      "id": 183,
      "input": "O'zbek madaniyatida \"tasavvuf\"ning o'rni qanday?",
      "output": "Tasavvuf O'zbek madaniyatida ruhiy o'sish, ichki tinchlik va ijtimoiy ma'naviy qadriyatlarni tarbiyalashda katta ahamiyatga ega."
    },
    {
      "id": 184,
      "input": "Musiqa asarlarida \"dinamika\" nima?",
      "output": "Musiqa asarlarida dinamika ovozning balandligi va tovushning kuchayishi yoki pasayishi orqali ifodalanadi."
    },
    {
      "id": 185,
      "input": "Rassomlikda \"realizm\" va \"idealizm\" o'rtasidagi farq nima?",
      "output": "Realizm haqiqatni obyektiv tarzda tasvirlashga intilsa, idealizm tabiatni yoki insonni mukammal va go'zal tarzda ifodalashga qaratiladi."
    },
    {
      "id": 186,
      "input": "Arxitektura va dizaynda \"barokko\" uslubi qanday ifodalanadi?",
      "output": "Barokko uslubi yuqori dinamikani, murakkablikni va emotsional kuchni tasvirlash uchun badiiy shakllarni va beqaror tuzilmalarni ishlatadi."
    },
    {
      "id": 187,
      "input": "O'zbek musiqasida \"shashmaqom\"ning xususiyatlari qanday?",
      "output": "Shashmaqom O'zbek musiqasining an'anaviy maqomlardan biri bo'lib, u o'ziga xos melodiyalar, ritmlar va ranglarni ifodalashga qaratilgan."
    },
    {
      "id": 188,
      "input": "Madaniyatda \"poliromiya\" nima?",
      "output": "Poliomiyalik musiqada bir nechta mustaqil va muvofiqlashtirilgan melodiya yoki ritmning birgalikda ijro etilishi orqali ifodalanadi."
    },
    {
      "id": 189,
      "input": "Arxitektura san'atida \"neoklassik\" uslubi qanday xususiyatlarga ega?",
      "output": "Neoklassik uslub arxitekturadagi klassik elementlarni yangilab, simmetriya, keng va yorqin fazalarni yaratishga asoslanadi."
    },
    {
      "id": 190,
      "input": "O'zbek xalq amaliy san'ati qanday materiallardan foydalanadi?",
      "output": "O'zbek xalq amaliy san'ati ipak, paxta, gilam, yog'och va metall kabi tabiiy materiallardan foydalanadi."
    },
    {
      "id": 191,
      "input": "Madaniyatda \"mavzunlik\" qanday ishlatiladi?",
      "output": "Mavzunlik madaniyatda estetik muvozanat va tartibni yaratish uchun elementlarning bir-biriga uyg'unligini ta'minlashga qaratilgan."
    },
    {
      "id": 192,
      "input": "San'atda \"didaktik\" elementlarning roli qanday?",
      "output": "Didaktik elementlar san'atda axloqiy yoki ta'limiy maqsadlarni amalga oshirish uchun ishlatiladi, ular asarga ma'lum bir g'oya yoki darsni etkazadi."
    },
    {
      "id": 193,
      "input": "Kino san'atida \"dokumental\" janrning o'rni qanday?",
      "output": "Dokumental kino real hayotiy hodisalarni tasvirlash orqali jamiyatga axborot va ta'lim berishga qaratilgan."
    },
    {
      "id": 194,
      "input": "O'zbek madaniyatida \"keramika\"ning o'rni qanday?",
      "output": "Keramika O'zbek madaniyatida qadimdan ishlab kelinib, amaliy san'at sifatida go'zal va foydali buyumlar yaratishga xizmat qilgan."
    },
    {
      "id": 195,
      "input": "\"Renessans\" san'atining xususiyatlari qanday?",
      "output": "Renessans san'ati insoniyatning yangi tushunchalarini va ilmiy yutuqlarini aks ettirgan, ko'proq realizm va tabiiylikka asoslangan."
    },
    {
      "id": 196,
      "input": "Madaniyatda \"xosiladorlik\" nima?",
      "output": "Xosiladorlik madaniyatda insoniyatning ma'naviy va intellektual yutuqlarini ifodalash, o'zgarishlarni yaratish va yangi qiymatlar yaratish jarayonidir."
    },
    {
      "id": 197,
      "input": "Rassomlikda \"kolaj\" texnikasi qanday ishlatiladi?",
      "output": "Kolaj texnikasida turli materiallar, ranglar va ob'ektlar birlashtirilgan holda yangi kompozitsiya hosil qilinadi."
    },
    {
      "id": 198,
      "input": "San'atda \"gotika\" va \"barokko\" o'rtasidagi farq nima?",
      "output": "Gotika uslubi baland minoralar va g'ishtli strukturalar bilan ajralib turadi, barokko esa boylik, harakat va emotsional kuchni o'z ichiga oladi."
    },
    {
      "id": 199,
      "input": "O'zbek xalq musiqasida \"yalla\" qanday ifodalanadi?",
      "output": "Yalla O'zbek xalq musiqasining asosiy janrlaridan bo'lib, xalqning qo'shiqlari va raqslariga bag'ishlangan ritmik va dinamik uslubni ifodalaydi."
    },
    {
      "id": 200,
      "input": "San'atda \"allegoriya\" qanday ishlatiladi?",
      "output": "Allegoriya san'atda ma'lum bir tushuncha yoki g'oyani ramzlar yoki metaforalar orqali tasvirlashga asoslanadi."
    },
    {
      "id": 201,
      "input": "San'atda \"kollaj\" va \"montaj\" o'rtasidagi farq nima?",
      "output": "Kollaj turli materiallar va obyektlarni birlashtirib yangi kompozitsiya yaratish bo'lsa, montaj film yoki videoda kadrlarni tartibga solib voqea oqimini tashkil etishdir."
    },
    {
      "id": 202,
      "input": "O'zbek teatrida \"sirk\" san'ati qanday rivojlanadi?",
      "output": "O'zbekistonda sirk san'ati jismoniy harakatlar, akrobatika va hayvonlar bilan ishlash orqali tomoshabinlarga o'ziga xos ko'rsatuvlar taqdim etadi."
    },
    {
      "id": 203,
      "input": "Rassomlarning \"mavzu\" tanlashda qanday yondashuvlari bor?",
      "output": "Rassomlar mavzu tanlashda ichki kechinmalarini, jamiyatdagi muammolarni yoki tabiatni ilhom manbai sifatida ishlatadilar."
    },
    {
      "id": 204,
      "input": "San'atda \"fotorealizm\" nima?",
      "output": "Fotorealizm san'atida asar asosan fotografiyaga o'xshash tarzda, haqiqiy hayotni aniq va detalda tasvirlashga qaratiladi."
    },
    {
      "id": 205,
      "input": "O'zbek san'atida \"tasviriy san'at\" va \"badiiy hunarmandchilik\" o'rtasidagi farq nima?",
      "output": "Tasviriy san'at ko'proq estetik qiymatga ega bo'lsa, badiiy hunarmandchilik amaliy foyda keltiradi va dekorativ maqsadlar uchun yaratiladi."
    },
    {
      "id": 206,
      "input": "\"Moderna\" san'ati qanday xususiyatlarga ega?",
      "output": "Moderna san'ati, an'anaviy qadriyatlarni rad etib, yangi texnikalar, shakllar va ijtimoiy masalalarga diqqatni qaratadi."
    },
    {
      "id": 207,
      "input": "O'zbek xalq musiqasining \"turk\" ta'siri qanday namoyon bo'ladi?",
      "output": "O'zbek xalq musiqasining turk ta'siri o'ziga xos ritmlar, melodiyalar va uslublarda namoyon bo'ladi, bu esa musiqaning tarixiy ildizlarini aks ettiradi."
    },
    {
      "id": 208,
      "input": "Rassomlar asar yaratishda \"san'at terapiyasi\"ni qanday ishlatadilar?",
      "output": "San'at terapiyasi rassomlarga ichki his-tuyg'ularini ifodalash, stressni kamaytirish va ruhiy holatni yaxshilash uchun ishlatiladi."
    },
    {
      "id": 209,
      "input": "Teatrda \"berliner kabare\" janri qanday xususiyatlarga ega?",
      "output": "Berliner kabare jozibador sahna ko'rsatuvlari, musiqa, raqs va komediyaga asoslangan, asosan ijtimoiy va siyosiy tanqidlarga urg'u beradi."
    },
    {
      "id": 210,
      "input": "Rassomlarning asarlarini tanlashda \"kompozitsiya\"ning roli qanday?",
      "output": "Kompozitsiya asar shaklini, tasvirning tartibini va uning hissiy ta'sirini yaratishda asosiy rolni o'ynaydi."
    },
    {
      "id": 211,
      "input": "Musiqa asarlarida \"orquestra\" qanday ishlatiladi?",
      "output": "Orkestr musiqa asarida turli asboblar guruhlarini birlashtirgan holda turli ohanglarni va hissiyotlarni uyg'unlashtiradi."
    },
    {
      "id": 212,
      "input": "San'atda \"estetika\"ning o'rni qanday?",
      "output": "Estetika san'atni va uning go'zalligini o'rganish bilan shug'ullanadi, u asarning hissiy va fikriy ta'sirini yaratadi."
    },
    {
      "id": 213,
      "input": "O'zbek xalq san'ati va \"tug'ma hunar\" o'rtasidagi aloqalar qanday?",
      "output": "O'zbek xalq san'ati an'anaviy hunarmandchilik va amaliy san'atni o'z ichiga olib, har bir avlod tomonidan davom ettiriladigan \"tug'ma hunar\"ni ta'kidlaydi."
    },
    {
      "id": 214,
      "input": "Arxitektura va dizaynda \"avantgarde\" uslubi qanday ifodalanadi?",
      "output": "Avantgarde uslubi an'anaviy me'yorlarni buzib, yangi va eksperimental shakllar, materiallar va dizayn elementlarini o'z ichiga oladi."
    },
    {
      "id": 215,
      "input": "San'atda \"simbolizm\" qanday ishlatiladi?",
      "output": "Simbolizm asarlarda ma'lum bir g'oya yoki tushunchani ramzlar va tasvirlar orqali ifodalaydi."
    },
    {
      "id": 216,
      "input": "\"Renessans\" va \"Barokko\" san'ati o'rtasidagi farq nima?",
      "output": "Renessans san'ati insoniyat va tabiiy dunyoni ilohiylashtirishga intilgan bo'lsa, barokko san'ati hissiy ta'sir va teatriy dramatizmni ko'rsatadi."
    },
    {
      "id": 217,
      "input": "O'zbek san'ati va xalq raqsining o'ziga xosliklari qanday?",
      "output": "O'zbek san'ati va xalq raqsining o'ziga xosligi o'ziga xos ritmlar, harakatlar va xushchaqchaqlikni ifodalovchi elementlardan iborat."
    },
    {
      "id": 218,
      "input": "San'atda \"yuqori realizm\" qanday ishlatiladi?",
      "output": "Yuqori realizm san'ati tabiatni yoki inson hayotini juda aniq, detallarga e'tibor berib tasvirlashga intiladi."
    },
    {
      "id": 219,
      "input": "O'zbek madaniyatida \"yig'ish\" va \"san'at asari yaratish\" o'rtasidagi farq nima?",
      "output": "Yig'ish amaliy faoliyatni anglatadi, san'at asari yaratish esa ijodiy va hissiy tajribani aks ettiradi."
    },
    {
      "id": 220,
      "input": "Madaniyatda \"pop-art\"ning o'rni qanday?",
      "output": "Pop-art san'ati ommaviy madaniyatni, reklama va mashhur madaniyat elementlarini san'atga aylantirish orqali kashfiyotchilik va tanqidni yaratadi."
    },
    {
      "id": 221,
      "input": "Kino san'ati va \"animatsiya\"ning o'rni qanday?",
      "output": "Kino san'ati real tasvirlar va hikoyalar orqali voqealarni aks ettirsa, animatsiya badiiy va ijodiy tasvirlarni yaratish orqali hissiy ta'sirni kuchaytiradi."
    },
    {
      "id": 222,
      "input": "O'zbek teatri tarixida \"khabar\" va \"muqaddima\" qanday o'rin tutadi?",
      "output": "O'zbek teatri tarixida \"khabar\" dramatik asarlarning boshlanishi, \"muqaddima\" esa asarning asosiy maqsadi va ko'rsatuvini belgilaydi."
    },
    {
      "id": 223,
      "input": "San'atda \"eksperiment\" qanday ishlatiladi?",
      "output": "Eksperiment san'atda yangi g'oyalarni amalga oshirish, turli materiallar yoki texnikalarni sinab ko'rish orqali yangi shakllar yaratishga olib keladi."
    },
    {
      "id": 224,
      "input": "Musiqa san'atida \"harmony\" nima?",
      "output": "Harmony musiqada bir nechta notalarning birgalikda ijro etilishi va ularning bir-biriga uyg'unligidan hosil bo'ladigan go'zallikdir."
    },
    {
      "id": 225,
      "input": "\"Romantizm\" va \"klassik\" musiqaning o'rtasidagi farq nima?",
      "output": "Romantizm musiqa hissiy ifodani va shaxsiy his-tuyg'ularni yoritish orqali yangi melodiyalarni yaratish, klassik musiqa esa muvozanat va aniqlikka asoslangan."
    },
    {
      "id": 226,
      "input": "O'zbek madaniyatida \"ruhoniy san'at\" qanday ifodalanadi?",
      "output": "Ruhoniy san'at O'zbek madaniyatida diniy, axloqiy va ruhiy tushunchalarni ifodalash orqali o'ziga xos madaniy qadriyatlarni yaratadi."
    },
    {
      "id": 227,
      "input": "Rassomlarning ishlatadigan \"yanada yorqin ranglar\" san'atda qanday ta'sir ko'rsatadi?",
      "output": "Yorqin ranglar san'atda dramatik va hissiy ta'sirni kuchaytiradi, tomoshabinning diqqatini jalb qiladi."
    },
    {
      "id": 228,
      "input": "Teatrda \"absurd\" janrining roli qanday?",
      "output": "Absurd teatr san'ati ma'nosiz vaziyatlar, o'zaro zid fikrlar va inson hayotining befoyda tomonlarini ko'rsatib, ijtimoiy va filosofik masalalarni yoritadi."
    },
    {
      "id": 229,
      "input": "San'atda \"psixologizm\" qanday ifodalanadi?",
      "output": "Psixologizm san'atda inson ichki dunyosini, ruhiy holatini va hissiyotlarini chuqur va detallarga e'tibor berib tasvirlashga asoslanadi."
    },
    {
      "id": 230,
      "input": "Madaniyatda \"avantgarde\" san'ati qanday rivojlanadi?",
      "output": "Avantgarde san'ati yangi va tajriba asosida yaratilgan asarlar, an'anaviy san'at shakllarini buzish va yangi g'oyalarni kashf qilishga yo'naltirilgan."
    },
    {
      "id": 231,
      "input": "San'atda \"naturalizm\"ning roli qanday?",
      "output": "Naturalizm san'ati hayotning haqiqiy va tabiiy holatini aniq va detallarga e'tibor berib tasvirlaydi."
    },
    {
      "id": 232,
      "input": "San'atda \"gotika\" uslubining xususiyatlari qanday?",
      "output": "Gotika uslubi baland minoralar, o'zgacha teshilgan derazalar va ilgari yasalgan konstruktsiyalar bilan ajralib turadi."
    },
    {
      "id": 233,
      "input": "Arxitektura san'atida \"dekorativ san'at\" qanday ishlatiladi?",
      "output": "Dekorativ san'at arxitektura elementlarining bezaklarini yaratishda, estetik ifodaning kuchaytirilishiga xizmat qiladi."
    },
    {
      "id": 234,
      "input": "\"Ekspresyonizm\" san'atida qanday g'oyalar aks ettiriladi?",
      "output": "Ekspresyonizm san'ati ichki hissiyotlarni va shaxsiy kechinmalarni kuchli va dinamik tarzda tasvirlashga qaratilgan."
    },
    {
      "id": 235,
      "input": "Musiqa asarlarida \"armoniyaga\" qanday e'tibor qaratiladi?",
      "output": "Armoniya bir necha tovushning uyg'un va izchil uyg'unlashgan bo'lishini ta'minlaydi, asarning estetik his-tuyg'usini oshiradi."
    },
    {
      "id": 236,
      "input": "San'atda \"pop-art\" nima?",
      "output": "Pop-art san'ati ommaviy madaniyat, reklama, iste'molchi madaniyatini tasvirlashga yo'naltirilgan san'at shaklidir."
    },
    {
      "id": 237,
      "input": "Rassomlikda \"impressionizm\" nima?",
      "output": "Impressionizm ranglar va yorug'likni tabiiy tarzda tasvirlashga qaratilgan, tez va qisqa chizgilar bilan ijod qilinadi."
    },
    {
      "id": 238,
      "input": "\"San'at asarida\" portret qanday yondashuv bilan yaratiladi?",
      "output": "Portret san'atda shaxsning yuz ifodasi, harakatlari va ichki holatini tasvirlashga qaratilgan."
    },
    {
      "id": 239,
      "input": "Arxitektura va dizaynda \"funktsionalizm\"ning o'rni qanday?",
      "output": "Funktsionalizm dizaynda ob'ektlar va tuzilmalar faqatgina amaliy ehtiyojlarni qondirish uchun yaratiladi, ortiqcha bezaklardan voz kechiladi."
    },
    {
      "id": 240,
      "input": "O'zbek musiqasida \"andijon\" uslubining xususiyatlari qanday?",
      "output": "Andijon uslubi o'zbek musiqasida an'anaviy maqomlar, sof melodiyalar va ritmik tuzilmalarga ega."
    },
    {
      "id": 241,
      "input": "San'atda \"romantizm\" qanday ifodalanadi?",
      "output": "Romantizm san'atida odamning ichki kechinmalari, tabiat bilan uyg'unlik va xususiy tafakkur tasvirlanadi."
    },
    {
      "id": 242,
      "input": "Madaniyatda \"realisme\" qanday ishlatiladi?",
      "output": "Realizm san'atda voqelikni, kundalik hayotning oddiy jihatlarini aniq va tabiiy tarzda tasvirlashni anglatadi."
    },
    {
      "id": 243,
      "input": "Teatrda \"absurd\" drama qanday xususiyatlarga ega?",
      "output": "Absurd drama lojiq va ma'no nuqtai nazaridan ifodalanadigan noaniqlik va kutilmagan hodisalar bilan xususiyatlanadi."
    },
    {
      "id": 244,
      "input": "Rassomlikda \"ekspresyonizm\" nima?",
      "output": "Ekspresyonizm rassomlikda ichki kechinmalar va hissiyotlarni o'zgartirilgan shakllar va ranglar orqali tasvirlashni anglatadi."
    },
    {
      "id": 245,
      "input": "O'zbek teatrida \"xalq dramasi\" janri qanday?",
      "output": "Xalq dramasi o'zbek xalqining an'anaviy qadriyatlari va ijtimoiy masalalarini sahnada tasvirlashga qaratilgan."
    },
    {
      "id": 246,
      "input": "San'atda \"impressionizm\" va \"ekspresyonizm\" o'rtasidagi farq nima?",
      "output": "Impressionizm tabiatning o'zgaruvchanligini aks ettirishga qaratilgan bo'lsa, ekspresyonizm inson ichki holatlarini dramatik tarzda tasvirlaydi."
    },
    {
      "id": 247,
      "input": "Arxitektura va dizaynda \"art-deko\" uslubining xususiyatlari qanday?",
      "output": "Art-deko uslubi geometriya va simmetriya, ranglar va bezaklarning boy kombinatsiyalarini yaratishda qo'llaniladi."
    },
    {
      "id": 248,
      "input": "Musiqa va san'atda \"melodiya\" nima?",
      "output": "Melodiya musiqa asarida davomiy va izchil tovushlar ketma-ketligi bo'lib, asarning asosiy tushunchasini yaratadi."
    },
    {
      "id": 249,
      "input": "\"Modernizm\" san'atida qanday yangi yondashuvlar mavjud?",
      "output": "Modernizm an'anaviy san'at shakllaridan voz kechib, yangi texnikalar va shakllarni yaratishga qaratilgan."
    },
    {
      "id": 250,
      "input": "O'zbek musiqasida \"doira\" asbobining o'rni qanday?",
      "output": "Doira o'zbek musiqasida ritmik asos sifatida, ayniqsa xalq raqslarida muhim rol o'ynaydi."
    },
    {
      "id": 251,
      "input": "Arxitektura san'atida \"futurizm\" qanday ifodalanadi?",
      "output": "Futurizm arxitekturasi kelajakni tasvirlashga, yangi shakllar va texnologiyalardan foydalanishga qaratilgan."
    },
    {
      "id": 252,
      "input": "O'zbek adabiyotida \"doston\"ning o'rni qanday?",
      "output": "Doston o'zbek adabiyotida uzun shakllar va epik asarlar bo'lib, xalqning tarixiy va madaniy merosini saqlaydi."
    },
    {
      "id": 253,
      "input": "Madaniyatda \"surrealizm\" nima?",
      "output": "Surrealizm san'atda xayol va haqiqat o'rtasidagi chegarani o'zgartirib, tasavvurlarni va hayoliy tasvirlarni yaratishga qaratilgan."
    },
    {
      "id": 254,
      "input": "Teatrda \"karnaval\" qanday ifodalanadi?",
      "output": "Karnaval teatrda turli xil xarakterlar va rol o'ynash orqali jamiyatdagi ijtimoiy tuzilmalarni va karikaturalikni aks ettiradi."
    },
    {
      "id": 255,
      "input": "San'atda \"animatsiya\" qanday ishlatiladi?",
      "output": "Animatsiya san'atda harakatlanuvchi tasvirlar va xarakterlar yaratish uchun ishlatiladigan texnologik yondashuvni anglatadi."
    },
    {
      "id": 256,
      "input": "Musiqa va san'atda \"harmony\" va \"melodiya\" o'rtasidagi farq nima?",
      "output": "Harmony tovushlarning uyg'unligi bo'lsa, melodiya ketma-ket ovozlarning asosiy strukturasini tashkil etadi."
    },
    {
      "id": 257,
      "input": "San'atda \"impressionizm\" va \"post-impressionizm\" o'rtasidagi farq nima?",
      "output": "Impressionizm tabiiy va aniqlik bilan rang va yorug'likni tasvirlashga qaratilgan, post-impressionizm esa hissiyotlar va shaxsiy izlanishlarga urg'u beradi."
    },
    {
      "id": 258,
      "input": "O'zbek musiqasida \"maqom\"ning xususiyatlari qanday?",
      "output": "Maqam O'zbek musiqasida an'anaviy va klassik melodik tuzilmalardan iborat bo'lib, ko'pincha o'ziga xos ohanglar va ritmlar bilan ifodalanadi."
    },
    {
      "id": 259,
      "input": "Rassomlikda \"konstruktivizm\" qanday ishlatiladi?",
      "output": "Konstruktivizm rassomlikda shakllarning soddalashtirilgan geometrik tuzilmasi va texnik birligini aks ettiradi."
    },
    {
      "id": 260,
      "input": "Madaniyatda \"sotsializm realizmi\" qanday tasvirlanadi?",
      "output": "Sotsializm realizmi ijtimoiy sinflarni tasvirlab, haqiqiy voqelikni va ishchi sinfning turmush tarzini idealizatsiya qilishga qaratilgan."
    },
    {
      "id": 261,
      "input": "O'zbek teatroidagi \"komediya\" janrining xususiyatlari qanday?",
      "output": "Komediya O'zbek teatrida ijtimoiy masalalarni yumor bilan yoritish, odamlarni kuldirish va fikrlashga undashga asoslanadi."
    },
    {
      "id": 262,
      "input": "Arxitektura va dizaynda \"bionik\" uslubining xususiyatlari qanday?",
      "output": "Bionik uslub tabiiy shakllardan ilhom olib, ular bilan bog'liq texnologik dizaynlarni yaratishga asoslanadi."
    },
    {
      "id": 263,
      "input": "San'atda \"postmodernizm\"ning o'rni qanday?",
      "output": "Postmodernizm san'atda an'anaviy qoidalardan voz kechib, parodiya, ironiya va ko'p madaniyatli yondashuvni aks ettiradi."
    },
    {
      "id": 264,
      "input": "O'zbek xalqi musiqasida \"karim\" uslubi qanday ishlatiladi?",
      "output": "Karim uslubi o'zbek musiqasida mahoratli ijro etilgan, an'anaviy va zamonaviy ritmlarni uyg'unlashtirgan asarlarni ifodalaydi."
    },
    {
      "id": 265,
      "input": "San'atda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizm san'atda xayoliy, g'ayrioddiy va realistik bo'lmagan tasvirlarni yaratishga asoslanadi, ko'pincha injiq tasavvurlarni ifodalash uchun ishlatiladi."
    },
    {
      "id": 266,
      "input": "O'zbek madaniyatida \"badiiy mumtoz musiqa\"ning o'rni qanday?",
      "output": "Badiiy mumtoz musiqa O'zbek madaniyatida ruhiy va madaniy qadriyatlarni aks ettirgan, milliy maqom va uslublarni ifodalovchi musiqiy an'analardir."
    },
    {
      "id": 267,
      "input": "Arxitektura va dizaynda \"yangi materiallar\"ning roli qanday?",
      "output": "Yangi materiallar arxitektura va dizaynda inshootlar va ob'ektlarning funksionalligi, estetikasini, shuningdek, atrof-muhitga moslashuvchanligini ta'minlashda muhim rol o'ynaydi."
    },
    {
      "id": 268,
      "input": "Musiqa san'ati qanday ijtimoiy va madaniy rol o'ynaydi?",
      "output": "Musiqa san'ati ijtimoiy va madaniy hayotni aks ettiradi, odamlarning hissiyotlarini, ijtimoiy holatini va madaniy qadriyatlarini ifodalashga yordam beradi."
    },
    {
      "id": 269,
      "input": "Teatrda \"tragediya\" janrining o'rni qanday?",
      "output": "Tragediya teatrda insoniyatning eng yuqori his-tuyg'ulari, jamiyatdagi adolatsizlik yoki hayotning mashaqqatlarini tasvirlashga qaratilgan asarlarni tashkil qiladi."
    },
    {
      "id": 270,
      "input": "Rassomlikda \"romantikizm\" va \"impressionizm\" o'rtasidagi farq nima?",
      "output": "Romantikizm shaxsiy hissiyotlar va tabiatni idealizatsiyalashga qaratilgan bo'lsa, impressionizm tabiatning o'zgaruvchanligini va yorug'likni aks ettirishga intiladi."
    },
    {
      "id": 271,
      "input": "O'zbek musiqasida \"maqom\" tizimi qanday ishlaydi?",
      "output": "Maqam tizimi O'zbek musiqasida maxsus ritmik va melodik tuzilmalar orqali an'anaviy tarzda ifodalangan, turli maqomlar orqali musiqiy hayotni taqdim etadi."
    },
    {
      "id": 272,
      "input": "Arxitektura san'atida \"barokko\" uslubining xususiyatlari qanday?",
      "output": "Barokko uslubi o'zining ornamentalligi, dramatik yorug'lik va kontrastlar, katta makonlarda yuqori detal va bezaklarga ega."
    },
    {
      "id": 273,
      "input": "O'zbek xalq musiqa asboblari haqida nimalarni bilasiz?",
      "output": "O'zbek xalq musiqa asboblari orasida rubob, doira, g'ijjak, tambur, dutor kabi asboblar mavjud bo'lib, har biri o'ziga xos musiqiy an'analarni davom ettiradi."
    },
    {
      "id": 274,
      "input": "Rassomlikda \"realizm\" va \"romantizm\" o'rtasidagi farq nima?",
      "output": "Realizm hayotning oddiy va haqiqiy tasvirini ifodalashga intilsa, romantizm tasvirlangan ob'ektlarga idealistik va xayoliy yondashadi."
    },
    {
      "id": 275,
      "input": "Madaniyatda \"rekonstruksiya\" nima?",
      "output": "Rekonstruksiya madaniy merosni tiklash va qayta tiklash jarayonini anglatadi, tarixiy obidalarni saqlab qolish maqsadida amalga oshiriladi."
    },
    {
      "id": 276,
      "input": "Musiqa va san'atda \"disonans\" nima?",
      "output": "Disonans tovushlar orasidagi notinch uyg'unlikni anglatadi, musiqada kuchli emotsional ta'sir yaratish uchun ishlatiladi."
    },
    {
      "id": 277,
      "input": "Arxitektura san'ati va ekologiya o'rtasidagi aloqalar qanday?",
      "output": "Arxitektura san'ati ekologiyaga hurmat bilan, atrof-muhitni asrash va tabiiy resurslardan samarali foydalanish prinsiplariga asoslanadi."
    },
    {
      "id": 278,
      "input": "San'atda \"simvolizm\" qanday ifodalanadi?",
      "output": "Simvolizm san'ati ramzlar, tasvirlar va belgilar orqali chuqur ma'nolarni ifodalashga qaratilgan."
    },
    {
      "id": 279,
      "input": "O'zbek teatrida \"klassik drama\" janrining o'rni qanday?",
      "output": "Klassik drama O'zbek teatrida asosan tarixiy va ijtimoiy masalalar, insoniyatning zamonaviy muammolarini ta'kidlash uchun ishlatiladi."
    },
    {
      "id": 280,
      "input": "Musiqa asarida \"ritm\"ning roli qanday?",
      "output": "Ritm musiqa asarining hayotiyligi va energiyasini belgilab beradi, vaqt va harakatning asosiy tuzilmasini tashkil qiladi."
    },
    {
      "id": 281,
      "input": "Rassomlikda \"minimalizm\" uslubi qanday tasvirlanadi?",
      "output": "Minimalizm rassomlikda soddalashgan shakllar va ranglardan foydalanib, ortiqcha bezaklardan voz kechishni ifodalaydi."
    },
    {
      "id": 282,
      "input": "San'atda \"surrealizm\"ning maqsadi qanday?",
      "output": "Surrealizm san'atda aniq va lojiqli bo'lmagan tasvirlar orqali inson ongsizligi va ichki dunyosini aks ettirishga intiladi."
    },
    {
      "id": 283,
      "input": "O'zbek madaniyatida \"rassomlik\"ning tarixi qanday?",
      "output": "O'zbek rassomligi qadim zamonlardan boshlab, xalqning kundalik hayoti, an'anaviy merosi va tabiatni tasvirlash orqali rivojlanib kelgan."
    },
    {
      "id": 284,
      "input": "Arxitektura va dizaynda \"organic\" uslubi qanday ishlatiladi?",
      "output": "Organic uslubi tabiiy shakllar va strukturalardan ilhom olib, binolar va dizayn elementlarini atrof-muhitga mos ravishda yaratishni anglatadi."
    },
    {
      "id": 285,
      "input": "O'zbek musiqasida \"makom\" va \"maqom\"ning farqi nima?",
      "output": "Makom an'anaviy O'zbek musiqasida maqom tizimi va strukturasi bo'lib, ular musiqiy asarlarda o'ziga xos melodiya va ritm tuzilmalari sifatida ishlatiladi."
    },
    {
      "id": 286,
      "input": "Musiqa va san'atda \"konsentratsiya\"ning roli qanday?",
      "output": "Konsentratsiya musiqada va san'atda ijro etuvchining fikr va hissiyotlarini to'liq va chuqur ifodalashga yordam beradi, ijroning samaradorligini oshiradi."
    },
    {
      "id": 287,
      "input": "Teatrda \"monodrama\" janri qanday tasvirlanadi?",
      "output": "Monodrama teatrda bitta personajning ichki dunyosi va kechinmalari orqali hikoya qilinadigan, ko'pincha yolg'iz chiqishdan iborat bo'lgan asar hisoblanadi."
    },
    {
      "id": 288,
      "input": "Rassomlikda \"abstrakt ekspresyonizm\" qanday tasvirlanadi?",
      "output": "Abstrakt ekspresyonizm rassomlikda ranglar va shakllar orqali ichki hissiyotlarni, emosional va sponton ifodalanadi."
    },
    {
      "id": 289,
      "input": "San'atda \"konseptualizm\" qanday ishlatiladi?",
      "output": "Konseptualizm san'ati asarning g'oyasi yoki tushunchasini shakl va materialdan ustun qo'yadi, estetikaning o'rniga ma'no va fikrni asosiy o'ringa qo'yadi."
    },
    {
      "id": 290,
      "input": "Musiqa asarlarida \"melancholiya\" qanday ifodalanadi?",
      "output": "Melancholiya musiqa asarlarida qayg'u, xafagarchilik yoki tasavvurdagi bir holatni aks ettiradigan past ohanglar va sekin ritm bilan ifodalanadi."
    },
    {
      "id": 291,
      "input": "O'zbek teatrida \"o'zbekcha komediya\" janrining xususiyatlari qanday?",
      "output": "O'zbekcha komediya o'ziga xos ijtimoiy va madaniy muammolarni yumor bilan taqdim etadi va xalqning turmush tarzini yoritadi."
    },
    {
      "id": 292,
      "input": "Arxitektura san'atida \"g'arbiy uslub\"ning xususiyatlari qanday?",
      "output": "G'arbiy uslub o'zining geometrik va simmetrik shakllari, ortiqcha bezaklardan voz kechgan soddaligi bilan ajralib turadi."
    },
    {
      "id": 293,
      "input": "San'atda \"foto-realizm\" qanday ishlatiladi?",
      "output": "Foto-realizm san'atda tasvirlar, real hayotning mukammal va detallarga boy tasvirini yaratishga qaratilgan uslubdir."
    },
    {
      "id": 294,
      "input": "O'zbek madaniyatida \"taqsir\" va \"taqsim\"ning o'rni qanday?",
      "output": "Taqsir va taqsim o'zbek madaniyatida shaxsiy yuksalish va jamiyatdagi ijtimoiy munosabatlarni ifodalashda muhim ahamiyatga ega."
    },
    {
      "id": 295,
      "input": "Musiqa asarida \"tonal\" va \"atonal\" uslublari o'rtasidagi farq nima?",
      "output": "Tonal musiqada ohang va tonallik mavjud bo'lib, u muayyan tonalda rivojlanadi, atonal musiqada esa bunday strukturaviy asos yo'q."
    },
    {
      "id": 296,
      "input": "Arxitektura san'ati va sport inshootlari o'rtasidagi farq nima?",
      "output": "Arxitektura san'ati ko'proq estetik va madaniy jihatlarga, sport inshootlari esa amaliy va funksional talablarni qondirishga qaratilgan."
    },
    {
      "id": 297,
      "input": "Musiqada \"interval\" nima?",
      "output": "Interval musiqada ikki tovush orasidagi masofa yoki masofani ifodalaydi."
    },
    {
      "id": 298,
      "input": "Teatrda \"aktsiyadagi boshqaruv\" nima?",
      "output": "Aktsiyadagi boshqaruv - bu aktyorlarning o'zaro munosabatlarini, sahnadagi harakatlarni va hissiyotlarni boshqarish san'ati."
    },
    {
      "id": 299,
      "input": "San'atda \"konstruktivizm\" qanday tasvirlanadi?",
      "output": "Konstruktivizm san'ati shakllarning geometrik va tizimli tartibini yaratishga asoslangan, texnologik va funksional jihatlarni inobatga oladi."
    },
    {
      "id": 300,
      "input": "O'zbek musiqasida \"xiyonat\" nima?",
      "output": "Xiyonat O'zbek musiqasida biron bir nojo'ya yoki salbiy holatni tasvirlashda ishlatiladigan atama bo'lib, bu ko'pincha og'riqli yoki zararli holatni anglatadi."
    },
    {
      "id": 301,
      "input": "San'atda \"fotorealizm\" nima?",
      "output": "Fotorealizm san'ati tabiatni va kundalik hayotni fotosuratlar kabi detallar bilan tasvirlashga qaratilgan."
    },
    {
      "id": 302,
      "input": "Musiqada \"ritmik struktura\" nima?",
      "output": "Ritmik struktura musiqaning vaqt bo'ylab taqsimlangan qismlari bo'lib, u asarning umumiy harakati va dinamikasini belgilaydi."
    },
    {
      "id": 303,
      "input": "Arxitektura san'ati va qishloq uylarida qanday o'xshashliklar mavjud?",
      "output": "Arxitektura san'ati va qishloq uylarida oddiylik, tabiiy materiallar va amaliy ehtiyojlarni inobatga olishda o'xshashliklar mavjud."
    },
    {
      "id": 304,
      "input": "O'zbek xalq musiqa asboblari orasida \"rubob\" qanday ishlatiladi?",
      "output": "Rubob O'zbek musiqasida melodik va ritmik musiqalarni yaratish uchun ishlatiladigan, yog'ochdan yasalgan, simli asbobdir."
    },
    {
      "id": 305,
      "input": "Rassomlikda \"kolorism\" nima?",
      "output": "Kolorism rassomlikda ranglarning muhim ahamiyatga ega bo'lishi, ranglarning o'zaro uyg'unligi va tasvirni jonlantirishi kiritiladi."
    },
    {
      "id": 306,
      "input": "Teatrda \"karnaval\" tushunchasi nima?",
      "output": "Karnaval teatrda tasvirlangan ijtimoiy va siyosiy o'zgarishlarni, ko'plab qahramonlar orqali parodiya va ijtimoiy tanqidni aks ettiradi."
    },
    {
      "id": 307,
      "input": "Madaniyatda \"folk\" musiqasi nima?",
      "output": "Folk musiqasi xalq orasida avloddan-avlodga o'tadigan, an'anaviy va ko'pincha voqelikni tasvirlovchi musiqadir."
    },
    {
      "id": 308,
      "input": "Arxitektura san'atida \"neoklassitsizm\" uslubi qanday ifodalanadi?",
      "output": "Neoklassitsizm uslubi antik yunon va rim san'atidan ilhomlanib, simmetriya, oddiylik va monumental dizaynlarni taqdim etadi."
    },
    {
      "id": 309,
      "input": "Musiqada \"modulyatsiya\" nima?",
      "output": "Modulyatsiya musiqada bir tonaldan boshqasiga o'tishni anglatadi, bu ritm va ohangni yangilashga yordam beradi."
    },
    {
      "id": 310,
      "input": "San'atda \"minimalizm\" va \"maksimalizm\" o'rtasidagi farq nima?",
      "output": "Minimalizm soddalikka, ortiqcha tafsilotlardan voz kechishga asoslanadi, maksimalizm esa boy, detallarga boy va bezatilgan shakllarga yo'naltirilgan."
    },
    {
      "id": 311,
      "input": "O'zbek madaniyatida \"divan\"ning o'rni qanday?",
      "output": "Divan O'zbek madaniyatida mehmonni kutish, ularni taklif qilish va muloqot qilish uchun ishlatiladigan an'anaviy mebel bo'lib, jamoat muhitining markaziy qismi hisoblanadi."
    },
    {
      "id": 312,
      "input": "Musiqada \"ritmik dissonans\" nima?",
      "output": "Ritmik dissonans musiqa asarida ritm va tembrning uyg'un bo'lmagan va beqarorligi, musiqaning intensivligini oshiradi."
    },
    {
      "id": 313,
      "input": "San'atda \"simvolizm\" qanday ishlatiladi?",
      "output": "Simvolizm san'atda maxsus ramzlar va belgilar orqali ma'nolarni ifodalashni ta'minlaydi, badiiy ifodaning chuqurligini oshiradi."
    },
    {
      "id": 314,
      "input": "Rassomlikda \"psixologik portret\" qanday yaratilyapti?",
      "output": "Psixologik portret rasmlar orqali insonning ichki holatini, kechinmalarini va ruhiy holatini aks ettirishga qaratilgan."
    },
    {
      "id": 315,
      "input": "Arxitektura san'atida \"yangi arxitektura\" qanday ishlanadi?",
      "output": "Yangi arxitektura uslubi zamonaviy texnologiyalar va materiallar bilan yaratilib, eski arxitekturaga qarshi yangilik va kreativlikni ta'minlaydi."
    },
    {
      "id": 316,
      "input": "Musiqada \"intonatsiya\" nima?",
      "output": "Intonatsiya musiqada tovushlarning va ohanglarning qo'llanilishi va o'zaro aloqasini, uning ifodalanuvchanligini belgilaydi."
    },
    {
      "id": 317,
      "input": "Teatrda \"ekspressionizm\" qanday ifodalanadi?",
      "output": "Ekspressionizm teatrda ichki ruhiy holatni, his-tuyg'ularni noan'anaviy va dramatik usullar bilan aks ettiradi."
    },
    {
      "id": 318,
      "input": "Madaniyatda \"traditsionalizm\" nima?",
      "output": "Traditsionalizm madaniyatda an'anaviy qadriyatlar, urf-odatlar va tarixiy tajribalarni saqlashga intilishdir."
    },
    {
      "id": 319,
      "input": "O'zbek musiqasida \"dolzarb\" qanday ishlatiladi?",
      "output": "Dolzarb musiqada juda muhim yoki joriy zamon bilan bog'liq bo'lgan mavzularni, hissiyotlarni ifodalash uchun ishlatiladi."
    },
    {
      "id": 320,
      "input": "Arxitektura san'ati va \"saqlash\" masalalari qanday bog'liq?",
      "output": "Arxitektura san'ati tarixiy obidalarni, arxitektura yodgorliklarini saqlash va qayta tiklash orqali madaniy merosni himoya qilishga qaratilgan."
    },
    {
      "id": 321,
      "input": "Rassomlikda \"grafika\" ning xususiyatlari qanday?",
      "output": "Grafika san'ati qog'ozga yoki boshqa materiallarga ishlov berish orqali yaratilgan chizmalardan iborat bo'lib, uning asosiy xususiyati aniq va aniq chizilgan shakllardir."
    },
    {
      "id": 322,
      "input": "Musiqada \"moda\" va \"xalq musiqasi\" o'rtasidagi farq nima?",
      "output": "Moda musiqasi ko'proq zamonaviy janrlar va pop madaniyatini anglatadi, xalq musiqasi esa an'anaviy va milliy musiqiy asarlardan iborat bo'ladi."
    },
    {
      "id": 323,
      "input": "Teatrda \"improvisatsiya\" qanday ishlatiladi?",
      "output": "Improvisatsiya teatrda ma'lum bir sahnada rejalashtirilmagan va spontan tarzda yaratilgan harakat va dialoglar orqali ijro etiladi."
    },
    {
      "id": 324,
      "input": "O'zbek adabiyotida \"hikoya\" janrining xususiyatlari qanday?",
      "output": "Hikoya janri o'zbek adabiyotida qisqa, lakonik va ma'no bilan boy bo'lib, ko'pincha o'zgaruvchan jamiyatdagi muammolarni tasvirlaydi."
    },
    {
      "id": 325,
      "input": "San'atda \"populizm\" qanday ishlatiladi?",
      "output": "Populizm san'ati keng ommaga yo'naltirilgan, oddiy odamlar va ularning kundalik hayotini aks ettiruvchi asarlarni yaratadi."
    },
    {
      "id": 326,
      "input": "Arxitektura san'atida \"neogotik\" uslubi qanday ifodalanadi?",
      "output": "Neogotik uslubi o'rta asr gotikasidan ilhomlanib, yuqori minoralar, murakkab yelimlar va g'ayrioddiy arxitektura shakllaridan foydalanadi."
    },
    {
      "id": 327,
      "input": "Rassomlikda \"symbolizm\" va \"abstraktsionizm\" o'rtasidagi farq nima?",
      "output": "Symbolizm ma'lum bir ma'no yoki tasvirni ramz orqali ifodalaydi, abstraktsionizm esa shakllarning va ranglarning ma'lum bir belgisizligi orqali tasvirni yaratadi."
    },
    {
      "id": 328,
      "input": "Arxitektura va san'atda \"moderna\" uslubi qanday ishlatiladi?",
      "output": "Moderna uslubi san'atda va arxitekturada bezaklar, organik shakllar va funksional dizayndan foydalanishni anglatadi, bu estetikani birlashtiradi."
    },
    {
      "id": 329,
      "input": "Musiqada \"quyosh\" va \"oy\" tasvirlari qanday ishlatiladi?",
      "output": "Quyosh va oy musiqada tabiiy holatlarni, kechinmalarni va kayfiyatlarni ifodalovchi ramzlar sifatida ishlatiladi."
    },
    {
      "id": 330,
      "input": "Teatrda \"dastlabki qo'ng'iroq\" nima?",
      "output": "Dastlabki qo'ng'iroq teatrda sahnada boshlanishni bildiradi, odatda aktyorlar uchun sahnaga chiqishni yoki harakatni boshlashni belgilaydi."
    },
    {
      "id": 331,
      "input": "San'atda \"grafik dizayn\" nima?",
      "output": "Grafik dizayn vizual tasvirlarni yaratish san'atidir, bu shaxsiy yoki tijorat maqsadlarida logotiplar, plakatlar, kitoblar va boshqa materiallarni yaratishni o'z ichiga oladi."
    },
    {
      "id": 332,
      "input": "Arxitektura san'atida \"futurizm\" uslubi qanday tasvirlanadi?",
      "output": "Futurizm uslubi o'ziga xos shakllar, tezlik, texnologiya va o'zgaruvchan muhitni aks ettiradi, tezkor va dinamik dizaynni yaratishga intiladi."
    },
    {
      "id": 333,
      "input": "O'zbek musiqasida \"melodiya\"ning o'rni qanday?",
      "output": "Melodiya O'zbek musiqasida asosiy estetik va emosional tarkib bo'lib, ma'lum bir maqom yoki ritmik tuzilma asosida yaratiladi."
    },
    {
      "id": 334,
      "input": "Rassomlikda \"surrealizm\" qanday ifodalanadi?",
      "output": "Surrealizm tasvirlarda odatiy va tushunarsiz holatlarni, va'da qilinmagan va mantiqsiz tasavvurlarni aks ettiradi."
    },
    {
      "id": 335,
      "input": "San'atda \"minimalizm\" va \"makro\" uslublar o'rtasidagi farq nima?",
      "output": "Minimalizm soddalikka asoslanadi, faqat kerakli elementlarni o'z ichiga oladi, makro uslub esa katta, detallangan va murakkab kompozitsiyalardan foydalanadi."
    },
    {
      "id": 336,
      "input": "Musiqada \"harmony\" nima?",
      "output": "Harmony musiqada bir nechta tovushning bir-biri bilan uyg'unligi, umumiy ritmik va melodik strukturani yaratadi."
    },
    {
      "id": 337,
      "input": "Arxitektura san'ati va ekologiya o'rtasidagi bog'liqlik qanday?",
      "output": "Arxitektura ekologiyani hisobga olib, barqaror, tabiiy resurslardan samarali foydalanadigan va atrof-muhitga mos inshootlar yaratishga qaratilgan."
    },
    {
      "id": 338,
      "input": "Teatrda \"konflikt\" qanday ishlatiladi?",
      "output": "Konflikt teatrda turli tomonlarning qarama-qarshiliklari va o'zaro munosabatlarini aks ettirish orqali dramatik va hissiy taranglik yaratadi."
    },
    {
      "id": 339,
      "input": "Rassomlikda \"konstruktivizm\" qanday ifodalanadi?",
      "output": "Konstruktivizm rasmlarda geometrik shakllar, industrial va texnologik elementlar orqali kompozitsiya yaratish va funksionallikni ta'kidlashga asoslanadi."
    },
    {
      "id": 340,
      "input": "O'zbek madaniyatida \"tanqid\"ning o'rni qanday?",
      "output": "Tanqid O'zbek madaniyatida asarlar va ijtimoiy hayotdagi muammolarni chuqur tahlil qilish, fikr yuritish va ijtimoiy o'zgarishlarga turtki berish maqsadida ishlatiladi."
    },
    {
      "id": 341,
      "input": "Musiqada \"akord\" nima?",
      "output": "Akord musiqada bir nechta tovushning bir vaqtning o'zida yangragan birlashmasi, asosan tonal tizimda ishlatiladi."
    },
    {
      "id": 342,
      "input": "Arxitektura san'atida \"klassik uslub\" qanday tasvirlanadi?",
      "output": "Klassik uslub arxitekturadagi simmetriya, bezak, murakkab balustradalar, kolonnalar va monumental shakllarni o'z ichiga oladi."
    },
    {
      "id": 343,
      "input": "San'atda \"ekspresionizm\" qanday ishlatiladi?",
      "output": "Ekspresionizm san'ati ichki hissiyotlar va shaxsiy kechinmalarni ta'kidlab, o'ziga xos, deformatsiyalangan shakllar va ranglardan foydalanadi."
    },
    {
      "id": 344,
      "input": "O'zbek musiqasida \"maqom\"ning ahamiyati qanday?",
      "output": "Maqam O'zbek musiqasida turli melodik tuzilmalar va ranglarning uyg'unligini ta'minlashda, madaniy merosni saqlashda muhim rol o'ynaydi."
    },
    {
      "id": 345,
      "input": "Musiqa va san'atta \"atonalizm\" nima?",
      "output": "Atonalizm musiqada ma'lum bir tonallikka bog'lanmagan, erkin ohanglar va noto'g'ri uyg'unlikni taqdim etadigan uslubdir."
    },
    {
      "id": 346,
      "input": "Rassomlikda \"impresionizm\"ning maqsadi qanday?",
      "output": "Impresionizm rassomlikda yorug'lik va ranglarning vaqtinchalik o'zgarishlarini, real voqealarni yoki manzaralarni tasvirlashga qaratilgan."
    },
    {
      "id": 347,
      "input": "Teatrda \"monolog\" va \"dialog\" o'rtasidagi farq nima?",
      "output": "Monolog bitta personajning uzoq davom etadigan so'zlari bo'lsa, dialog ikki yoki undan ortiq personaj o'rtasidagi o'zaro suhbatdir."
    },
    {
      "id": 348,
      "input": "Arxitektura san'atida \"neobarokko\" uslubi qanday ifodalanadi?",
      "output": "Neobarokko uslubi barokko uslubining klassik bezaklarini, monumentalizmni va ornatlarni modernizatsiya qilish orqali shakllanadi."
    },
    {
      "id": 349,
      "input": "Musiqada \"modulyatsiya\" qanday ishlatiladi?",
      "output": "Modulyatsiya bir tonaldan boshqasiga o'tishni anglatadi va musiqa asarida tonal o'zgarishlar yaratishga yordam beradi."
    },
    {
      "id": 350,
      "input": "O'zbek madaniyatida \"to'y\"ning san'at bilan aloqasi qanday?",
      "output": "O'zbek madaniyatida to'y tadbirlari musiqa, raqs, she'rlar va an'anaviy san'at elementlari bilan boyitilgan madaniy hodisadir."
    },
    {
      "id": 351,
      "input": "Arxitektura san'ati va \"yer usti\" ob'ektlarining o'rtasidagi aloqalar qanday?",
      "output": "Yer usti ob'ektlarining arxitekturasi tabiiy landshaftni hisobga olib, ekologik va estetik jihatlarni uyg'unlashtiradi."
    },
    {
      "id": 352,
      "input": "Teatrda \"reji\"ning o'rni qanday?",
      "output": "Reji teatrda sahnaning tashkiloti, aktyorlarning harakatlari, dialoglar va umumiy kompozitsiyaga boshqaruvni anglatadi."
    },
    {
      "id": 353,
      "input": "Musiqa asarida \"raks\" va \"tans\"ning ahamiyati qanday?",
      "output": "Raks va tans musiqa asarida ritm va harakat orqali hissiyotlarni ifodalashda, ijro etuvchining ifoda imkoniyatlarini kengaytirishda muhim rol o'ynaydi."
    },
    {
      "id": 354,
      "input": "Rassomlikda \"skulptura\"ning o'rni qanday?",
      "output": "Skulptura rassomlikda uch o'lchovli shakllarni yaratish orqali, fizik jihatlarni, muayyan mavzularni yoki his-tuyg'ularni aks ettiradi."
    },
    {
      "id": 355,
      "input": "Arxitektura san'atida \"geometriya\" qanday ishlatiladi?",
      "output": "Geometriya arxitektura san'atida inshootlarning strukturasi, simmetriyasini yaratishda va funksional dizaynni shakllantirishda muhim rol o'ynaydi."
    },
    {
      "id": 356,
      "input": "O'zbek musiqasida \"dutor\"ning ahamiyati qanday?",
      "output": "Dutor O'zbek xalq musiqasida ritmik va melodik izlanishlarga asoslangan, hamda o'ziga xos sozlamalari bilan musiqiy ifodaning markaziy qismidir."
    },
    {
      "id": 357,
      "input": "Teatrda \"kollaboratsiya\" nima?",
      "output": "Kollaboratsiya teatrda bir nechta san'atchilarning birgalikda ishlashini anglatadi, bu ijodiy jarayonda aktyorlar, rejissyorlar va dizaynerlarning hamkorligini o'z ichiga oladi."
    },
    {
      "id": 358,
      "input": "San'atda \"eksperiment\" qanday ishlatiladi?",
      "output": "Eksperiment san'atda yangi usullarni, materiallarni yoki texnikalarni sinovdan o'tkazish, ijodiy yondashuvni kengaytirish maqsadida ishlatiladi."
    },
    {
      "id": 359,
      "input": "Arxitektura san'atida \"Bauhaus\" maktabi qanday ifodalanadi?",
      "output": "Bauhaus maktabi minimalizm, funktsionalizm va yangi texnologiyalardan foydalanish asosida shakllangan arxitektura va dizayn uslubidir."
    },
    {
      "id": 360,
      "input": "Musiqada \"basso continuo\" nima?",
      "output": "Basso continuo barokko davrida ishlatilgan musiqa texnikasi bo'lib, asosan simfonik yoki klavishli asboblar bilan qoldirilgan asosli bass liniyasidan iboratdir."
    },
    {
      "id": 361,
      "input": "San'atda \"romantizm\" uslubi qanday ko'rsatiladi?",
      "output": "Romantizm san'ati insonga xos hissiyotlar, tabiatni ifodalash, individualizatsiya va fantastik tushunchalarni ta'kidlaydi."
    },
    {
      "id": 362,
      "input": "Teatrda \"absurd drama\" nima?",
      "output": "Absurd drama hayotning ma'nosizligini va insonning umidsizlikdagi holatini sahnada ko'rsatadi, ko'pincha mantiqsiz dialoglar va harakatlar bilan ifodalanadi."
    },
    {
      "id": 363,
      "input": "Arxitektura san'atida \"postmodernizm\" qanday ishlatiladi?",
      "output": "Postmodernizm arxitekturasi eski uslublardan ilhomlanib, ular bilan o'ynash, ironic elementlar va rang-baranglikni taqdim etadi."
    },
    {
      "id": 364,
      "input": "Musiqada \"fuga\" nima?",
      "output": "Fuga  bu musiqiy shakl bo'lib, bir nechta musiqa mavzularining bir-biriga bog'langan va takrorlanadigan tarzda ishlatilishi."
    },
    {
      "id": 365,
      "input": "O'zbek musiqasida \"lazgi\" qanday ifodalanadi?",
      "output": "Lazgi  bu O'zbek xalq musiqasining raqsga mos, tezkor va ritmik janri bo'lib, ko'pincha quvnoq va dinamik ohanglar bilan ifodalanadi."
    },
    {
      "id": 366,
      "input": "San'atda \"ekspressionizm\" va \"realizm\" o'rtasidagi farq nima?",
      "output": "Ekspressionizm ichki hissiyotlarni va ruhiy holatlarni aks ettirsa, realizm haqiqiy hayotni, oddiy odamlarning kundalik turmushini tasvirlaydi."
    },
    {
      "id": 367,
      "input": "Arxitektura san'ati va \"biomimetika\" o'rtasidagi bog'liqlik qanday?",
      "output": "Biomimetika arxitekturada tabiiy jarayonlar va shakllarni ilmiy asosda o'rganish va bu bilimlarni inshootlarda foydalanishga qaratilgan."
    },
    {
      "id": 368,
      "input": "Musiqada \"pentatonik\" maqom nima?",
      "output": "Pentatonik maqom beshta tovushdan tashkil topgan musiqiy tizimdir, odatda ko'plab xalq musiqalarida ishlatiladi."
    },
    {
      "id": 369,
      "input": "Rassomlikda \"abstrakt ekspressionizm\" qanday tasvirlanadi?",
      "output": "Abstrakt ekspressionizmda rassomlar o'z hissiyotlarini shakllar va ranglar orqali ifodalaydi, shakllar va kompozitsiya real narsalarga emas, balki ruhiy holatlarga bog'liqdir."
    },
    {
      "id": 370,
      "input": "Teatrda \"metateatr\" nima?",
      "output": "Metateatr teatrda teatrning o'zini aks ettiradigan, teatrni teatr orqali tahlil qiladigan yoki ko'rsatuv jarayonini tanqid qiladigan san'at shaklidir."
    },
    {
      "id": 371,
      "input": "Musiqada \"diksiya\" nima?",
      "output": "Diksiya musiqada so'zlarning aniq va to'g'ri talaffuzidir, ayniqsa vokal musiqalarida muhim ahamiyatga ega."
    },
    {
      "id": 372,
      "input": "Arxitektura san'ati va \"veranda\" qanday aloqaga ega?",
      "output": "Veranda arxitektura elementlaridan bo'lib, u ochiq yoki yopiq maydondan iborat bo'lib, odatda binoning old tomoniga qo'shilgan bo'ladi va ijtimoiy faoliyatlar uchun joy yaratadi."
    },
    {
      "id": 373,
      "input": "O'zbek musiqasida \"shashmaqom\" qanday ahamiyatga ega?",
      "output": "Shashmaqom O'zbek musiqasining eng qadimgi va eng nufuzli maqom tizimi bo'lib, u bir nechta o'zgacha uslublar va ohanglardan iborat."
    },
    {
      "id": 374,
      "input": "San'atda \"noyob\" asarlar qanday tasvirlanadi?",
      "output": "Noyob asarlar san'atda o'ziga xos uslub va ijodiy yondashuvni ifodalashga intiladi, ular avvalgi an'analardan farq qiladi va o'ziga xos estetikaga ega."
    },
    {
      "id": 375,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya musiqada bir nechta mustaqil ovozlarning bir vaqtda ijro etilishi va ular orasidagi musiqiy aloqalardan iboratdir."
    },
    {
      "id": 376,
      "input": "Arxitektura san'atida \"yangi materiallar\"ning roli qanday?",
      "output": "Yangi materiallar arxitektura san'atida inshootlarning sifatini oshirish, funktsional xususiyatlarini yaxshilash va ekologik jihatdan barqaror bo'lishiga yordam beradi."
    },
    {
      "id": 377,
      "input": "Teatrda \"klov\"ning o'rni qanday?",
      "output": "Klov komediya janrida o'zining kulgili va nozik harakatlari, qo'shiq va raqslari bilan sahnadagi asarlarning ruhiyatini yengillashtiradi va tomoshabinlarni ko'nglini olish uchun ishlatiladi."
    },
    {
      "id": 378,
      "input": "O'zbek madaniyatida \"mezon\"ning ahamiyati qanday?",
      "output": "Mezon O'zbek madaniyatida ma'lum bir hodisaning yoki asarning o'ziga xos shartlari, mezonlari bo'lib, ularni baholash va o'lchashda ishlatiladi."
    },
    {
      "id": 379,
      "input": "Musiqada \"modifikatsiya\" nima?",
      "output": "Modifikatsiya musiqada ma'lum bir tovush yoki fraza bo'yicha o'zgartirishlar kiritish, ularni yangilash yoki rivojlantirishni anglatadi."
    },
    {
      "id": 380,
      "input": "San'atda \"remiks\" qanday ishlatiladi?",
      "output": "Remiks san'atda mavjud asarning yangi versiyasini yaratish, unda qo'shimchalar kiritish, tizimni o'zgartirish yoki qayta ishlash orqali ijodiy yangilik kiritishdir."
    },
    {
      "id": 381,
      "input": "Arxitektura san'atida \"yangi tendentsiyalar\" qanday ifodalanadi?",
      "output": "Yangi tendentsiyalar arxitekturadagi texnologik, ekologik va estetik o'zgarishlarga asoslangan inshootlarni yaratishga qaratilgan."
    },
    {
      "id": 382,
      "input": "Teatrda \"demonik obrazlar\" qanday ishlatiladi?",
      "output": "Demonik obrazlar teatrda insonning ichki qorong'u tomonlarini, kibr yoki yovuzlikni tasvirlashda ishlatiladi va dramatik ta'sirni kuchaytiradi."
    },
    {
      "id": 383,
      "input": "O'zbek musiqasida \"belgilar\" qanday ishlatiladi?",
      "output": "O'zbek musiqasida belgilar asarlarning mazmunini, ruhiyatini va muayyan madaniy yoki tarixiy nuqtalarni ta'kidlashda ishlatiladi."
    },
    {
      "id": 384,
      "input": "San'atda \"parodiya\" qanday tasvirlanadi?",
      "output": "Parodiya san'atda boshqa asarlarga yoki janrlarga hazil bilan qaratilgan, ko'pincha ularning noaniqliklarini yoki ortiqcha jihatlarini tanqid qilishga asoslangan."
    },
    {
      "id": 385,
      "input": "Arxitektura san'ati va \"tashqi makon\" o'rtasidagi aloqalar qanday?",
      "output": "Tashqi makon arxitekturadagi tabiiy muhit va binolar orasidagi muvofiqlikni yaratadi, ko'pincha landshaft va atrof-muhitni hisobga olish muhimdir."
    },
    {
      "id": 386,
      "input": "Musiqada \"coda\" nima?",
      "output": "Coda musiqa asarining yakuniy qismi bo'lib, asar tugashidan oldin uni to'ldirish, umumiy tuzilmani mustahkamlash uchun ishlatiladi."
    },
    {
      "id": 387,
      "input": "Rassomlikda \"fenomenologiya\" nima?",
      "output": "Fenomenologiya rassomlikda ob'ektlarning inson tafakkuri orqali qanday qabul qilinishini va ular bilan qanday aloqalar o'rnatilishini o'rganishdir."
    },
    {
      "id": 388,
      "input": "O'zbek madaniyatida \"hikoyachilik\"ning o'rni qanday?",
      "output": "Hikoyachilik O'zbek madaniyatida an'anaviy va o'ziga xos uslubdagi hikoya qilish san'ati bo'lib, turli ijtimoiy, madaniy va tarixiy voqealarni tasvirlaydi."
    },
    {
      "id": 389,
      "input": "San'atda \"multimedia\" qanday ishlatiladi?",
      "output": "Multimedia san'atda turli vizual, audio va boshqa texnologiyalarni birlashtirib, yangi badiiy shakllar yaratishga imkon beradi."
    },
    {
      "id": 390,
      "input": "Arxitektura san'atida \"integratsiya\" tushunchasi nima?",
      "output": "Integratsiya arxitekturadagi turli elementlar va uslublarning uyg'unlashuvi, hamda ekologik va funksional jihatlarni birlashtirishni anglatadi."
    },
    {
      "id": 391,
      "input": "Musiqada \"timbre\" nima?",
      "output": "Timbre yoki \"ohang ranglari\" musiqada asbob yoki ovozning o'ziga xos sifatlarini, ya'ni unga xos bo'lgan tovush rangini ifodalaydi."
    },
    {
      "id": 392,
      "input": "San'atda \"impressionizm\" uslubi qanday ishlatiladi?",
      "output": "Impressionizm san'atida yorug'lik, ranglar va tasvirlangan obyektlarning vaqtinchalik taassurotlari asosiy e'tiborda bo'ladi."
    },
    {
      "id": 393,
      "input": "O'zbek musiqasida \"karnay\" va \"shofar\" qanday ahamiyatga ega?",
      "output": "Karnay va shofar O'zbek musiqasida an'anaviy brass asboblar bo'lib, ular ko'pincha marosimlar va bayramlarda ishlatiladi."
    },
    {
      "id": 394,
      "input": "Teatrda \"melodrama\"ning xususiyatlari qanday?",
      "output": "Melodrama teatrda his-tuyg'ularni orttirib, personajlarning o'zaro munosabatlarini kuchli va keskin dramatik tarzda ifodalashga asoslangan."
    },
    {
      "id": 395,
      "input": "Rassomlikda \"realizm\" qanday ifodalanadi?",
      "output": "Realizm tasviriy san'atda haqiqatni, kundalik hayotning oddiy sahnalarini va insonlarning tabiiy holatini haqqoniy tarzda tasvirlashga harakat qiladi."
    },
    {
      "id": 396,
      "input": "Musiqada \"tonalitet\" nima?",
      "output": "Tonalitet musiqa asarida asosiy ton yoki tonallikning mavjudligini va unga mos keluvchi akordlarni tashkil etuvchi tizimdir."
    },
    {
      "id": 397,
      "input": "Arxitektura san'ati va \"skandinaviyaning minimalizmi\" o'rtasidagi bog'liqlik qanday?",
      "output": "Skandinaviyaning minimalizmi arxitekturadagi soddalik, tabiiy materiallar va ochiq makonlardan foydalanishni ta'kidlaydi, bu o'z navbatida estetika va funksiyani uyg'unlashtiradi."
    },
    {
      "id": 398,
      "input": "San'atda \"dekonstruktivizm\" qanday tasvirlanadi?",
      "output": "Dekonstruktivizm san'atida an'anaviy shakllar va tuzilmalar buzilib, murakkab va noto'g'ri shakllar yaratilib, turli tarzda buzilgan tuzilmalar va strukturalar ishlatiladi."
    },
    {
      "id": 399,
      "input": "O'zbek musiqasida \"gaval\" nima?",
      "output": "Gaval O'zbek xalq musiqasida qo'shiqlarni ritmik ravishda takrorlash yoki raqsga solish uchun ishlatiladigan usuldir."
    },
    {
      "id": 400,
      "input": "Arxitektura san'ati va \"yashil inshootlar\" o'rtasidagi aloqalar qanday?",
      "output": "Yashil inshootlar arxitektura san'atida ekologik jihatlarni hisobga olgan holda energiya tejash, tabiiy resurslardan samarali foydalanish va atrof-muhitga mos dizayn yaratishni ta'kidlaydi."
    },
    {
      "id": 401,
      "input": "Musiqada \"dissonans\" nima?",
      "output": "Dissonans musiqada tovushlarning bir-biriga qarshi kelishini va bezovta tovushlarni ifodalaydi, bu orqali taranglik va dramatizm yaratiladi."
    },
    {
      "id": 402,
      "input": "Teatrda \"epik teatrdagi reji\" qanday ishlatiladi?",
      "output": "Epik teatrda reji tomoshabinlarni bevosita qahramonlar bilan bog'lashni emas, balki ularga tarixiy, ijtimoiy va madaniy jihatlardan muhokama qilish imkonini beradi."
    },
    {
      "id": 403,
      "input": "Rassomlikda \"fovizm\" qanday tasvirlanadi?",
      "output": "Fovizmda ranglar intensiv va xom bo'lib, tabiiy tasvirlar yoki shakllar sodda va abartilgan tarzda aks ettiriladi."
    },
    {
      "id": 404,
      "input": "Arxitektura san'atida \"neo-gotik\" uslubi qanday ishlatiladi?",
      "output": "Neo-gotik arxitekturasi gotik uslubining qayta tiklanishi bo'lib, yuqori nurlar, asimmetrik shakllar, zamonaviy materiallar bilan birlashtirilgan."
    },
    {
      "id": 405,
      "input": "Musiqada \"ritm\" qanday ishlatiladi?",
      "output": "Ritm musiqa asarida vaqtni tashkil etish va har bir so'z yoki frazaning uzunligini belgilash orqali, musiqa tuzilmasiga asosiy ko'rsatkich bo'lib xizmat qiladi."
    },
    {
      "id": 406,
      "input": "O'zbek madaniyatida \"nasr\" va \"she'r\" o'rtasidagi farq nima?",
      "output": "Nasr  bu hikoya qilish yoki ma'lumot berish shakli bo'lsa, she'r musiqali va ritmik tuzilishga ega bo'lib, ko'pincha ma'naviy yoki emosional ma'na bilan boyitilgan."
    },
    {
      "id": 407,
      "input": "San'atda \"sosializm realizmi\" qanday tasvirlanadi?",
      "output": "Sosializm realizmi san'ati kommunistik g'oyalarga asoslangan holda, ijtimoiy muammolar va odamlarning qahramonliklarini idealizatsiya qilishni ta'kidlaydi."
    },
    {
      "id": 408,
      "input": "Teatrda \"farsh\" nima?",
      "output": "Farsh teatrda ijro etiladigan sahnadagi tayanchoq, ya'ni dekoratsiya yoki sahna elementlari bo'lib, ular aktyorlarning harakatlarini ko'rsatishga yordam beradi."
    },
    {
      "id": 409,
      "input": "Musiqada \"dominanta\" nima?",
      "output": "Dominanta  bu tonal tizimdagi eng kuchli va yakuniy akord bo'lib, u tonalitetning markaziy nuqtasini tashkil etadi."
    },
    {
      "id": 410,
      "input": "Arxitektura san'ati va \"konstruktivizm\" o'rtasidagi aloqalar qanday?",
      "output": "Konstruktivizm arxitekturasida tuzilmalar va funksiyalarni yaxshilash, shakllar va materiallarni mukammallashtirish orqali ehtiyojlarni qondirishga yo'naltirilgan."
    },
    {
      "id": 411,
      "input": "Rassomlikda \"pop-art\" qanday ifodalanadi?",
      "output": "Pop-art san'ati ommaviy madaniyat va reklamalar, reklama ramzlari va o'ziga xos nashrlarni tasvirlash orqali keng auditoriyaga murojaat qiladi."
    },
    {
      "id": 412,
      "input": "Musiqada \"leitmotiv\" nima?",
      "output": "Leitmotiv  bu musiqa asarida muayyan mavzuni yoki obrazni qayta-qayta eslatadigan va u bilan bog'langan musiqiy motivdir."
    },
    {
      "id": 413,
      "input": "Teatrda \"prolog\" qanday ishlatiladi?",
      "output": "Prolog teatrda asar boshlanishidan oldin tomoshabinlarga qisqacha ma'lumot beradigan yoki asosiy mavzu va voqeani ochib beradigan qisqa sahnadir."
    },
    {
      "id": 414,
      "input": "O'zbek musiqasida \"sher\"ning o'rni qanday?",
      "output": "Sher O'zbek musiqasida asosan lirik va marhamatli qo'shiqlarda ishlatiladi, uning ohanglari ko'pincha xotira va mehr-oqibatni tasvirlaydi."
    },
    {
      "id": 415,
      "input": "Arxitektura san'atida \"klassikizm\" uslubi qanday ishlatiladi?",
      "output": "Klassikizm uslubi arxitekturadagi simmetriya, proporsiyalar va rangi orqali muhtashamlik va ajoyib dizaynni aks ettiradi."
    },
    {
      "id": 416,
      "input": "Musiqada \"ostinato\" nima?",
      "output": "Ostinato  bu musiqada takrorlanadigan qisqa melodiya yoki ritm bo'lib, asar davomida bir xil shaklda takrorlanadi."
    },
    {
      "id": 417,
      "input": "Rassomlikda \"romantik ekspressionizm\" qanday ifodalanadi?",
      "output": "Romantik ekspressionizmda hissiyotlar va ruhiy holatlar tasvirlanadi, ranglar va shakllar orqali chuqur hayajonli va ma'noli manzaralar yaratiladi."
    },
    {
      "id": 418,
      "input": "Teatrda \"satira\" qanday ishlatiladi?",
      "output": "Satira teatrda ijtimoiy va siyosiy holatlarni kamsituvchi va tanqid qiluvchi asarlar orqali jamiyatni o'zgartirishga chaqiradi."
    },
    {
      "id": 419,
      "input": "San'atda \"minimalizm\" qanday ishlatiladi?",
      "output": "Minimalizm san'atida ortiqcha bezaklardan voz kechilib, oddiy va soddalikka asoslangan, minimal vositalar bilan tasvirlash usuli qo'llaniladi."
    },
    {
      "id": 420,
      "input": "O'zbek musiqasida \"kuchli ohanglar\" qanday ishlatiladi?",
      "output": "Kuchli ohanglar O'zbek musiqasida ko'pincha dramani, boshqaruvni yoki ijtimoiy voqealarni aks ettiruvchi maqsadlarda ishlatiladi."
    },
    {
      "id": 421
    },
    {
      "id": 422,
      "input": "Arxitektura san'ati va \"g'arbiy modernizm\" o'rtasidagi bog'liqlik qanday?",
      "output": "G'arbiy modernizm arxitekturasi sanoat inqilobi va yangi texnologiyalarni hisobga olib, shakl va funktsiyani birlashtiradi va minimalizmga yo'naltirilgan."
    },
    {
      "id": 423,
      "input": "Musiqada \"akkord\" nima?",
      "output": "Akkord bir nechta tovushning bir vaqtda ijro etilishi bo'lib, ular birgalikda musiqaning asosiy harmoniyasini tashkil etadi."
    },
    {
      "id": 424,
      "input": "San'atda \"neoklassitsizm\" qanday ishlatiladi?",
      "output": "Neoklassitsizm san'atda antik davrlarning klassik san'ati va falsafasiga qaytishni, soddalikni va proporitsiyalarni ta'kidlaydi."
    },
    {
      "id": 425,
      "input": "O'zbek musiqasida \"yalla\" qanday ifodalanadi?",
      "output": "Yalla  bu O'zbek xalq musiqasida tezkor va ritmik qo'shiqlarni ifodalovchi janr bo'lib, asosan raqsga solish uchun ishlatiladi."
    },
    {
      "id": 426,
      "input": "Teatrda \"tragikomediya\"ning xususiyatlari qanday?",
      "output": "Tragikomediya asarida kulgi va qayg'u, dramani yengillashtirish uchun kulgili elementlar bilan birga, chuqur ma'noli dramatik voqealar mavjud."
    },
    {
      "id": 427,
      "input": "Rassomlikda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda ong osti, orzular va real hayotning noto'g'ri ko'rinishlari tasvirlanadi, ko'pincha fantastik yoki absurd holatlar tasvirlanadi."
    },
    {
      "id": 428,
      "input": "Musiqada \"melodiya\" nima?",
      "output": "Melodiya musiqa asarining eng asosiy va xarakterli qismini tashkil etadigan, musiqiy frazalar va tovushlarning o'zaro birlashgan ketma-ketligi."
    },
    {
      "id": 429,
      "input": "Arxitektura san'ati va \"neo-futurizm\" o'rtasidagi aloqalar qanday?",
      "output": "Neo-futurizm arxitekturasi yangicha texnologiyalar va ekologik o'zgartirishlarni qo'llash orqali zamonaviy, yuksak innovatsion inshootlar yaratadi."
    },
    {
      "id": 430,
      "input": "San'atda \"romantizm\" va \"neoklassitsizm\" o'rtasidagi farq nima?",
      "output": "Romantizmda hissiyotlar, tabiat va fantastika muhim bo'lsa, neoklassitsizmda antik davrning soddaligi, tasvirlar va ma'naviyat ta'kidlanadi."
    },
    {
      "id": 431,
      "input": "O'zbek musiqasida \"maqom\"ning o'rni qanday?",
      "output": "Maqom O'zbek musiqasining eng muhim va asosiy janrlaridan bo'lib, asarlarning mazmunini va melodiyalarini turli xil mavzularda ifodalashni ta'minlaydi."
    },
    {
      "id": 432,
      "input": "Arxitektura san'ati va \"yurakdan chiqish\" o'rtasidagi bog'liqlik qanday?",
      "output": "Arxitekturadagi dizayn va inshootlar kishilarning ichki his-tuyg'ularini ifodalash va hayotiy ehtiyojlarga mos keladigan tarzda amalga oshiriladi."
    },
    {
      "id": 433,
      "input": "Musiqada \"modal tizim\" nima?",
      "output": "Modal tizim musiqa asarida ton yoki tonalitetning o'zgartirilgan versiyasi bo'lib, melodiyalar va harmoniyalar o'ziga xos tartibda tashkil etiladi."
    },
    {
      "id": 434,
      "input": "Teatrda \"simvolizm\" qanday ishlatiladi?",
      "output": "Simvolizm teatrda abstrakt va ma'nosiz ko'rinishlarni o'rganadi, obrazlar va shaxsiyatlar orqali ichki ruhiy holatlarni ifodalashni ta'kidlaydi."
    },
    {
      "id": 435,
      "input": "Rassomlikda \"impressionizm\" va \"ekspressionizm\" o'rtasidagi farq nima?",
      "output": "Impressionizmda yorug'lik va ranglar haqiqiy taassurotlarni aks ettirsa, ekspressionizmda ichki hissiyotlar va ruhiy holatlar asosiy e'tiborda bo'ladi."
    },
    {
      "id": 436,
      "input": "Arxitektura san'ati va \"barokko\" uslubi qanday ishlatiladi?",
      "output": "Barokko uslubi arxitekturadagi hayajon, ifodali shakllar va bezaklarga asoslanadi, dramatik tuzilmalar va bo'yinli detallarni o'z ichiga oladi."
    },
    {
      "id": 437,
      "input": "Musiqada \"cantata\" nima?",
      "output": "Cantata vokal-instrumantal asar bo'lib, ko'pincha ko'plab xor, solistlar va orkestrlar tomonidan ijro etiladi va ma'lum bir mavzuni ifodalaydi."
    },
    {
      "id": 438,
      "input": "O'zbek madaniyatida \"uzluksizlik\" tushunchasi nima?",
      "output": "Uzluksizlik O'zbek madaniyatida an'anaviy qadriyatlarning davomiyligi, avloddan-avlodga o'tib, o'ziga xos va barqaror bo'lishni ta'kidlaydi."
    },
    {
      "id": 439,
      "input": "San'atda \"avantgarde\" uslubi qanday ishlatiladi?",
      "output": "Avantgarde san'ati yangi va eksperimentallikni ifodalashga intilib, an'anaviy san'atdan farq qiladigan yangi usullarni va estetikalarni yaratadi."
    },
    {
      "id": 440,
      "input": "Musiqada \"poliritmiya\" nima?",
      "output": "Poliritmiya bir necha turli ritmik tuzilmalar yoki avtonom ritmlarning birgalikda ijro etilishidir, bu musiqa asariga murakkablik va ritmik boylik qo'shadi."
    },
    {
      "id": 441,
      "input": "Arxitektura san'ati va \"art-deko\" uslubi qanday ishlatiladi?",
      "output": "Art-deko uslubi arxitekturadagi geometriya, simmetriya va ornamentlar bilan o'ziga xos va zamonaviy inshootlar yaratishga imkon beradi."
    },
    {
      "id": 442,
      "input": "Teatrda \"absurd drama\" qanday ishlatiladi?",
      "output": "Absurd drama inson mavjudligini va uning jahon bilan munosabatini o'zgartirishni maqsad qilgan, mantiqsiz va bema'ni voqealar orqali hayotning ma'nosizligini ko'rsatadi."
    },
    {
      "id": 443,
      "input": "Rassomlikda \"pointillizm\" qanday ishlatiladi?",
      "output": "Pointillizm  bu tasvirni kichik nuqtalardan tashkil etish usuli bo'lib, har bir nuqta rang va yorug'likning alohida qismidir."
    },
    {
      "id": 444,
      "input": "Musiqada \"melancholiya\" nima?",
      "output": "Melancholiya musiqa asarida qayg'u, nostalgiya va his-tuyg'ularni ifodalovchi tovushlar va melodiyalarni yaratishga asoslanadi."
    },
    {
      "id": 445,
      "input": "O'zbek madaniyatida \"maqta' shoirligi\"ning o'rni qanday?",
      "output": "Maqta' shoirligi O'zbek adabiyotida ma'lum bir mavzu yoki shaxsni yakunlash va yakuniy fikrni ifodalashga yo'naltirilgan uslubdir."
    },
    {
      "id": 446,
      "input": "Arxitektura san'ati va \"landshaft arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Landshaft arxitekturasi tabiiy muhitni inshootlar va dizaynlar bilan uyg'unlashtirib, estetik va ekologik jihatlarni hisobga olgan holda ishlaydi."
    },
    {
      "id": 447,
      "input": "Musiqada \"tango\" qanday ifodalanadi?",
      "output": "Tango musiqa janri va raqs turi bo'lib, janrning ko'p qismi asosan lirik va ritmik uslublardan tashkil topgan dramatik va ehtirosli bo'ladi."
    },
    {
      "id": 448,
      "input": "Teatrda \"remake\" nima?",
      "output": "Remake teatrda eski asarlarni yangilab qayta ishlash, uni zamonaviy kontekstga moslashtirishdir."
    },
    {
      "id": 449,
      "input": "Rassomlikda \"fotorealizm\" qanday ishlatiladi?",
      "output": "Fotorealizm  bu rassomning asl foto tasvirga o'xshash darajada aniq va detallarni ko'rsatish uchun ishlatiladigan san'at uslubidir."
    },
    {
      "id": 450,
      "input": "Musiqada \"musical\" qanday ishlatiladi?",
      "output": "Musical teatr janri bo'lib, musiqiy asarlar, raqslar va drama elementlarini birlashtirib, sahnada hikoya qilishni ta'minlaydi."
    },
    {
      "id": 451,
      "input": "Arxitektura san'ati va \"brutalizm\" uslubi qanday ishlatiladi?",
      "output": "Brutalizm arxitekturasi og'ir, nozik bo'lmagan va ba'zan murakkab texnik strukturalarni ta'kidlaydi, beton va yassi shakllardan foydalanadi."
    },
    {
      "id": 452,
      "input": "Arxitektura san'ati va \"dekorativ san'at\" o'rtasidagi aloqalar qanday?",
      "output": "Dekorativ san'at arxitekturaning ichki va tashqi bezaklarini yaratishda estetik jihatlarni o'rganadi, unda shakllar va materiallarning boyligi muhim."
    },
    {
      "id": 453,
      "input": "Musiqada \"dodekafoniya\" nima?",
      "output": "Dodekafoniya  bu 12 tovushdan tashkil topgan tonal tizim, unda har bir tovush teng ahamiyatga ega va musiqaning tonal tizimi bo'yicha cheklovlar mavjud."
    },
    {
      "id": 454,
      "input": "O'zbek san'ati va \"yagona shakl\" tushunchasi qanday ishlatiladi?",
      "output": "Yagona shakl O'zbek san'atida asosan bir shakl yoki mavzuni ifodalash orqali san'atning turli shakllarini birlashtirishga qaratilgan."
    },
    {
      "id": 455,
      "input": "Teatrda \"metateatr\" tushunchasi nima?",
      "output": "Metateatr teatrda o'z-o'zini tanqid qilish, teatr asarini va ijro jarayonini sahnada bevosita ko'rsatish orqali yangi estetikalar yaratishni anglatadi."
    },
    {
      "id": 456,
      "input": "Rassomlikda \"ekspressionizm\" uslubi qanday ishlatiladi?",
      "output": "Ekspressionizmda rassomlar ichki hissiyotlar va ruhiy holatlarni ifodalashni maqsad qilib, ranglar va shakllarni abartma uslubida qo'llaydilar."
    },
    {
      "id": 457,
      "input": "Musiqada \"konsonans\" nima?",
      "output": "Konsonans  bu tovushlarning bir-biri bilan uyg'unligi bo'lib, ular musiqada tinchlik va balansni ta'minlaydi, xususan, qo'shni akordlar orasidagi uyg'unlik."
    },
    {
      "id": 458,
      "input": "Arxitektura san'ati va \"konstruktsionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Konstruktsionizm arxitekturasida forma va funktsiya birlashib, inshootlarining asosiy tarkibiy qismlari, strukturasi va texnologiyasi asosiy rol o'ynaydi."
    },
    {
      "id": 459,
      "input": "San'atda \"postmodernizm\" uslubi qanday ishlatiladi?",
      "output": "Postmodernizm san'atida an'anaviy uslublar, texnikalar va ma'nolarni qayta ishlash orqali murakkablik va farqlilikni ifodalashga intiladi."
    },
    {
      "id": 460,
      "input": "O'zbek musiqasida \"besh sharaf\" nima?",
      "output": "Besh sharaf  bu O'zbek musiqasidagi an'anaviy va mashhur qo'shiqlardan iborat, ular xalqning orzu-istaklarini, qadriyatlarini aks ettiradi."
    },
    {
      "id": 461,
      "input": "Musiqada \"monofoniya\" nima?",
      "output": "Monofoniya  bu faqat bitta melodiya yoki tovush qatlamidan iborat bo'lib, unda hech qanday harmonik yoki polyfonik qo'shimcha tovushlar mavjud emas."
    },
    {
      "id": 462,
      "input": "Arxitektura san'ati va \"rekonstruktsiya\" o'rtasidagi aloqalar qanday?",
      "output": "Rekonstruktsiya arxitektura san'atida eski inshootlarning yaxshilanishi yoki yangilanishi jarayonini anglatadi, bunda tarixiy elementlar saqlanib qoladi."
    },
    {
      "id": 463,
      "input": "Rassomlikda \"naturizm\" qanday ishlatiladi?",
      "output": "Naturizm san'ati tabiatning haqiqatini, insonlar va hayvonlarni aniq va realist tarzda tasvirlashga qaratilgan."
    },
    {
      "id": 464,
      "input": "Teatrda \"absurd teatr\"ning asosiy tamoyillari qanday?",
      "output": "Absurd teatrida insonning hayotdagi ma'nosizligi, mantiqsizligi va kommunikatsiya qiyinchiliklari aks ettiriladi, va bu turdagi dramalar ko'pincha o'z-o'zini inkor qiladi."
    },
    {
      "id": 465,
      "input": "Musiqada \"fuga\" nima?",
      "output": "Fuga  bu musiqa kompozitsiyasida asosiy mavzu bir nechta ovozlar tomonidan qayta-qayta takrorlanadigan va o'zaro bog'langan shakldir."
    },
    {
      "id": 466,
      "input": "Arxitektura san'ati va \"minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalizm arxitekturasida soddalik va funksiya ustuvor bo'lib, oshirilgan ornamentlardan voz kechish va keraksiz bezaklardan saqlanish asosiy prinsipdir."
    },
    {
      "id": 467,
      "input": "O'zbek madaniyatida \"ma'rifat\" tushunchasi qanday ishlatiladi?",
      "output": "Ma'rifat O'zbek madaniyatida bilim va ma'naviyatni rivojlantirish, insonlarni intellektual va axloqiy jihatdan boyitish jarayonini anglatadi."
    },
    {
      "id": 468,
      "input": "Musiqada \"rik\" qanday ishlatiladi?",
      "output": "Rik  bu ayrim musiqiy janrlarda, ayniqsa arabcha va turkcha musiqada tezlik, dinamik va shiddatni ifodalash uchun ishlatiladigan usuldir."
    },
    {
      "id": 469,
      "input": "San'atda \"abstraktsionizm\" uslubi qanday ishlatiladi?",
      "output": "Abstraktsionizmda rassomlar an'anaviy tasvirlardan voz kechib, faqat shakllar, ranglar va kompozitsiya orqali his-tuyg'ular va fikrlarni ifodalaydilar."
    },
    {
      "id": 470,
      "input": "Arxitektura san'ati va \"postmodernizm\" uslubi qanday ishlatiladi?",
      "output": "Postmodernizmda arxitektura shakllari va uslublar aralashadi, va ko'pincha tarixiy elementlar bilan eksperimentlar o'zaro bog'lanadi."
    },
    {
      "id": 471,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya musiqa asarida bir nechta mustaqil melodiyalar birgalikda ijro etilishi bo'lib, har bir melodiya o'z mustaqilligi bilan birgalikda o'zaro uyg'unlashadi."
    },
    {
      "id": 472,
      "input": "Teatrda \"berliner ensemble\" qanday uslubi bilan tanilgan?",
      "output": "Berliner Ensemble Brehtning epik teatrini rivojlantirgan, dramatik asarlarni tomoshabinlarga qat'iy va tanqidiy ko'rinishda taqdim etgan."
    },
    {
      "id": 473,
      "input": "Rassomlikda \"hiperrealizm\" qanday ishlatiladi?",
      "output": "Hiperrealizmda rassomlar hayotiy tafsilotlarni juda aniq va realist tarzda tasvirlaydi, hatto kichik detallarga e'tibor qaratiladi."
    },
    {
      "id": 474,
      "input": "Musiqada \"harmony\" nima?",
      "output": "Harmony musiqa asaridagi bir nechta tovushlar yoki akkordlar birgalikda ijro etilishi bo'lib, ular musiqaning uyg'unligini ta'minlaydi."
    },
    {
      "id": 475,
      "input": "O'zbek san'ati va \"qoraqalpoq musiqa madaniyati\" o'rtasidagi aloqalar qanday?",
      "output": "Qoraqalpoq musiqa madaniyati O'zbek san'ati bilan o'zaro ta'sirda bo'lib, ayniqsa xalq musiqasi, ashula va raqs uslublarida o'xshashliklar mavjud."
    },
    {
      "id": 476,
      "input": "Arxitektura san'ati va \"sotsialist realizmi\" uslubi qanday ishlatiladi?",
      "output": "Sotsialist realizmi arxitekturasida xalq va jamiyat manfaatlari uchun qulay, oddiy va funksional inshootlar yaratishga qaratilgan yondashuv mavjud."
    },
    {
      "id": 477,
      "input": "Teatrda \"karnaval\" qanday ishlatiladi?",
      "output": "Karnaval teatrda o'ziga xos bayramona muhit yaratish uchun maxsus tarzda ijro etiladigan, ko'pincha kulgili va bo'rttirilgan elementlarga asoslangan sahnalar."
    },
    {
      "id": 478,
      "input": "Musiqada \"tremolo\" nima?",
      "output": "Tremolo  bu musiqa asarida tez-tez takrorlanadigan va noto'g'ri chastotali tovushlarning o'zgarishi, ko'pincha mexanik yoki vokal texnikada ishlatiladi."
    },
    {
      "id": 479,
      "input": "San'atda \"populizm\" uslubi qanday ishlatiladi?",
      "output": "Populizm san'atida oddiy xalq va jamiyatning keng qatlamlarini qamrab olish, ular uchun tushunarli va yengil san'at yaratishga e'tibor qaratiladi."
    },
    {
      "id": 480,
      "input": "Rassomlikda \"naturalizm\" qanday ishlatiladi?",
      "output": "Naturalizm san'ati insonni, tabiatni va hayotiy holatlarni haqiqatga yaqin va tabiiy tarzda tasvirlashga asoslangan."
    },
    {
      "id": 481,
      "input": "Arxitektura san'ati va \"barokko\" uslubi qanday ishlatiladi?",
      "output": "Barokko uslubi arxitekturada dramatik ifodalar, ornatmali bezaklar va asimmetrik shakllardan foydalanish orqali ko'zni o'ziga tortadigan inshootlar yaratadi."
    },
    {
      "id": 482,
      "input": "Musiqada \"ritm\" nima?",
      "output": "Ritm musiqa asarining vaqtinchalik tuzilishi bo'lib, urish va intervalning birikmasidan tashkil topadi va har bir melodiyaga tuzilma beradi."
    },
    {
      "id": 483,
      "input": "O'zbek san'ati va \"musavvirlik\" o'rtasidagi aloqalar qanday?",
      "output": "Musavvirlik O'zbek san'ati tarkibida ko'plab tasviriy san'at asarlarining yaratilishida asosiy rol o'ynaydi, bu esa madaniyatning boyligini ko'rsatadi."
    },
    {
      "id": 484,
      "input": "Teatrda \"epik teatr\" nima?",
      "output": "Epik teatr Brecht tomonidan ishlab chiqilgan, unda tomoshabinlarga voqealar haqida tanqidiy fikr bildirish imkoniyati beriladi, dramatik effekt o'rniga aql-idrokga urg'u beriladi."
    },
    {
      "id": 485,
      "input": "Rassomlikda \"romantizm\" uslubi qanday ishlatiladi?",
      "output": "Romantizm san'ati ko'pincha tabiiy go'zallik, insonning ichki dunyosi va xayolotini tasvirlashga qaratilgan, ko'pincha hissiy va ekzotik tasvirlar qo'llaniladi."
    },
    {
      "id": 486,
      "input": "Musiqada \"basso continuo\" nima?",
      "output": "Basso continuo barokko musiqa uslubida ishlatiladigan usul bo'lib, basso (pastki) chizig'iga asoslangan va asar davomida takrorlanadigan armonik tuzilmani tashkil etadi."
    },
    {
      "id": 487,
      "input": "Arxitektura san'ati va \"romantizm\" o'rtasidagi aloqalar qanday?",
      "output": "Romantizmda arxitektura tabiiy muhit va tarixiy uslublarga ishora qiladigan monumental va dramatik shakllarga e'tibor qaratadi."
    },
    {
      "id": 488,
      "input": "San'atda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda rassomlar ong osti, orzular va haqiqatni buzish orqali san'at asarlarini yaratadilar, ko'pincha fantastik va tushunarsiz obrazlar orqali."
    },
    {
      "id": 489,
      "input": "O'zbek musiqasida \"karnay\" nima?",
      "output": "Karnay  bu O'zbek xalq musiqa asboblaridan biri bo'lib, katta bo'ylari va qudratli ovozi bilan qo'shiqlarni kuylashda ishlatiladi."
    },
    {
      "id": 490,
      "input": "Teatrda \"dramaturgiya\" qanday ishlatiladi?",
      "output": "Dramaturgiya teatrda asar tuzilishi, voqea rivojlanishining tartibi va personajlarning interaktsiyasi orqali dramatik effekt yaratish san'ati."
    },
    {
      "id": 491,
      "input": "Rassomlikda \"futurizm\" qanday ishlatiladi?",
      "output": "Futurizm san'atida harakat va vaqtning tezligini tasvirlashga urinishlar mavjud, eski shakllardan voz kechib, yangi va dinamik shakllar yaratishga intiladi."
    },
    {
      "id": 492,
      "input": "Musiqada \"sonata\" nima?",
      "output": "Sonata musiqa kompozitsiyasi turidir, odatda bir necha qismlardan iborat bo'lib, uning asosiy mavzusi va rivojlanishi alohida ajratiladi."
    },
    {
      "id": 493,
      "input": "Arxitektura san'ati va \"g'arbiy modernizm\" o'rtasidagi aloqalar qanday?",
      "output": "G'arbiy modernizm arxitekturasi minimalizm va yangi texnologiyalarni qo'llagan holda an'anaviy shakllarni inkor etadi, soddalikka asoslanadi."
    },
    {
      "id": 494,
      "input": "O'zbek madaniyatida \"bekor qilish\" tushunchasi qanday ishlatiladi?",
      "output": "\"Bekor qilish\" O'zbek madaniyatida odatda ma'naviy yoki amaliy jihatlarda eski, eskirgan yoki keraksiz narsalarni rad etish, yangilikka intilishdir."
    },
    {
      "id": 495,
      "input": "San'atda \"impressionizm\" uslubi qanday ishlatiladi?",
      "output": "Impressionizmda san'atkorlar yorug'lik va rangni haqiqiy taassurotlar orqali tasvirlashga harakat qiladilar, aniq detallardan ko'ra umumiy tasvirga e'tibor qaratiladi."
    },
    {
      "id": 496,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya bir nechta mustaqil melodiyaning bir vaqtda ijro etilishidir, bu musiqa asariga boylik va murakkablik qo'shadi."
    },
    {
      "id": 497,
      "input": "Teatrda \"komediya\" qanday ishlatiladi?",
      "output": "Komediya teatrda kulgili vaziyatlar, qahramonlarning qo'zg'ashgan yoki absurd xatti-harakatlari orqali tomoshabinga yoqimli kayfiyat yaratadi."
    },
    {
      "id": 498,
      "input": "Rassomlikda \"realizm\" uslubi qanday ishlatiladi?",
      "output": "Realizm san'ati odamlarni va tabiatni aniq va tabiiy tarzda tasvirlashga intiladi, idealizatsiya va romantizmdan qochadi."
    },
    {
      "id": 499,
      "input": "Musiqada \"fugato\" nima?",
      "output": "Fugato  bu fuga shaklida, lekin qisqaroq va oddiyroq bo'lib, mavzu takrorlanishi orqali asar rivojlanadi."
    },
    {
      "id": 500,
      "input": "Arxitektura san'ati va \"gotika\" o'rtasidagi aloqalar qanday?",
      "output": "Gotika arxitekturasi baland minoralar, o'zgacha bog'langan taqsimot va nurni olib kirish uchun yuqori va ingichka strukturalarni ishlatgan."
    },
    {
      "id": 501,
      "input": "San'atda \"postmodernizm\" uslubi qanday ishlatiladi?",
      "output": "Postmodernizmda san'atchilar an'anaviy va zamonaviy shakllarni birlashtirib, o'ziga xos va ko'p qirrali tafakkur yaratishga intiladi."
    },
    {
      "id": 502,
      "input": "O'zbek musiqasida \"tanbur\" qanday ishlatiladi?",
      "output": "Tanbur  O'zbek musiqasida simli musiqa asbobi bo'lib, uning tonlari ko'pincha xushovoz va sirli melodiyalar yaratishga yordam beradi."
    },
    {
      "id": 503,
      "input": "Teatrda \"tragediya\" qanday ishlatiladi?",
      "output": "Tragediya teatrda inson ruhining katta sinovlarini, taqdirning murakkabligini va hayotning qat'iy muammolarini tasvirlashga asoslanadi."
    },
    {
      "id": 504,
      "input": "Rassomlikda \"lazurizm\" qanday ishlatiladi?",
      "output": "Lazurizmda rassomlar eng yorqin va to'g'ri ranglarni ishlatib, tabiatni va uning go'zalligini maksimal darajada ifodalaydi."
    },
    {
      "id": 505,
      "input": "Musiqada \"sinfoniya\" nima?",
      "output": "Sinfoniya orkestrlarga moslangan katta hajmli musiqa asaridir, odatda bir nechta qismlardan iborat bo'lib, uning barcha tovush turlari bilan ishlanadi."
    },
    {
      "id": 506,
      "input": "Arxitektura san'ati va \"transitional\" uslubi qanday ishlatiladi?",
      "output": "Transitional arxitekturasi  bu tarixiy uslublardan zamonaviy shakllarga o'tishni o'zida mujassamlashtirgan, shakllar va bezaklar o'rtasidagi bog'liqlikni ta'minlaydi."
    },
    {
      "id": 507,
      "input": "Musiqada \"cantata\" qanday ishlatiladi?",
      "output": "Cantata musiqiy asar bo'lib, ko'plab vokal va instrumental qismlardan tashkil topadi, asosan diniy yoki dunyoviy mavzularda bo'ladi."
    },
    {
      "id": 508,
      "input": "O'zbek san'ati va \"g'azal\"ning aloqasi qanday?",
      "output": "G'azal O'zbek san'atida lirik asar bo'lib, ko'pincha muhabbat va tafakkur temalarini o'z ichiga oladi, xususan adabiyotda keng tarqalgan."
    },
    {
      "id": 509,
      "input": "Teatrda \"absurd\" janri qanday ishlatiladi?",
      "output": "Absurd janri teatrda ma'no va mantiqning yo'qligini, inson tajribalarining naqadar befoyda ekanligini ko'rsatadi."
    },
    {
      "id": 510,
      "input": "Rassomlikda \"naivizm\" qanday ishlatiladi?",
      "output": "Naivizmda rassomlar soddalikka intiladilar, asarlar ko'pincha oddiy, bolalarcha yoki kichik tafsilotlardan tashkil topgan bo'ladi."
    },
    {
      "id": 511,
      "input": "Musiqada \"ritmika\" nima?",
      "output": "Ritmika musiqa asaridagi tovushlarning o'zaro joylashuvi va vaqt oralig'idan iborat bo'lib, u musiqaning tuzilmasini shakllantiradi."
    },
    {
      "id": 512,
      "input": "San'atda \"ornament\" nima?",
      "output": "Ornament san'atda bezak elementlari bo'lib, ularning vazifasi shakllar, ranglar va tasvirlarni bezash, estetik jihatdan rivojlantirishdir"
    },
    {
      "id": 513,
      "input": "Arxitektura san'ati va \"neoklassitsizm\" o'rtasidagi aloqalar qanday?",
      "output": "Neoklassitsizm arxitekturasida qadimiy yunon va rim uslublari qayta ishlanadi, soddalik va simmetriya asosiy tamoyil hisoblanadi."
    },
    {
      "id": 514,
      "input": "Musiqada \"melodiya\" nima?",
      "output": "Melodiya  bu musiqadagi tovushlar ketma-ketligi bo'lib, u o'ziga xos ritm va intonatsiya orqali eshituvchini jalb qiladi."
    },
    {
      "id": 515,
      "input": "O'zbek san'ati va \"xattotlik\" o'rtasidagi aloqalar qanday?",
      "output": "Xattotlik O'zbek san'atining asosiy elementlaridan biri bo'lib, unda so'z va yozuvning estetik jihatlari ishlab chiqiladi."
    },
    {
      "id": 516,
      "input": "Teatrda \"stilizatsiya\" nima?",
      "output": "Stilizatsiya teatrda sahna tasvirlarining ma'lum bir uslub yoki davrga moslashtirilishidir, bu esa tomoshabinga ma'lum bir atmosferani yaratadi."
    },
    {
      "id": 517,
      "input": "Rassomlikda \"impressionizm\" qanday ishlatiladi?",
      "output": "Impressionizmda rassomlar yorug'lik va ranglarning tezkor va noaniq taassurotlarini tasvirlashga harakat qiladilar, bu vaqt va muhitni ko'rsatadi."
    },
    {
      "id": 518,
      "input": "Musiqada \"aksent\" nima?",
      "output": "Aksent musiqada biror tovushning yoki ritmik birlikning boshqa tovushlarga nisbatan ko'proq urg'u berilishi, shuningdek, ritmik tuzilmaning muhim qismi hisoblanadi."
    },
    {
      "id": 519,
      "input": "Arxitektura san'ati va \"futurizm\" uslubi qanday ishlatiladi?",
      "output": "Futurizm arxitekturasida tezlik, harakat va zamonaviy texnologiyalarni tasvirlashga intiladi, shakllar va strukturalar avangard uslubda yaratiladi."
    },
    {
      "id": 520,
      "input": "San'atda \"ikonografiya\" nima?",
      "output": "Ikonografiya san'atda tasvirlar va belgilar orqali ma'lum bir mavzu yoki diniy mazmunni ifodalashni anglatadi."
    },
    {
      "id": 521,
      "input": "O'zbek musiqasida \"doira\" qanday ishlatiladi?",
      "output": "Doira  O'zbek xalq musiqasida urishli asbob bo'lib, asosan tez ritmni yaratish va musiqaning energiyasini oshirishda ishlatiladi."
    },
    {
      "id": 522,
      "input": "Teatrda \"monolog\" nima?",
      "output": "Monolog  bu biror personajning o'z fikrlarini yoki his-tuyg'ularini o'zi bilan bo'lishishi, boshqa personajlar bilan aloqasiz ijro etiladigan sahna nutqi."
    },
    {
      "id": 523,
      "input": "Rassomlikda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizmda rassomlar hissiyotlarini va ichki dunyosini chiqarish uchun ranglar va shakllarni abartma uslubida qo'llaydilar."
    },
    {
      "id": 524,
      "input": "Musiqada \"poliritmiya\" nima?",
      "output": "Poliritmiya musiqa asarida bir nechta ritmik tuzilmalar bir vaqtning o'zida ishlatilishidir, bu asarni murakkab va qiziqarli qiladi."
    },
    {
      "id": 525,
      "input": "Arxitektura san'ati va \"dekonstruktivizm\" o'rtasidagi aloqalar qanday?",
      "output": "Dekonstruktivizmda arxitektura shakllari va strukturalari beqaror va asimmetrik bo'lib, bunday inshootlar harakatdagi va noaniq ko'rinishlarni yaratadi."
    },
    {
      "id": 526,
      "input": "San'atda \"minimalizm\" qanday ishlatiladi?",
      "output": "Minimalizmda soddalik, bo'shliq va forma ustuvor bo'lib, ortiqcha bezaklardan qochiladi va asarlarni minimal resurslar bilan yaratish maqsad qilinadi."
    },
    {
      "id": 527,
      "input": "O'zbek madaniyatida \"maqom\" qanday ishlatiladi?",
      "output": "Maqom O'zbek musiqa san'atining an'anaviy shaklidir, unda murakkab melodiyalar va ritmik tuzilmalar qo'llaniladi."
    },
    {
      "id": 528,
      "input": "Teatrda \"pantomima\" nima?",
      "output": "Pantomima  bu so'zsiz ifodalanadigan teatr turi bo'lib, harakatlar va yuz ifodalari orqali hikoya qilinadi."
    },
    {
      "id": 529,
      "input": "Rassomlikda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda rassomlar tushlar, ong osti va g'ayrioddiy obrazlar orqali haqiqatdan tashqaridagi tasvirlarni yaratadilar."
    },
    {
      "id": 530,
      "input": "Musiqada \"improvisatsiya\" nima?",
      "output": "Improvisatsiya musiqada ilgari tayyorlanmagan, spontan tarzda ijro etilgan yaratish jarayonidir."
    },
    {
      "id": 531,
      "input": "Arxitektura san'ati va \"futurizm\" o'rtasidagi aloqalar qanday?",
      "output": "Futurizm arxitekturasi kelajak va texnologiya, harakat va yangiliklarni aks ettirgan shakllarga asoslanadi."
    },
    {
      "id": 532,
      "input": "O'zbek san'ati va \"me'morchilik\" o'rtasidagi aloqalar qanday?",
      "output": "Me'morchilik O'zbek san'atida inshootlar yaratishda an'anaviy uslublar va zamonaviy texnikalarni uyg'unlashtirishga intiladi."
    },
    {
      "id": 533,
      "input": "San'atda \"romantizm\" uslubi qanday ishlatiladi?",
      "output": "Romantizmda san'atkorlar tabiat, inson ruhi va orzularni tasvirlashda erkinlik va hissiyotni namoyish etadilar."
    },
    {
      "id": 534,
      "input": "Teatrda \"absurd\" uslubi qanday ishlatiladi?",
      "output": "Absurd teatrida voqealar va mantiqiy aloqalar aks ettirilmaydi, inson hayotining ma'nosizligi va befarqligi ko'rsatiladi."
    },
    {
      "id": 535,
      "input": "Rassomlikda \"naivizm\" qanday ishlatiladi?",
      "output": "Naivizmda rassomlar soddalikni qadrlab, asarlarida o'ziga xos bolalarcha yoki oddiy uslublardan foydalanadilar."
    },
    {
      "id": 536,
      "input": "Musiqada \"sonata-allegro\" shakli nima?",
      "output": "Sonata-allegro shakli musiqa kompozitsiyasida tezkor va rivojlangan bo'lib, odatda ikkita kontrastli mavzu o'rtasida rivojlanadi."
    },
    {
      "id": 537,
      "input": "Arxitektura san'ati va \"art-deko\" uslubi qanday ishlatiladi?",
      "output": "Art-deko uslubi arxitekturada nozik bezaklar, geometriya va zamonaviy materiallar bilan xos bo'lib, vizual hashamatni taqdim etadi."
    },
    {
      "id": 538,
      "input": "O'zbek madaniyatida \"g'azal\" qanday ishlatiladi?",
      "output": "G'azal  bu O'zbek adabiyotining mashhur lirik shakli bo'lib, ko'pincha muhabbat, hayot va o'lim haqida fikrlarni ifodalaydi."
    },
    {
      "id": 539,
      "input": "San'atda \"konstruktivizm\" uslubi qanday ishlatiladi?",
      "output": "Konstruktivizmda shakllar va strukturaviy elementlar orqali inshoatlar yaratilib, har bir detalning amaliy funktsiyasi ta'kidlanadi."
    },
    {
      "id": 540,
      "input": "Musiqada \"harmony\" nima?",
      "output": "Harmony musiqada tovushlar o'rtasidagi uyg'unlik va akordlarning tuzilishidir, bu musiqa asarining emosional va estetik tuzilishini yaratadi."
    },
    {
      "id": 541,
      "input": "Teatrda \"realizm\" qanday ishlatiladi?",
      "output": "Realizm teatrida voqealar va personajlar hayotiy tarzda ko'rsatiladi, tomoshabinlarni jamiyat va insoniyatning haqiqiy muammolariga qaratish maqsad qilinadi."
    },
    {
      "id": 542,
      "input": "Rassomlikda \"barokko\" uslubi qanday ishlatiladi?",
      "output": "Barokko uslubida shakllar va bezaklar ko'paytiriladi, dramatik yorug'lik va kulish usullari bilan asarlarning estetik kuchi oshiriladi."
    },
    {
      "id": 543,
      "input": "Arxitektura san'ati va \"klassitsizm\" o'rtasidagi aloqalar qanday?",
      "output": "Klassitsizm arxitekturasi qadimiy yunon va rim uslublarini takrorlashni maqsad qiladi, an'anaviy simmetriya va soddalikni afzal ko'radi."
    },
    {
      "id": 544,
      "input": "Musiqada \"ritm va metrikalar\" nima?",
      "output": "Ritm va metrikalar musiqadagi takrorlanuvchi zarbalar va vaqt o'lchovlarini ifodalash, har bir musiqiy kompozitsiyada tartibni ta'minlaydi."
    },
    {
      "id": 545,
      "input": "O'zbek san'ati va \"keramika\" o'rtasidagi aloqalar qanday?",
      "output": "O'zbek san'ati keramika orqali o'z madaniyatini ifodalaydi, tasviriy va amaliy san'at elementlari bilan boyitilgan buyumlar yaratiladi."
    },
    {
      "id": 546,
      "input": "Teatrda \"absurd drama\" qanday ishlatiladi?",
      "output": "Absurd drama inson hayotining mantiqsizligini va ma'nosizligini ta'kidlaydi, voqealar mantiqsiz va tizimsiz bo'ladi."
    },
    {
      "id": 547,
      "input": "Rassomlikda \"art-nuvo\" uslubi qanday ishlatiladi?",
      "output": "Art-nuvo uslubi bezak va geometrik shakllarni organik va oqimli tarzda ishlatadi, tabiat va o'simliklardan ilhomlanadi."
    },
    {
      "id": 548,
      "input": "Musiqada \"rondo\" shakli nima?",
      "output": "Rondo  bu musiqa shakli bo'lib, uning asosiy mavzusi bir necha marta takrorlanadi va har safar yangi mavzular bilan birga ishlanadi."
    },
    {
      "id": 549,
      "input": "Arxitektura san'ati va \"yangi arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Yangi arxitektura texnologiyalardan foydalanib, ko'pincha funktsionalizm va minimalizmga asoslanadi, eski uslublardan voz kechiladi."
    },
    {
      "id": 550,
      "input": "San'atda \"moda dizayni\" qanday ishlatiladi?",
      "output": "Moda dizayni san'ati har yil yangi trendlar yaratib, kiyim va aksessuarlarning estetik jihatlarini rivojlantiradi."
    },
    {
      "id": 551,
      "input": "O'zbek musiqasida \"shashmaqom\" qanday ishlatiladi?",
      "output": "Shashmaqom O'zbek musiqa an'analarining eng muhim qismidir, unda o'ziga xos melodik va ritmik shakllar qo'llaniladi."
    },
    {
      "id": 552,
      "input": "Teatrda \"farse\" qanday ishlatiladi?",
      "output": "Farse  bu komediya janri bo'lib, unda kulgili vaziyatlar va abartmalar orqali tomoshabinga kulgili effektlar beriladi."
    },
    {
      "id": 553,
      "input": "Rassomlikda \"naturizm\" qanday ishlatiladi?",
      "output": "Naturizmda rassomlar tabiatni imkon qadar aniq va real tarzda tasvirlashga intiladilar, tasvirlarning har bir detali hayotdan olingan."
    },
    {
      "id": 554,
      "input": "Musiqada \"duxovye instrumentlar\" nima?",
      "output": "Duxovye instrumentlar havoda titrashi orqali ovoz chiqaradigan musiqa asboblaridir, masalan, truba, klarinet, saxofon va boshqalar."
    },
    {
      "id": 555,
      "input": "Arxitektura san'ati va \"minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalizm arxitekturasida soddalik, bo'sh joy va toza shakllar ustuvor bo'lib, ortiqcha bezaklardan voz kechiladi."
    },
    {
      "id": 556,
      "input": "San'atda \"kolorizm\" nima?",
      "output": "Kolorizm san'atda ranglar yordamida obrazlarni yaratish va tasvirlash texnikasidir, unda ranglarning ahamiyati katta."
    },
    {
      "id": 557,
      "input": "O'zbek madaniyatida \"muqaddima\" qanday ishlatiladi?",
      "output": "Muqaddima O'zbek adabiyotining boshlang'ich qismi bo'lib, asar haqida umumiy tushuncha beradi, mavzu va qahramonlarni tanishtiradi."
    },
    {
      "id": 558,
      "input": "Teatrda \"repertuar\" nima?",
      "output": "Repertuar teatrda doimiy namoyish etiladigan asarlar to'plamidir, bu orqali teatr o'zining muayyan yo'nalishini belgilaydi."
    },
    {
      "id": 559,
      "input": "Rassomlikda \"kubizm\" qanday ishlatiladi?",
      "output": "Kubizm san'atida shakllar geometriyasiga asoslangan, ob'ektlar bir necha burchakdan tasvirlanadi, bu san'at asarini murakkab va ko'p qirrali qiladi."
    },
    {
      "id": 560,
      "input": "Musiqada \"modulatsiya\" nima?",
      "output": "Modulatsiya musiqa asarining tonalliklarini o'zgartirish jarayonidir, bu asar dinamikasini va yirik strukturasini shakllantiradi."
    },
    {
      "id": 561,
      "input": "Arxitektura san'ati va \"ekspressionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Ekspressionizm arxitekturasida shakllar va strukturalar estetik va hissiy reaktsiyalarni keltirib chiqarish uchun o'zgaruvchan va dramatik tarzda quriladi."
    },
    {
      "id": 562,
      "input": "San'atda \"neoklassitsizm\" qanday ishlatiladi?",
      "output": "Neoklassitsizmda san'at klassik qadriyatlarni tiklashga intiladi, soddalik va o'lchamga e'tibor beriladi, romantizmga qarshi chiqiladi."
    },
    {
      "id": 563,
      "input": "O'zbek musiqasida \"fajr\" nima?",
      "output": "Fajr O'zbek musiqasida tonggi vaqtni ifodalovchi, go'zal va dilkash melodiya bo'lib, asosan tasavvuf va diniy musiqalar bilan bog'liqdir."
    },
    {
      "id": 564,
      "input": "Teatrda \"improvisatsiya\" nima?",
      "output": "Improvisatsiya teatrda sahnada tayyorlanmagan va tasodifan ijro etilgan nutq va harakatlarni ifodalash jarayonidir."
    },
    {
      "id": 565,
      "input": "Rassomlikda \"abstraktsionizm\" qanday ishlatiladi?",
      "output": "Abstraktsionizmda rassomlar tasvirni real dunyo bilan bog'lamasdan, faqat ranglar va shakllarni ishlatib, his-tuyg'ularini ifodalaydilar."
    },
    {
      "id": 566,
      "input": "Musiqada \"akord\" nima?",
      "output": "Akord bir vaqtning o'zida bir nechta tovushning birlashishidir, bu musiqa asarida bir xil tonal strukturani yaratadi."
    },
    {
      "id": 567,
      "input": "Arxitektura san'ati va \"postmodernizm\" o'rtasidagi aloqalar qanday?",
      "output": "Postmodernizm arxitekturasida eski uslublardan olingan elementlar qayta ishlanadi va yangi kontekstda ko'rinish oladi, an'anaviy va zamonaviylikni uyg'unlashtiradi."
    },
    {
      "id": 568,
      "input": "San'atda \"grafika\" nima?",
      "output": "Grafika san'ati chizish va bosib chiqarish uslublarini o'z ichiga oladi, bu san'at asarlarida tasvirlar va belgilarni yaratish jarayonidir."
    },
    {
      "id": 569,
      "input": "O'zbek madaniyatida \"poezia\" qanday ishlatiladi?",
      "output": "Poezia O'zbek madaniyatida adabiy asar bo'lib, she'rlar va lirik asarlar orqali ma'naviy dunyoni ifodalaydi."
    },
    {
      "id": 570,
      "input": "Teatrda \"interpretatsiya\" nima?",
      "output": "Interpretatsiya teatrda asar yoki personajni boshqacha yondashuv bilan talqin qilishdir, bu tomoshabinning yangicha fikrini ochib beradi."
    },
    {
      "id": 571,
      "input": "Rassomlikda \"teatr\" qanday ishlatiladi?",
      "output": "Teatr san'ati rassomlikda sahnada jonli ifodalanadigan va harakatlarni ko'rsatuvchi asarlarni yaratish uchun ishlatiladi."
    },
    {
      "id": 572,
      "input": "Musiqada \"dissonans\" nima?",
      "output": "Dissonans  bu tovushlarning uyg'un emasligi, ular tinglovchida kutilgan yoki noqulay sezgi uyg'otadi, bu musiqada tension yaratadi."
    },
    {
      "id": 573,
      "input": "Arxitektura san'ati va \"neobarokko\" o'rtasidagi aloqalar qanday?",
      "output": "Neobarokko arxitekturasida barokko uslubining takrorlanishi bilan birga zamonaviy elementlar qo'llanilib, inshootlarga dramatik, bezakli ko'rinish beriladi."
    },
    {
      "id": 574,
      "input": "Arxitektura san'ati va \"barokko\" o'rtasidagi aloqalar qanday?",
      "output": "Barokko arxitekturasi dramalik va bezaklarga boy, asosan kengaytirilgan va murakkab strukturalar bilan ajralib turadi."
    },
    {
      "id": 575,
      "input": "Musiqada \"konsonans\" nima?",
      "output": "Konsonans tovushlar orasidagi uyg'unlik bo'lib, ular bir-birini mukammal tarzda to'ldiradi, bu eshituvchini tinchlantiradi."
    },
    {
      "id": 576,
      "input": "O'zbek san'ati va \"naqqoshlik\" o'rtasidagi aloqalar qanday?",
      "output": "Naqqoshlik O'zbek san'atining muhim qismidir, unda ranglar va naqshlar yordamida o'ziga xos vizual asarlar yaratiladi."
    },
    {
      "id": 577,
      "input": "Teatrda \"dastlabki spektakl\" nima?",
      "output": "Dastlabki spektakl biror teatr asarining birinchi namoyishi bo'lib, odatda u tomoshabinni tanishtirish uchun o'tkaziladi."
    },
    {
      "id": 578,
      "input": "Rassomlikda \"romantizm\" qanday ishlatiladi?",
      "output": "Romantizmda rassomlar o'z his-tuyg'ularini va orzularini ifodalashda tabiatni, inson ruhiyatini va haqiqatdan tashqaridagi tasavvurlarni tasvirlaydilar."
    },
    {
      "id": 579,
      "input": "Musiqada \"tema va variatsiyalar\" nima?",
      "output": "Tema va variatsiyalar  bu musiqa shakli bo'lib, bunda asosan bir asosiy melodiya (tema) bir necha marta o'zgartirilgan shaklda takrorlanadi."
    },
    {
      "id": 580,
      "input": "Arxitektura san'ati va \"funksionalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Funksionalizm arxitekturasida binoning tashqi ko'rinishi uning ichki funktsiyasiga mos kelishi kerak, shakl va dizayn amaliy ehtiyojlarga asoslanadi."
    },
    {
      "id": 581,
      "input": "San'atda \"ikonografi\" nima?",
      "output": "Ikonografi diniy yoki madaniy tasvirlarning muayyan belgilarini va simvollarini yaratish, ularni mazmuni bilan tushuntirishga asoslanadi."
    },
    {
      "id": 582,
      "input": "O'zbek musiqasida \"yallama\" qanday ishlatiladi?",
      "output": "Yallama  O'zbek xalq musiqasining ritmik va energiyaga to'la janrlaridan biri bo'lib, tezkor va hayajonli raqsni yaratadi."
    },
    {
      "id": 583,
      "input": "Teatrda \"dialog\" nima?",
      "output": "Dialog  bu sahnada ikki yoki undan ortiq personajlar o'rtasida olib boriladigan suhbatdir, bu asar rivojlanishini va karakterlarning munosabatlarini aks ettiradi."
    },
    {
      "id": 584,
      "input": "Rassomlikda \"foto-realizm\" qanday ishlatiladi?",
      "output": "Foto-realizmda rassomlar tabiatni yoki kundalik hayotni juda aniq va detallashtirilgan tarzda, fotosuratga o'xshash darajada tasvirlaydilar."
    },
    {
      "id": 585,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya musiqa asarida bir necha mustaqil melodiyalarning bir vaqtda ijro etilishi, bu esa asarlarni yanada murakkab qiladi."
    },
    {
      "id": 586,
      "input": "Arxitektura san'ati va \"neobarokko\" o'rtasidagi aloqalar qanday?",
      "output": "Neobarokko arxitekturasida barokko uslubining yangi talqini yaratiladi, unda bezaklar va dramatik elementlar ko'proq ishlatiladi."
    },
    {
      "id": 587,
      "input": "San'atda \"impressionizm\" qanday ishlatiladi?",
      "output": "Impressionizmda san'atkorlar yorug'lik va ranglarning shoshilinch taassurotlarini tasvirlashga intilishadi, bu asarlarni jonli va haqiqiy qiladi."
    },
    {
      "id": 588,
      "input": "O'zbek madaniyatida \"teatr\" qanday ishlatiladi?",
      "output": "Teatr O'zbek madaniyatida qadimdan muhim o'rin tutgan, u inson hayotining turli tomonlarini ko'rsatadi va xalqni o'qitish vositasi sifatida ishlatiladi."
    },
    {
      "id": 589,
      "input": "Teatrda \"absurd\" uslubi qanday ishlatiladi?",
      "output": "Absurd teatrida voqealar mantiqsiz, personajlar o'zlarining maqsadsiz va noaniq hayotlarini ko'rsatadi, bu tomoshabinni hayotning abadiy befoydaligiga ishora qiladi."
    },
    {
      "id": 590,
      "input": "Rassomlikda \"impresyonizm\" qanday ishlatiladi?",
      "output": "Impresyonizmda rassomlar yorug'lik, ranglar va harakatlarni suratga olish orqali tabiatni va inson hayotining tezkor taassurotlarini tasvirlaydilar."
    },
    {
      "id": 591,
      "input": "Musiqada \"kontrapunkt\" nima?",
      "output": "Kontrapunkt ikki yoki undan ortiq mustaqil melodiyalarni birlashtirish san'ati bo'lib, ular bir-birini to'ldiradi va qo'shimcha harmoniyalar yaratadi."
    },
    {
      "id": 592,
      "input": "Arxitektura san'ati va \"pashalar me'morchiligi\" o'rtasidagi aloqalar qanday?",
      "output": "Pashalar me'morchiligi turkiy, arab va o'zbek uslublarining uyg'unlashuvi bo'lib, u tarixiy va madaniy boyliklarni aks ettiradi."
    },
    {
      "id": 593,
      "input": "San'atda \"neorealizm\" nima?",
      "output": "Neorealizm san'ati o'zining real hayotni tasvirlashdagi soddaligi va ob'ektivligi bilan ajralib turadi, unda tasvirlangan hodisalar haqiqiy va samimiy bo'ladi."
    },
    {
      "id": 594,
      "input": "O'zbek musiqasida \"makom\" nima?",
      "output": "Makom  bu O'zbek musiqa san'ati tizimi bo'lib, unda o'ziga xos vokal va instrumental shakllar mavjud, u an'anaviy musiqaning asosini tashkil etadi."
    },
    {
      "id": 595,
      "input": "Teatrda \"repertuar\" nima?",
      "output": "Repertuar  bu teatrda ko'rsatiladigan asarlarning yig'indisi bo'lib, u teatrning san'ati va yo'nalishiga qarab o'zgarib turadi."
    },
    {
      "id": 596,
      "input": "Rassomlikda \"suryalisizm\" qanday ishlatiladi?",
      "output": "Suryalisizmda rassomlar insonning ongsiz fikrlarini va tasavvurlarini tasvirlashga harakat qiladilar, g'ayrioddiy va fantastik obrazlarni yaratadilar."
    },
    {
      "id": 597,
      "input": "Musiqada \"akordlar\" qanday ishlatiladi?",
      "output": "Akordlar bir nechta tovushlarning birlashuvi orqali musiqa asarida harmoniyani yaratish, emotsiyalarni ifodalash uchun ishlatiladi."
    },
    {
      "id": 598,
      "input": "Arxitektura san'ati va \"mekonizm\" o'rtasidagi aloqalar qanday?",
      "output": "Mekonizmda arxitektura mavjud joy va vazifalarni optimal tarzda tashkil qilishni maqsad qiladi, bu esa joyning samaradorligini oshiradi."
    },
    {
      "id": 599,
      "input": "San'atda \"barokko\" qanday ishlatiladi?",
      "output": "Barokko uslubi san'atda drama, bezak va harakatni kuchaytirgan shakllar orqali katta ta'sir o'rtatadi, go'zallik va muhimlikni ta'kidlaydi."
    },
    {
      "id": 600,
      "input": "O'zbek madaniyatida \"chaqmoq\" nima?",
      "output": "Chaqmoq  bu O'zbek folklorida diniy va etnik an'analarga asoslangan afsonaviy belgidir, kuch va energiyaning ramzi sifatida tasvirlanadi."
    },
    {
      "id": 601,
      "input": "Teatrda \"maskarada\" nima?",
      "output": "Maskarada  bu teatrda yuzni yopish va belgilangan personajni ifodalashni anglatadi, ko'pincha karnaval yoki bayram tadbirlarida ishlatiladi."
    },
    {
      "id": 602,
      "input": "Rassomlikda \"romantizm\" qanday ishlatiladi?",
      "output": "Romantizm rassomlar tomonidan tabiat, inson ruhiyatining qiyinchiliklari va yorqin tasavvurlarni tasvirlashda ishlatiladi, bu his-tuyg'ularga asoslanadi."
    },
    {
      "id": 603,
      "input": "Arxitektura san'ati va \"postmodernizm\" o'rtasidagi aloqalar qanday?",
      "output": "Postmodernizm arxitekturasida eski uslublar va zamonaviy dizayn elementlari birlashtiriladi, o'ziga xos bezaklar va nostaljik yondashuvlar qo'llaniladi."
    },
    {
      "id": 604,
      "input": "Musiqada \"orxestra\" nima?",
      "output": "Orxestra  bu turli xil asboblardan iborat musiqiy guruh bo'lib, u simfonik asarlar va katta hajmdagi kompozitsiyalarni ijro etadi."
    },
    {
      "id": 605,
      "input": "O'zbek san'ati va \"madaniy meros\" o'rtasidagi aloqalar qanday?",
      "output": "O'zbek san'ati madaniy meros orqali o'zining tarixiy, diniy va etnik o'ziga xosligini saqlab kelgan, ularning tasviriy va amaliy san'ati bir-biri bilan bog'liq."
    },
    {
      "id": 606,
      "input": "Teatrda \"pantomima\" nima?",
      "output": "Pantomima  bu so'zsiz ifodalovchi teatr turi bo'lib, unda aktyorlar yuz va tana harakatlari yordamida voqealarni yoki hissiyotlarni ko'rsatadilar."
    },
    {
      "id": 607,
      "input": "Rassomlikda \"renessans\" qanday ishlatiladi?",
      "output": "Renessans san'ati klassik Yunon-Rim madaniyatiga asoslanib, inson shakllarini va tabiatni realistik tarzda tasvirlashga intiladi."
    },
    {
      "id": 608,
      "input": "Musiqada \"tango\" nima?",
      "output": "Tango  bu janr bo'lib, asosan Argentina va Urugvayda rivojlangan, ritmik va romantik tuyg'ularni ifodalovchi raqs va musiqa shaklidir."
    },
    {
      "id": 609,
      "input": "Arxitektura san'ati va \"gotik uslub\" o'rtasidagi aloqalar qanday?",
      "output": "Gotik uslubida baland minoralar, murakkab detallashgan tasvirlar va yorug'likni ko'proq jalb qiluvchi oynalar ishlatiladi, diniy va ma'bed arxitekturasi uchun xarakterlidir."
    },
    {
      "id": 610,
      "input": "San'atda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizm san'atida rassomlar ichki his-tuyg'ularini va kayfiyatlarini ranglar va shakllar orqali tasvirlashadi, bu esa hayotning noaniqligini va muammolarini aks ettiradi."
    },
    {
      "id": 611,
      "input": "O'zbek musiqasida \"maqom\" tizimi qanday ishlaydi?",
      "output": "Maqom tizimi  O'zbek musiqa an'analarida bir nechta melodik va ritmik shakllarni o'z ichiga olgan kompleks tizim bo'lib, musiqada ma'lum tonalliklar va joriy melodiya muhim o'rin tutadi."
    },
    {
      "id": 612,
      "input": "Teatrda \"komediyaning\" asosiy xususiyatlari qanday?",
      "output": "Komediya teatrda kulgili voqealar, xatoliklar va kutilmagan vaziyatlarni taqdim etadi, asosan ijtimoiy ziddiyatlar va odatiy muammolarni o'zgacha va kulgili tarzda aks ettiradi."
    },
    {
      "id": 613,
      "input": "Rassomlikda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda rassomlar ong osti tasavvurlarini, g'ayrioddiy va tasavvurni ifodalash orqali hayoliy va fantastik obrazlar yaratadilar."
    },
    {
      "id": 614,
      "input": "Musiqada \"cello\" asbobi nima?",
      "output": "Cello  bu simli asbob bo'lib, orkestrlarda va kameral musiqa tarkibida ishlatiladi, uning chuqur va boy ovozi bor."
    },
    {
      "id": 615,
      "input": "Arxitektura san'ati va \"funktsionalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Funktsionalizm arxitektura uslubi binalarning dizayni va tashkilotini ularning maqsadiga ko'ra optimallashtirishga asoslanadi."
    },
    {
      "id": 616,
      "input": "San'atda \"gotika\" uslubi qanday ishlatiladi?",
      "output": "Gotika uslubi yuqori va ingichka strukturalar, kattaroq derazalar va murakkab bezaklar orqali diniy va g'ayrioddiy hissiyotlarni ifodalaydi."
    },
    {
      "id": 617,
      "input": "O'zbek madaniyatida \"badiiy mumtoz adabiyot\" qanday namoyon bo'ladi?",
      "output": "Badiiy mumtoz adabiyot O'zbek madaniyatida she'rlar, hikoyalar va eposlar shaklida bo'lib, asosan tarix, urf-odatlar va qadriyatlarni aks ettiradi."
    },
    {
      "id": 618,
      "input": "Teatrda \"tragediya\" janrining asosiy xususiyatlari qanday?",
      "output": "Tragediya janrida insonning ichki va tashqi ziddiyatlari, omadsizliklar va azob-uqubatlar tasvirlanadi, asar qahramonlarning dramatik qarorlari bilan yakunlanadi."
    },
    {
      "id": 619,
      "input": "Rassomlikda \"modernizm\" qanday ishlatiladi?",
      "output": "Modernizmda san'atkorlar eski uslublardan voz kechib, yangi va tajriba qilishga asoslangan uslublarni yaratadilar, noaniq va tushunarli bo'lmagan shakllarni tasvirlaydilar."
    },
    {
      "id": 620,
      "input": "Musiqada \"fortepiano\" nima?",
      "output": "Fortepiano  bu klavishli simli asbob bo'lib, musiqa asarlarida keng qo'llaniladi, uning ovozi dinamik va o'zgaruvchan bo'ladi."
    },
    {
      "id": 621,
      "input": "Arxitektura san'ati va \"neoklassitsizm\" o'rtasidagi aloqalar qanday?",
      "output": "Neoklassitsizm arxitekturasida klassik yunon va rim uslublari takrorlanadi, o'zgarishlarga asoslangan soddalik va nisbiy simmetriya afzal ko'riladi."
    },
    {
      "id": 622,
      "input": "San'atda \"figuralizm\" nima?",
      "output": "Figuralizm  bu san'atda inson yoki hayvon shakllarini, anatomiya va harakatni to'liq va aniq tasvirlash uslubidir."
    },
    {
      "id": 623,
      "input": "O'zbek musiqasida \"dastan\" nima?",
      "output": "Dastan O'zbek musiqasida xalq og'zaki ijodining ko'rinishidir, unda tarixiy voqealar yoki qahramonlar haqidagi ma'lumotlar bayon etiladi."
    },
    {
      "id": 624,
      "input": "Teatrda \"monolog\" nima?",
      "output": "Monolog  bu bir personajning sahnada o'zi bilan yoki tomoshabin bilan gaplashishini ifodalovchi uzun nutqdir."
    },
    {
      "id": 625,
      "input": "Rassomlikda \"konseptualizm\" qanday ishlatiladi?",
      "output": "Konseptualizmda rassomlar asarlarini yengil yoki kamroq vizual tasvirlar orqali, g'oyani yoki xabarni yetkazishga intilishadi."
    },
    {
      "id": 626,
      "input": "Musiqada \"basso continuo\" nima?",
      "output": "Basso continuo  bu barokko musiqasida qo'llaniladigan asosiy akkordlar va ritmni ta'minlash uchun ijro etiladigan pastki chiziqdir."
    },
    {
      "id": 627,
      "input": "Arxitektura san'ati va \"dekorativ san'at\" o'rtasidagi aloqalar qanday?",
      "output": "Dekorativ san'at arxitekturaga ko'plab bezak elementlarini qo'shadi, binolarni estetik jihatdan boyitadi va funksional jihatdan muvofiqligini ta'minlaydi."
    },
    {
      "id": 628,
      "input": "San'atda \"konstruktivizm\" qanday ishlatiladi?",
      "output": "Konstruktivizm san'atida shakllar va materiallar sintez qilinib, ob'ektiv va texnik nuqtai nazardan amaliy dizayn yaratish nazarda tutiladi."
    },
    {
      "id": 629,
      "input": "O'zbek madaniyatida \"xalq raqsi\" qanday ifodalanadi?",
      "output": "Xalq raqsi O'zbek madaniyatida milliy urf-odatlarni, tabiatni va xushnud hayotni ifodalovchi ijodiy shakldir, raqsda turli xil ritmlar va harakatlar mavjud."
    },
    {
      "id": 630,
      "input": "Teatrda \"epik teatr\" qanday ishlatiladi?",
      "output": "Epik teatrda voqealar tezda rivojlanib, tomoshabinga ta'sir qilishdan ko'ra, insoniyatning ijtimoiy va tarixiy holatini aks ettirishga qaratilgan."
    },
    {
      "id": 631,
      "input": "Rassomlikda \"neoekspressionizm\" qanday ishlatiladi?",
      "output": "Neoekspressionizmda rassomlar ichki hissiyotlarini va hissiy reaksiya ta'sirida obrazlar yaratadilar, ranglar va shakllar intensiv va kuchli bo'ladi."
    },
    {
      "id": 632,
      "input": "Musiqada \"sinfoniya\" nima?",
      "output": "Sinfoniya  bu katta orkestrlarda ijro etiladigan va bir nechta qismlardan iborat musiqiy asar bo'lib, ko'pincha dramani va hissiyotlarni ifodalaydi."
    },
    {
      "id": 633,
      "input": "Arxitektura san'ati va \"minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalizmda oddiy shakllar va geometrik chizgilar ishlatiladi, binolarning funksiyasi asosiy e'tiborni jalb qiladi, ornamentlar esa kamroq."
    },
    {
      "id": 634,
      "input": "Musiqada \"fuga\" nima?",
      "output": "Fuga  bu polifonik musiqaning bir shakli bo'lib, unda bir nechta mustaqil melodiyalar bir-birini takrorlaydi va rivojlantiradi."
    },
    {
      "id": 635,
      "input": "O'zbek san'ati va \"yosh rassomlar\" o'rtasidagi aloqalar qanday?",
      "output": "Yosh rassomlar O'zbek san'atida yangi yo'nalishlar yaratib, an'anaviy elementlar va zamonaviy yondashuvlarni birlashtirib ishlaydilar."
    },
    {
      "id": 636,
      "input": "Teatrda \"improvizatsiya\" nima?",
      "output": "Improvizatsiya  bu sahnada aktyorlarning oldindan rejalashtirilmagan, kutilmagan harakatlar va dialoglarni yaratish san'ati."
    },
    {
      "id": 637,
      "input": "Rassomlikda \"barokko\" qanday ishlatiladi?",
      "output": "Barokko uslubida rassomlar dramatik kompozitsiyalar, dinamik harakatlar va boy bezaklar yordamida vizual hissiyotlarni kuchaytiradilar."
    },
    {
      "id": 638,
      "input": "Musiqada \"simfonik poema\" nima?",
      "output": "Simfonik poema  bu asosan orkestr uchun yozilgan, ma'lum bir hikoya yoki tasvirni ifodalovchi musiqa asari."
    },
    {
      "id": 639,
      "input": "Arxitektura san'ati va \"ekspresionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Ekspresionizmda arxitektura shakllari va tasvirlari ichki his-tuyg'ularni ifodalashga qaratilgan, shakllar asosan deformatsiya qilinadi."
    },
    {
      "id": 640,
      "input": "San'atda \"abstract ekspressionizm\" qanday ishlatiladi?",
      "output": "Abstrakt ekspressionizmda rassomlar o'z his-tuyg'ularini bevosita va ma'lum shaklsiz ravishda ranglar va chizgilar orqali ifodalaydilar."
    },
    {
      "id": 641,
      "input": "O'zbek musiqasida \"tashkent makomi\" nima?",
      "output": "Tashkent makomi  bu O'zbek musiqa tizimining bir qismi bo'lib, u Tashkent viloyatiga xos o'ziga xos melodik va ritmik xususiyatlarga ega."
    },
    {
      "id": 642,
      "input": "Teatrda \"narrativ\" uslub nima?",
      "output": "Narrativ uslubda teatr asari voqealar ketma-ketligi va personajlar orqali hikoya qilinadi, bu uslubda syujet boshidan oxirigacha aniq tasvirlanadi."
    },
    {
      "id": 643,
      "input": "Rassomlikda \"naturalizm\" qanday ishlatiladi?",
      "output": "Naturalizmda rassomlar tabiiy ob'ektlar va insonlar hayotini aniq va realistik tarzda tasvirlashga intiladilar."
    },
    {
      "id": 644,
      "input": "Musiqada \"poliritmiya\" nima?",
      "output": "Poliritmiya  bu bir vaqtda turli ritmlar yoki har xil vaqt o'lchovlarining ijro etilishi, bu musiqada murakkablikni yaratadi."
    },
    {
      "id": 645,
      "input": "Arxitektura san'ati va \"art-deko\" o'rtasidagi aloqalar qanday?",
      "output": "Art-deko uslubi yuqori darajadagi san'at va zamonaviy dizaynni birlashtiradi, betakror simmetriya, stilize qilingan shakllar va bezaklar ishlatiladi."
    },
    {
      "id": 646,
      "input": "San'atda \"pop-art\" qanday ishlatiladi?",
      "output": "Pop-artda ommaviy madaniyat va reklama elementlaridan foydalaniladi, bu uslubda rassomlar kundalik hayotni va tijorat san'ati tasvirlarini yaratar ekan."
    },
    {
      "id": 647,
      "input": "O'zbek madaniyatida \"naqqosh\" nima?",
      "output": "Naqqosh  bu an'anaviy O'zbek san'atida ranglar va naqshlar yordamida bezaklar yaratadigan, naqshdosh rassomdir."
    },
    {
      "id": 648,
      "input": "Teatrda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda teatrda mantiqsiz, g'ayrioddiy va fantastik voqealar yordamida tomoshabinga hayot va ongning yangi ko'rinishlari ko'rsatiladi."
    },
    {
      "id": 649,
      "input": "Rassomlikda \"kubizm\" qanday ishlatiladi?",
      "output": "Kubizmda rassomlar ob'ektlarni geometrik shakllarda va ko'p nuqtai nazardan tasvirlaydilar, bu uslubda haqiqatni ko'p o'lchovli tarzda ko'rsatishga harakat qilinadi."
    },
    {
      "id": 650,
      "input": "Musiqada \"atonalizm\" nima?",
      "output": "Atonalizm musiqa asarida an'anaviy tonallikdan chetlashish bo'lib, unda har bir tovush o'zaro mustaqil ravishda ishlatiladi, shuning uchun musiqaning yirik tuzilmasi yo'qoladi."
    },
    {
      "id": 651,
      "input": "Arxitektura san'ati va \"organik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Organik arxitektura binolarni tabiiy muhitga moslashtirishga intiladi, u yerga o'xshash shakllar va materiallardan foydalanadi."
    },
    {
      "id": 652,
      "input": "San'atda \"futurizm\" qanday ishlatiladi?",
      "output": "Futurizm san'ati taraqqiyot va texnologik o'zgarishlar tasvirlanadi, u harakat, tezlik va dinamiklikni aks ettiradi."
    },
    {
      "id": 653,
      "input": "O'zbek musiqasida \"shashmaqom\" nima?",
      "output": "Shashmaqom  bu O'zbek musiqa tizimida oltita asosiy makomdan iborat bo'lib, u musiqa va rituallar bilan bog'liq chuqur diniy va ma'naviy ma'lumotlarni o'z ichiga oladi."
    },
    {
      "id": 654,
      "input": "Teatrda \"maskarada\" nima?",
      "output": "Maskarada  bu teatrda aktyorlar yuzlarini va tana qismlarini yashirish yoki o'zgartirish orqali maxsus obrazlarni yaratadigan asar yoki uslubdir."
    },
    {
      "id": 655,
      "input": "Rassomlikda \"neoklassitsizm\" qanday ishlatiladi?",
      "output": "Neoklassitsizmda rassomlar klassik san'atning soddaligi va ideal go'zalligini qayta tiklashga intiladilar, an'anaviy tasvirlarni takrorlaydilar."
    },
    {
      "id": 656,
      "input": "Musiqada \"harmony\" nima?",
      "output": "Harmony  bu musiqa asaridagi turli tovushlar birlashtirilgan holatda uyg'unlikni yaratadi, bu eshituvchini tinchlantiradi yoki emotsional ta'sir ko'rsatadi."
    },
    {
      "id": 657,
      "input": "Arxitektura san'ati va \"tangensial dizayn\" o'rtasidagi aloqalar qanday?",
      "output": "Tangensial dizaynda shakllar va chiziqlar orasidagi bog'lanish va tartib tasvirlanadi, bu asarlarga o'ziga xos geometrik tuzilma beradi."
    },
    {
      "id": 658,
      "input": "San'atda \"romantizm\" qanday ishlatiladi?",
      "output": "Romantizmda san'atkorlar tabiatni, insonning ichki olamini va hayotdagi katta his-tuyg'ularni ifodalashga intiladilar."
    },
    {
      "id": 659,
      "input": "O'zbek madaniyatida \"makomchilik\" nima?",
      "output": "Makomchilik O'zbek musiqa tizimining yuksak san'ati bo'lib, u ma'lum ritm va melodiya tizimlariga asoslanadi, xalq musiqasining asosini tashkil etadi."
    },
    {
      "id": 660,
      "input": "Teatrda \"komediyaning\" asosiy xususiyatlari qanday?",
      "output": "Komediya janrida kulgili vaziyatlar va personajlar yordamida ijtimoiy ziddiyatlar, odamlarning kamchiliklari va ijobiy xususiyatlari aks ettiriladi."
    },
    {
      "id": 661,
      "input": "Rassomlikda \"lyurizm\" qanday ishlatiladi?",
      "output": "Lyurizmda rassomlar ranglarni va nur-shu'lalarni juda aniq va detallangan tarzda tasvirlaydilar, bu esa suratga yanada hayotiylik va yorqinlik kiritadi."
    },
    {
      "id": 662,
      "input": "Musiqada \"modulyatsiya\" nima?",
      "output": "Modulyatsiya  bu musiqa asarida tonallik o'zgarishini anglatadi, bu kompozitsiyani yangi darajaga ko'taradi."
    },
    {
      "id": 663,
      "input": "Arxitektura san'ati va \"bionik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Bionik arxitektura tabiatda uchraydigan shakllardan ilhomlanib, binolarni ekologik va funksional jihatdan optimallashtiradi."
    },
    {
      "id": 664,
      "input": "Musiqada \"kondenser\" nima?",
      "output": "Kondenser  bu orkestrda va simfonik musiqada ishlatiladigan kichik va yuqori tonda ovoz chiqaradigan asbobdir."
    },
    {
      "id": 665,
      "input": "O'zbek san'ati va \"ustoz-shogird\" an'analari qanday ishlaydi?",
      "output": "O'zbek san'ati ustoz-shogird an'analariga tayanib, yosh rassomlar o'zining mahoratini o'qituvchi va tajribali san'atchilar bilan o'rganadilar."
    },
    {
      "id": 666,
      "input": "Teatrda \"avangard\" uslub nima?",
      "output": "Avangard uslub teatrda yangi va tajribaviy uslublarni sinab ko'rishni, mavjud san'at shakllarini tanqid qilishni anglatadi."
    },
    {
      "id": 667,
      "input": "Rassomlikda \"impressionizm\" qanday ishlatiladi?",
      "output": "Impressionizmda rassomlar yorug'lik, ranglar va harakatni tezkor, qisqa burilishlarda tasvirlashga harakat qiladilar."
    },
    {
      "id": 668,
      "input": "Musiqada \"kontrapunkt\" nima?",
      "output": "Kontrapunkt  bu musiqa kompozitsiyasida bir necha mustaqil, lekin uyg'un ravishda birlashgan melodiya liniyalarining ishlatilishi."
    },
    {
      "id": 669,
      "input": "Arxitektura san'ati va \"rekonstruksiya\" o'rtasidagi aloqalar qanday?",
      "output": "Rekonstruksiya eski arxitekturani saqlash va yangilashni anglatadi, bunda tarixiy binolarni modernizatsiya qilish maqsad qilingan."
    },
    {
      "id": 670,
      "input": "San'atda \"avtomatizm\" qanday ishlatiladi?",
      "output": "Avtomatizmda rassomlar ong osti jarayonlari va tasavvurlarini chizmalar yoki ranglar orqali tabiiy tarzda ifodalaydilar."
    },
    {
      "id": 671,
      "input": "O'zbek musiqasida \"makom\" tizimining xususiyatlari qanday?",
      "output": "Makom tizimi O'zbek musiqa san'atida o'ziga xos tonallar va melodiyalar tizimidir, har bir makom o'zining ohanglari, harakati va uslubiga ega."
    },
    {
      "id": 672,
      "input": "Teatrda \"monolog\" va \"duolog\" o'rtasidagi farqlar qanday?",
      "output": "Monolog  bitta personajning o'z fikrlarini ifodalashini anglatadi, duolog esa ikki personajning o'zaro suhbatidir."
    },
    {
      "id": 673,
      "input": "Rassomlikda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizmda rassomlar o'z his-tuyg'ularini va ichki dunyosini g'ayrioddiy ranglar, deformatsiya va dramatik kompozitsiyalar orqali tasvirlashadi."
    },
    {
      "id": 674,
      "input": "Musiqada \"subyektivizm\" nima?",
      "output": "Subyektivizm musiqa asarida ijrochining shaxsiy his-tuyg'ulari va fikrlarini o'ziga xos tarzda aks ettiradi."
    },
    {
      "id": 675,
      "input": "Arxitektura san'ati va \"tehnologik dizayn\" o'rtasidagi aloqalar qanday?",
      "output": "Texnologik dizayn arxitektura va sanoatni birlashtiradi, zamonaviy materiallar va uslublarni yaratishda yangi texnologiyalarni qo'llaydi."
    },
    {
      "id": 676,
      "input": "San'atda \"yangi realizm\" qanday ishlatiladi?",
      "output": "Yangi realizmda san'atkorlar kundalik hayotning oddiy, ammo muhim qismlarini tasvirlashga harakat qiladilar, bu tasvirlar jamiyatning ijtimoiy va siyosiy muammolarini aks ettiradi."
    },
    {
      "id": 677,
      "input": "O'zbek madaniyatida \"rassomlik\" va \"hukumat\" o'rtasidagi aloqalar qanday?",
      "output": "Rassomlik hukumat tomonidan qo'llab-quvvatlanadi va madaniy siyosat orqali rivojlanadi, hukumat madaniyatni va san'atni milliy birlashuv va tarbiya vositasi sifatida ishlatadi."
    },
    {
      "id": 678,
      "input": "Teatrda \"absurd teatr\" nima?",
      "output": "Absurd teatr insonning yashash ma'nosizligi va mavjudlikdagi ahamiyatsizlikni ko'rsatadi, kutilmagan va mantiqsiz vaziyatlar orqali tomoshabinga xabar beradi."
    },
    {
      "id": 679,
      "input": "Rassomlikda \"superrealizm\" qanday ishlatiladi?",
      "output": "Superrealizmda rassomlar juda realistik tarzda tasvirlar yaratadilar, buni ko'rgan tomoshabinlar badiiy obrazni haqiqat deb qabul qilishadi."
    },
    {
      "id": 680,
      "input": "Musiqada \"sinergetik ovoz\" nima?",
      "output": "Sinergetik ovoz  bu bir nechta ovozlar yoki tovushlarning birlashib yangi, qo'shimcha va o'ziga xos tovush tuzilmasini yaratishi."
    },
    {
      "id": 681,
      "input": "Arxitektura san'ati va \"minimalistik dizayn\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalistik dizayn soddalikka, funktsionallikka va ortiqcha bezaklardan holi bo'lishga asoslangan, bu arxitekturadagi shakllarni optimallashtiradi."
    },
    {
      "id": 682,
      "input": "San'atda \"tanqidiy realizm\" qanday ishlatiladi?",
      "output": "Tanqidiy realizm san'ati ijtimoiy va siyosiy muammolarni ko'rsatib, mavjud tizim va adolatsizliklarga qarshi chiqishga yo'naltiriladi."
    },
    {
      "id": 683,
      "input": "O'zbek madaniyatida \"kino san'ati\" qanday rivojlanadi?",
      "output": "O'zbek kino san'ati an'anaviy xalq hikoyalarini, ijtimoiy muammolarni va tarixiy voqealarni kinoteatrda aks ettirib rivojlanadi."
    },
    {
      "id": 684,
      "input": "Teatrda \"absurd komediya\" nima?",
      "output": "Absurd komediya insonga xos o'zgacha va g'ayrioddiy vaziyatlarni kulgili tarzda aks ettiradi, bu esa hayotning ma'naviy va mantiqsizligini ta'kidlaydi."
    },
    {
      "id": 685,
      "input": "Rassomlikda \"futurizm\" qanday ishlatiladi?",
      "output": "Futurizmda rassomlar texnologik taraqqiyot, tezlik va zamonaviy hayotning dinamik jihatlarini ko'rsatish orqali yangi san'at shakllarini yaratadilar."
    },
    {
      "id": 686,
      "input": "Musiqada \"raga\" nima?",
      "output": "Raga  bu hind musiqa tizimida o'ziga xos melodik va ritmik tuzilishga ega, ma'lum bir kayfiyatni ifodalovchi musiqa shaklidir."
    },
    {
      "id": 687,
      "input": "Arxitektura san'ati va \"postmodernizm\" o'rtasidagi aloqalar qanday?",
      "output": "Postmodernizm arxitekturasi o'zida o'tmish va hozirgi zamonning uslublarini birlashtiradi, shakllar va bezaklarni yangi yondashuvlar bilan ko'rsatadi."
    },
    {
      "id": 688,
      "input": "San'atda \"abstrakt ekspressionizm\" qanday ishlatiladi?",
      "output": "Abstrakt ekspressionizmda rassomlar tasvirlar orqali ichki his-tuyg'ularini va emosional reaktsiyalarini tasvirlaydilar, shakllar va ranglar o'zining noaniqligi bilan ajralib turadi."
    },
    {
      "id": 689,
      "input": "O'zbek madaniyatida \"musavvir\" qanday rol o'ynaydi?",
      "output": "Musavvir  bu O'zbek madaniyatida vizual san'atning rivojlanishiga hissa qo'shadigan va o'zining tasviriy ishlarini xalq madaniyatiga taqdim etadigan shaxsdir."
    },
    {
      "id": 690,
      "input": "Teatrda \"romantik komediya\" qanday tasvirlanadi?",
      "output": "Romantik komediya teatrda sevgi, tuzilgan qiyinchiliklar va kulgili vaziyatlarni ifodalovchi, oxir-oqibatda ijobiy yakun topadigan asar shaklidir."
    },
    {
      "id": 691,
      "input": "Rassomlikda \"naivizm\" qanday ishlatiladi?",
      "output": "Naivizmda rassomlar oddiy va befarq tarzda tasvirlar yaratadilar, bu uslubda ko'pincha tabiat va oddiy hayot vaziyatlari aks ettiriladi."
    },
    {
      "id": 692,
      "input": "Musiqada \"transponirovka\" nima?",
      "output": "Transponirovka  bu musiqada biror melodiya yoki akkordning boshqa tonallikka ko'chirilishi."
    },
    {
      "id": 693,
      "input": "Arxitektura san'ati va \"organik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Organik arxitektura tabiiy shakllardan va materiallardan foydalanadi, binalar tabiat bilan uyg'un bo'lishi kerak."
    },
    {
      "id": 694,
      "input": "Arxitektura san'ati va \"deconstructivizm\" o'rtasidagi aloqalar qanday?",
      "output": "Deconstructivizm arxitekturasi an'anaviy simmetriya va tartibni buzadi, o'zgaruvchan va notekis shakllar yaratishga asoslanadi."
    },
    {
      "id": 695,
      "input": "Musiqada \"sintezator\" nima?",
      "output": "Sintezator  bu elektron musiqa asbobi bo'lib, ovozlarni yaratish va manipulyatsiya qilish imkoniyatini beradi."
    },
    {
      "id": 696,
      "input": "O'zbek san'ati va \"zamonaviy rassomlik\" o'rtasidagi aloqalar qanday?",
      "output": "Zamonaviy rassomlikda O'zbek san'atchilari milliy an'analarni zamonaviy texnologiyalar bilan birlashtiradilar."
    },
    {
      "id": 697,
      "input": "Teatrda \"tragediya\" va \"komediya\" o'rtasidagi farq nima?",
      "output": "Tragediya - insonning og'ir ijtimoiy yoki shaxsiy muammolarini aks ettiradi, komediya esa kulgili vaziyatlar va xatolarni ko'rsatadi."
    },
    {
      "id": 698,
      "input": "Rassomlikda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizmda rassomlar ong osti va g'ayrioddiy tasavvurlarni oddiy, lekin ajoyib tarzda tasvirlashadi."
    },
    {
      "id": 699,
      "input": "Musiqada \"monofoniya\" nima?",
      "output": "Monofoniya  bu bitta melodiyaning ijro etilishi, unda bir vaqtning o'zida faqat bitta tovush eshitiladi."
    },
    {
      "id": 700,
      "input": "Arxitektura san'ati va \"gotika\" o'rtasidagi aloqalar qanday?",
      "output": "Gotika arxitekturasida yuqori, nozik va uzun shakllar, keng pardalar va yorug'likni kirishini ta'minlovchi elementlar ishlatiladi."
    },
    {
      "id": 701,
      "input": "San'atda \"neorrealizm\" qanday ishlatiladi?",
      "output": "Neorrealizmda real hayotning oddiy, kundalik holatlari va ijtimoiy masalalar tasvirlanadi, bu uslubda realist yondashuvga urg'u beriladi."
    },
    {
      "id": 702,
      "input": "O'zbek musiqasida \"besh makom\" nima?",
      "output": "Besh makom  O'zbek musiqa tizimida beshta asosiy musiqiy shaklni ifodalaydi: shashmaqom, dastgoh, qoshiqlar va boshqa turli xil makomlar."
    },
    {
      "id": 703,
      "input": "Teatrda \"epik teatrlashuv\" nima?",
      "output": "Epik teatrlashuv  bu teatrda yirik syujetlar, tarixiy voqealar va dramatik tasvirlar yordamida tomoshabinga ma'lumot berish uslubi."
    },
    {
      "id": 704,
      "input": "Rassomlikda \"minimalizm\" qanday ishlatiladi?",
      "output": "Minimalizmda ranglar va shakllar soddalashtiriladi, aniq va toza geometrik shakllar, oddiy kompozitsiyalar ishlatiladi."
    },
    {
      "id": 705,
      "input": "Musiqada \"garmonika\" nima?",
      "output": "Garmonika  bu portativ musiqa asbobi bo'lib, havoning siqilishidan tovush chiqaradi va turli melodiyalarni ijro etishga imkon beradi."
    },
    {
      "id": 706,
      "input": "Arxitektura san'ati va \"romantik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Romantik arxitektura tabiat va o'zgacha muhitni aks ettiradi, uni an'anaviy uslublar va gotika shakllari bilan uyg'unlashtiradi."
    },
    {
      "id": 707,
      "input": "San'atda \"vanguardizm\" qanday ishlatiladi?",
      "output": "Vanguardizm san'ati yangi va eksperimental yondashuvlarni qabul qiladi, mavjud uslublar va formalarni inkor etadi."
    },
    {
      "id": 708,
      "input": "O'zbek madaniyatida \"musavvirlik\" san'ati qanday rivojlanadi?",
      "output": "Musavvirlik san'ati O'zbek madaniyatining ajralmas qismi bo'lib, tarixiy va zamonaviy voqealarni tasvirlashda asosiy o'rinni egallaydi."
    },
    {
      "id": 709,
      "input": "Teatrda \"lirik drama\" qanday tasvirlanadi?",
      "output": "Lirik drama insonning ichki his-tuyg'ularini va shaxsiy munosabatlarini chuqur tahlil qilib, dramatik tarzda aks ettiradi."
    },
    {
      "id": 710,
      "input": "Rassomlikda \"dadaizm\" qanday ishlatiladi?",
      "output": "Dadaizmda rassomlar g'ayrioddiy va absurt tasvirlar yaratib, san'atning maqsadini va shaklini savol ostiga qo'yadilar."
    },
    {
      "id": 711,
      "input": "Musiqada \"improvisatsiya\" nima?",
      "output": "Improvisatsiya  bu musiqachining biron-bir asarsiz, erkin tarzda ijro etilishi, yangi melodiyalar va ritmlar yaratishi."
    },
    {
      "id": 712,
      "input": "Arxitektura san'ati va \"barokko\" o'rtasidagi aloqalar qanday?",
      "output": "Barokko arxitekturasida dramatik va bezakli shakllar, simmetriya va yorqin kontrastlardan foydalaniladi."
    },
    {
      "id": 713,
      "input": "San'atda \"realizm\" qanday ishlatiladi?",
      "output": "Realizmda san'atchilar real hayotni va odamlarning kundalik faoliyatlarini realist tarzda tasvirlashga intiladilar."
    },
    {
      "id": 714,
      "input": "O'zbek musiqasida \"uyghur makomi\" nima?",
      "output": "Uyghur makomi  bu O'zbek musiqasining turli shakllaridan biri bo'lib, u Uyghur xalqining musiqa an'analari va uslublarini aks ettiradi."
    },
    {
      "id": 715,
      "input": "Teatrda \"tragikomediya\" qanday tasvirlanadi?",
      "output": "Tragicomediya janri kulgili va og'ir voqealarni birlashtirib, insoniy hayotning ikki tomonini birgalikda ko'rsatadi."
    },
    {
      "id": 716,
      "input": "Rassomlikda \"yangi badiiy uslublar\" qanday ishlatiladi?",
      "output": "Yangi badiiy uslublar san'atda innovatsiyalarni amalga oshiradi, bu esa eski uslublarga yangi yondashuvlarni yaratadi."
    },
    {
      "id": 717,
      "input": "Musiqada \"to'liq orchestr\" nima?",
      "output": "To'liq orkestr  bu barcha musiqa asboblarining birgalikda ijro etilishi, simfonik va kameraviy orkestrlarning uyg'unligidir."
    },
    {
      "id": 718,
      "input": "Arxitektura san'ati va \"paysaj arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Paysaj arxitekturasi landshaftni o'zgartirish orqali atrof-muhitni estetik tarzda yaxshilashni maqsad qiladi."
    },
    {
      "id": 719,
      "input": "San'atda \"eksperimentatsiya\" qanday ishlatiladi?",
      "output": "Eksperimentatsiya san'atda yangi shakllar, texnikalar va materiallarni sinab ko'rishni anglatadi, bu uslubda yaratish jarayoni muhimdir."
    },
    {
      "id": 720,
      "input": "O'zbek madaniyatida \"sadoqat\" va \"san'at\" o'rtasidagi aloqalar qanday?",
      "output": "O'zbek madaniyatida sadoqat san'atni to'liq qabul qilish, uning mazmuniga chuqur kirib borishni anglatadi."
    },
    {
      "id": 721,
      "input": "Teatrda \"so'z o'yini\" qanday ishlatiladi?",
      "output": "So'z o'yini teatrda hazil, kulgu va dramatik vaziyatlarni yaratishda ishlatiladigan aqlli va nozik dialoglarni ifodalaydi."
    },
    {
      "id": 722,
      "input": "Rassomlikda \"surrealist animatsiya\" qanday ishlatiladi?",
      "output": "Surrealist animatsiya tasvirlar va harakatlarni g'ayrioddiy va fantastik tarzda birlashtirib, tomoshabinlarni hayratda qoldiradi."
    },
    {
      "id": 723,
      "input": "Musiqada \"ritmik polifoniya\" nima?",
      "output": "Ritmik polifoniya  bu bir nechta mustaqil ritmik shakllarning birgalikda ishlashi, bu musiqada murakkab ritmik tuzilmani yaratadi."
    },
    {
      "id": 724,
      "input": "Arxitektura san'ati va \"zamonaviy minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Zamonaviy minimalizm arxitekturasida funksionallik va soddalik asosiy o'rin tutadi, shakllar va detallarda ortiqcha bezaklardan saqlaniladi."
    },
    {
      "id": 725,
      "input": "Arxitektura san'ati va \"neoklassitsizm\" o'rtasidagi aloqalar qanday?",
      "output": "Neoklassitsizm arxitekturasi klassik davrning an'analariga tayanib, ulardan o'ziga xos shakllar va simmetriya yaratadi."
    },
    {
      "id": 726,
      "input": "Musiqada \"arpej\" nima?",
      "output": "Arpej  bu akkordning notalarining ketma-ket va asta-sekin ijro etilishi, musiqada ritm va melodik davomiylikni yaratadi."
    },
    {
      "id": 727,
      "input": "O'zbek san'ati va \"folk san'ati\" o'rtasidagi aloqalar qanday?",
      "output": "Folk san'ati xalqning turmush tarzini va qadriyatlarini tasvirlab, an'anaviy ranglar va shakllardan foydalanadi."
    },
    {
      "id": 728,
      "input": "Teatrda \"tragik farq\" nima?",
      "output": "Tragik farq  bu asar qahramonining o'z qarorlari yoki atrofdagi sharoitlar sababli fojiaviy natijaga olib kelishi."
    },
    {
      "id": 729,
      "input": "Rassomlikda \"optik illuziya\" qanday ishlatiladi?",
      "output": "Optik illuziya rassomlar tomonidan ishlatiladigan texnikadir, bu ko'rish tizimimizni aldash orqali tasvirlarni harakatda yoki deformatsiyada ko'rsatadi."
    },
    {
      "id": 730,
      "input": "Musiqada \"garmoniyalash\" nima?",
      "output": "Garmoniyalash  bu bir nechta ovozlarni birgalikda ishlatib, ularning o'zaro uyg'unligini yaratish jarayonidir."
    },
    {
      "id": 731,
      "input": "Arxitektura san'ati va \"art-deko\" o'rtasidagi aloqalar qanday?",
      "output": "Art-deko arxitekturasi geometrik shakllar, silliq yuzalar va yuqori darajadagi bezaklar bilan ajralib turadi, bu zamonaviylik va hashamatni anglatadi."
    },
    {
      "id": 732,
      "input": "San'atda \"simvolizm\" qanday ishlatiladi?",
      "output": "Simvolizmda san'atkorlar inson tajribasini va his-tuyg'ularini tasvirlash uchun simvol va metaforalarni ishlatadilar."
    },
    {
      "id": 733,
      "input": "O'zbek musiqasida \"dastgoh\" nima?",
      "output": "Dastgoh  bu O'zbek musiqa tizimida turli melodiyalar va kompozitsiyalarni tashkil etuvchi, shakllangan va tizimlashtirilgan uslubdir."
    },
    {
      "id": 734,
      "input": "Teatrda \"absurd drama\" nima?",
      "output": "Absurd drama insonning yashash ma'nosizligini va mantiqsizligini ko'rsatadigan teatr janridir, unda odatiy mantiq yo'q."
    },
    {
      "id": 735,
      "input": "Rassomlikda \"yangi figura\" qanday ishlatiladi?",
      "output": "Yangi figura  bu rassomlar tomonidan o'zgarishlar, yangi materiallar yoki shakllar yordamida yaratigan yangi badiiy yondashuvdir."
    },
    {
      "id": 736,
      "input": "Musiqada \"modulatsiya\" nima?",
      "output": "Modulatsiya  bu musiqada bir tonallikdan boshqa tonallikka o'tish jarayonidir, bu asarga dinamik va yangi kayfiyat kiritadi."
    },
    {
      "id": 737,
      "input": "Arxitektura san'ati va \"biomimetik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Biomimetik arxitektura tabiatdagi shakllar va tizimlarni ko'rsatuvchi dizaynlar orqali ekotizimlarga mos va barqaror binolar yaratadi."
    },
    {
      "id": 738,
      "input": "San'atda \"konstruktivizm\" qanday ishlatiladi?",
      "output": "Konstruktivizmda rassomlar to'g'ri chiziqlar, shakllar va simmetriya yordamida ko'rsatish maqsadida inshootlar va strukturalarni yaratadilar."
    },
    {
      "id": 739,
      "input": "O'zbek madaniyatida \"folklor\" qanday tasvirlanadi?",
      "output": "Folklor O'zbek madaniyatida xalqning urf-odatlari, qo'shiqlari, hikoyalari va boshqa an'anaviy san'at shakllari orqali aks etadi."
    },
    {
      "id": 740,
      "input": "Teatrda \"metafizik drama\" nima?",
      "output": "Metafizik drama inson ruhiy va ijtimoiy dunyosining chuqur savollarini o'rganib, ma'naviy va borliq haqidagi masalalarni ko'rib chiqadi."
    },
    {
      "id": 741,
      "input": "Rassomlikda \"transformatsiya\" qanday ishlatiladi?",
      "output": "Transformatsiya rassom tomonidan mavjud shakllar va obrazlarning yangilanishi, yangi ma'noga ega bo'lishi yoki o'zgarishi orqali yaratiladi."
    },
    {
      "id": 742,
      "input": "Musiqada \"intervallar\" nima?",
      "output": "Intervallar  bu ikki tovush orasidagi masofa, musiqaning ritmik va melodik tuzilishida asosiy rol o'ynaydi."
    },
    {
      "id": 743,
      "input": "Arxitektura san'ati va \"vanguardizm\" o'rtasidagi aloqalar qanday?",
      "output": "Vanguardizm arxitekturasida an'anaviy yondashuvlarni inkor etish va yangi, eksperimental shakllarni yaratish maqsad qilingan."
    },
    {
      "id": 744,
      "input": "San'atda \"istilohiyat\" qanday ishlatiladi?",
      "output": "Istilohiyat  bu badiiy asarlarda mavjud bo'lgan maxsus atamalar, tahlil va simbolik ma'nolarni ifodalash uchun ishlatiladi."
    },
    {
      "id": 745,
      "input": "O'zbek musiqasida \"o'rtacha usul\" nima?",
      "output": "O'rtacha usul  bu O'zbek makomlaridagi tizim, unda asarlar an'anaviy uslubda ijro etilib, ijtimoiy holatlarga moslashadi."
    },
    {
      "id": 746,
      "input": "Teatrda \"poetika\" nima?",
      "output": "Poetika  bu teatr asarining til, uslub va tuzilishini o'rganadigan fan bo'lib, asarning ichki qoidalarini va yozilish tarzini belgilaydi."
    },
    {
      "id": 747,
      "input": "Rassomlikda \"kolaj\" qanday ishlatiladi?",
      "output": "Kolaj rassomlar tomonidan turli materiallarni birlashtirish orqali yangi tasvir yoki badiiy asar yaratish jarayonidir."
    },
    {
      "id": 748,
      "input": "Musiqada \"tertsiya\" nima?",
      "output": "Tertsiya  bu ikki tovush o'rtasidagi uchinchi interval, akkordlarning mustahkamlanishi va rivojlanishida muhim o'rin tutadi."
    },
    {
      "id": 749,
      "input": "Arxitektura san'ati va \"neo-gotika\" o'rtasidagi aloqalar qanday?",
      "output": "Neo-gotika arxitekturasida gotika uslubining qayta ishlanib, zamonaviy shakllar va elementlar bilan uyg'unlashgan versiyasi yaratilib, o'ziga xos ko'rinishga ega bo'ladi."
    },
    {
      "id": 750,
      "input": "San'atda \"tartibot\" qanday ishlatiladi?",
      "output": "Tartibot  bu kompozitsiyada elementlarning joylashuvi, ko'rinishi va balansining aniqlanishi, san'atkor tomonidan amalga oshirilgan tahlilni anglatadi."
    },
    {
      "id": 751,
      "input": "O'zbek madaniyatida \"mushtaraklik\" qanday tasvirlanadi?",
      "output": "Mushtaraklik O'zbek madaniyatida xalqni birlashtiruvchi, o'zaro yordam va hamjihatlikni ta'minlaydigan ahamiyatga ega bo'lgan qadriyatdir."
    },
    {
      "id": 752,
      "input": "Teatrda \"karnaval\" nima?",
      "output": "Karnaval  bu teatrda inson tabiatining turli ko'rinishlarini, hazil va ijtimoiy noxushliklarni aks ettiruvchi teatr yondashuvidir."
    },
    {
      "id": 753,
      "input": "Rassomlikda \"multiplikatsiya\" qanday ishlatiladi?",
      "output": "Multiplikatsiya  bu biror tasvirning ko'plab nusxalarini yaratish, o'zgarishlar kiritish va yangi badiiy yondashuvlar orqali amalga oshiriladi."
    },
    {
      "id": 754,
      "input": "Musiqada \"harmony\" nima?",
      "output": "Harmony  bu bir nechta tovushlarning birgalikda yangrayotgan va bir-biriga uyg'un bo'lgan muvozanatli holatidir."
    },
    {
      "id": 755,
      "input": "Arxitektura san'ati va \"organik shakllar\" o'rtasidagi aloqalar qanday?",
      "output": "Organik shakllar arxitekturasida tabiatdagi shakllar va strukturalar ilhom manbai sifatida ishlatiladi, ularning soddaligi va tabiiyligi ko'rsatiladi."
    },
    {
      "id": 756,
      "input": "Arxitektura san'ati va \"hibrid arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Hibrid arxitektura turli uslublarni birlashtirgan yangi dizaynlarni yaratish orqali zamonaviy va an'anaviy elementlarni uyg'unlashtiradi."
    },
    {
      "id": 757,
      "input": "Musiqada \"pentatonik\" gama nima?",
      "output": "Pentatonik gama  bu besh notali musiqiy gama, uni ko'plab xalq musiqalarida va bluesda uchratish mumkin."
    },
    {
      "id": 758,
      "input": "O'zbek san'ati va \"hikoya san'ati\" o'rtasidagi aloqalar qanday?",
      "output": "Hikoya san'ati O'zbek madaniyatida xalqning tarixiy va afsonaviy tasavvurlarini ifodalovchi va avloddan-avlodga o'tadigan an'anaviy shakldir."
    },
    {
      "id": 759,
      "input": "Teatrda \"komik muvozanat\" nima?",
      "output": "Komik muvozanat teatrda kulgili va og'ir vaziyatlarning uyg'unligini ta'minlab, tomoshabinga yorqin dramatik va kulgili tajriba taqdim etadi."
    },
    {
      "id": 760,
      "input": "Rassomlikda \"pop-art\" qanday ishlatiladi?",
      "output": "Pop-art  bu massoviy madaniyatni, reklama, komikslar va oddiy ob'ektlarni san'at shaklida aks ettirish orqali yangi estetikani yaratadi."
    },
    {
      "id": 761,
      "input": "Musiqada \"pianino\" nima?",
      "output": "Pianino  bu klavishlar yordamida tovush chiqaradigan, simli musiqa asbobidir, undan keng ko'lamdagi musiqa asarlarini ijro etish mumkin."
    },
    {
      "id": 762,
      "input": "Arxitektura san'ati va \"yangi klassizm\" o'rtasidagi aloqalar qanday?",
      "output": "Yangi klassizm arxitekturasi antik davrning soddaligi va ahamiyatini qayta tiklab, zamonaviy shakllar bilan uyg'unlashtiradi."
    },
    {
      "id": 763,
      "input": "San'atda \"totalitarizm\" qanday ishlatiladi?",
      "output": "Totalitarizm san'atda hokimiyatning mustahkamlanishi va jamiyatni nazorat qilish uchun ishlatilgan bezakli va propagandaviy uslublarni anglatadi."
    },
    {
      "id": 764,
      "input": "O'zbek musiqasida \"falsafa\" qanday aks etadi?",
      "output": "O'zbek musiqasida falsafa ichki tuyg'ular, hayotiy voqealar va ijtimoiy mavzularni anglatish uchun qo'llaniladi."
    },
    {
      "id": 765,
      "input": "Teatrda \"postdrama\" nima?",
      "output": "Postdrama  bu drama janrida yangi yondashuvlar va tuzilishlarni sinab ko'rish, an'anaviy dramaturgiyaga qarshi turuvchi uslubdir."
    },
    {
      "id": 766,
      "input": "Rassomlikda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizm rassomlar tomonidan ichki his-tuyg'ularni kuchli ranglar va deformatsiyalar orqali tasvirlashga qaratilgan uslubdir."
    },
    {
      "id": 767,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya  bu bir nechta mustaqil melodik chiziqlarning birga ijro etilishi, musiqada murakkab strukturani yaratadi."
    },
    {
      "id": 768,
      "input": "Arxitektura san'ati va \"futurizm\" o'rtasidagi aloqalar qanday?",
      "output": "Futurizm arxitekturasida tezlik, dinamik harakat va texnologiya inshootlarga o'zgacha, kelajakni tasvirlovchi shakllarda yansiydi."
    },
    {
      "id": 769,
      "input": "San'atda \"allegoriya\" qanday ishlatiladi?",
      "output": "Allegoriya san'atda ma'naviy yoki ijtimoiy mavzularni tasvirlash uchun ramziy va tasavvuriy tasvirlar ishlatiladi."
    },
    {
      "id": 770,
      "input": "O'zbek madaniyatida \"o'zbekcha musiqiy uslub\" qanday shakllanadi?",
      "output": "O'zbekcha musiqiy uslub xalqning turmush tarzidan, urf-odatlaridan, qadriyatlaridan va musiqa tarixidan kelib chiqadi."
    },
    {
      "id": 771,
      "input": "Teatrda \"sillogizm\" nima?",
      "output": "Sillogizm  bu mantiqiy xulosalar chiqarishga asoslangan teatrlashuv, unda aniq qonunlar va tizimlar izlanadi."
    },
    {
      "id": 772,
      "input": "Rassomlikda \"surrealist portret\" qanday ishlatiladi?",
      "output": "Surrealist portretlarda inson yoki ob'ektlar g'ayrioddiy va noan'anaviy tarzda tasvirlanadi, bu ong osti va tushlarni aks ettiradi."
    },
    {
      "id": 773,
      "input": "Musiqada \"ritmik struktura\" nima?",
      "output": "Ritmik struktura musiqa asaridagi taqsimot, ya'ni urg'ular va intervalar orasidagi masofaning tartibidir."
    },
    {
      "id": 774,
      "input": "Arxitektura san'ati va \"konstruktsionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Konstruktsionizm arxitekturasida inshootlar va strukturalar minimal va funksional bo'lib, texnik va muhandislik yondashuvlariga asoslanadi."
    },
    {
      "id": 775,
      "input": "San'atda \"estetik tajriba\" qanday ishlatiladi?",
      "output": "Estetik tajriba san'atda tomoshabinlarga hissiy va ko'rish sezgilariga ta'sir qiladigan taassurotlar yaratishni anglatadi."
    },
    {
      "id": 776,
      "input": "O'zbek musiqasida \"maqom san'ati\" qanday rivojlanadi?",
      "output": "Maqom san'ati O'zbek musiqa tizimining markaziy qismi bo'lib, unda ko'plab turli melodiyalar va musiqiy shakllar o'zaro uyg'unlashtiriladi."
    },
    {
      "id": 777,
      "input": "Teatrda \"absurdist dramaturgiya\" nima?",
      "output": "Absurdist dramaturgiya inson hayotining ma'nosizligini va mantiqsizligini ko'rsatadigan teatr janridir, unda ko'plab paradoksal vaziyatlar mavjud."
    },
    {
      "id": 778,
      "input": "Rassomlikda \"geometrik abstraktsionizm\" qanday ishlatiladi?",
      "output": "Geometrik abstraktsionizmda rassomlar shakllar va chiziqlar orqali tasvirni soddalashtirib, tasavvurlarni aks ettiradilar."
    },
    {
      "id": 779,
      "input": "Musiqada \"blues\" nima?",
      "output": "Blues  bu amerikalik afro-amerikaliklarning musiqiy janri bo'lib, u ko'pincha qayg'u, noxushlik va hissiyotlarni ifodalaydi."
    },
    {
      "id": 780,
      "input": "Arxitektura san'ati va \"moderna\" o'rtasidagi aloqalar qanday?",
      "output": "Moderna arxitekturasida funksionallik va oddiylikka urg'u beriladi, an'anaviy uslublar va bezaklardan voz kechiladi."
    },
    {
      "id": 781,
      "input": "San'atda \"ikonografiya\" qanday ishlatiladi?",
      "output": "Ikonografiya san'atda diniy yoki tarixiy shaxslarning, voqealar yoki ramzlarning tasvirlanishini o'rganadi."
    },
    {
      "id": 782,
      "input": "O'zbek madaniyatida \"xalqa san'ati\" qanday rivojlanadi?",
      "output": "Xalqa san'ati O'zbek madaniyatida xalqning ijtimoiy va ma'naviy hayotini tasvirlashga qaratilgan an'anaviy san'at shaklini anglatadi."
    },
    {
      "id": 783,
      "input": "Teatrda \"karnaval estetika\" nima?",
      "output": "Karnaval estetika teatrda iroda va kutilmagan voqealarni birlashtirib, tomoshabinlarni o'ziga tortadigan kulgili va dramaviy elementlarni yaratadi."
    },
    {
      "id": 784,
      "input": "Rassomlikda \"installyatsiya\" qanday ishlatiladi?",
      "output": "Installyatsiya  bu rassomlar tomonidan turli elementlar yoki obyektlar birlashtirilib, muayyan makon yoki hissiy tajriba yaratish jarayonidir."
    },
    {
      "id": 785,
      "input": "Musiqada \"sonata\" nima?",
      "output": "Sonata  bu musiqa shakli bo'lib, asosan uch qismdan iborat bo'lib, uning har biri melodik va ritmik ravonlikni ifodalaydi."
    },
    {
      "id": 786,
      "input": "Arxitektura san'ati va \"ekspresionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Ekspresionizm arxitekturasida binolar hissiyotlar va ichki tajribalarni aks ettiradi, noaniq shakllar va deformatsiyalar orqali yaratiladi."
    },
    {
      "id": 787,
      "input": "Arxitektura san'ati va \"minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalizm arxitekturasi oddiylik va funksionallikka urg'u beradi, ko'plab bezaklardan voz kechib, soddalashgan shakllarga yo'naltiriladi."
    },
    {
      "id": 788,
      "input": "Musiqada \"melodiya\" nima?",
      "output": "Melodiya  bu tovushlar ketma-ketligi bo'lib, biror tema yoki g'oyani ifodalaydigan musiqiy izlanishdir."
    },
    {
      "id": 789,
      "input": "O'zbek san'ati va \"badiiy ta'lim\" o'rtasidagi aloqalar qanday?",
      "output": "Badiiy ta'lim O'zbek san'atida talabalarga rang, shakl, kompozitsiya va texnikaning asosiy tushunchalarini o'rgatadi."
    },
    {
      "id": 790,
      "input": "Teatrda \"dialog\" qanday ishlatiladi?",
      "output": "Dialog teatrda aktyorlar o'rtasidagi so'zlashuv bo'lib, asar mazmunini rivojlantirish va tomoshabinga yetkazish uchun ishlatiladi."
    },
    {
      "id": 791,
      "input": "Rassomlikda \"abstrakt ekspressionizm\" qanday ishlatiladi?",
      "output": "Abstrakt ekspressionizmda rassomlar tasvirda figuralarni tasvirlash o'rniga, ichki his-tuyg'ularni ochiq va g'ayrioddiy shakllarda ifodalaydilar."
    },
    {
      "id": 792,
      "input": "Musiqada \"sillabik ritm\" nima?",
      "output": "Sillabik ritm musiqa va she'rda har bir bo'limning aniq bir silabaga mos keladigan tartibda joylashuvini anglatadi."
    },
    {
      "id": 793,
      "input": "Arxitektura san'ati va \"dekonstructivizm\" o'rtasidagi aloqalar qanday?",
      "output": "Dekonstructivizm arxitekturasi an'anaviy shakllarni buzib, asimmetrik va murakkab tuzilmalar yaratish orqali inshootlarga yangi yondashuvni olib keladi."
    },
    {
      "id": 794,
      "input": "San'atda \"fenomenologiya\" qanday ishlatiladi?",
      "output": "Fenomenologiya san'atda tomoshabinlarning badiiy asar bilan hissiy va idrok jihatdan aloqasini o'rganadi."
    },
    {
      "id": 795,
      "input": "O'zbek musiqasida \"makom\" nima?",
      "output": "Makom  bu O'zbek musiqa tizimida shakllangan va turli melodiyalarni ifodalovchi, har bir turi o'ziga xos tuzilishga ega bo'lgan tizimdir."
    },
    {
      "id": 796,
      "input": "Teatrda \"muzikal\" nima?",
      "output": "Muzikal  bu musiqiy va dramaviy elementlar birlashgan teatr asari bo'lib, qo'shiqlar va raqslar orqali voqeani rivojlantiradi."
    },
    {
      "id": 797,
      "input": "Rassomlikda \"pikturalizm\" nima?",
      "output": "Pikturalizm rassomning ishlash uslubini anglatib, rasmning o'ziga xos texnik va vizual xususiyatlarini ta'kidlaydi."
    },
    {
      "id": 798,
      "input": "Musiqada \"dyatonik\" gama nima?",
      "output": "Dyatonik gama  bu musiqiy tizimda, odatda, yetti notali gama, uning har bir notasi o'zining alohida roli va harakati bilan ajralib turadi."
    },
    {
      "id": 799,
      "input": "Arxitektura san'ati va \"sintetizm\" o'rtasidagi aloqalar qanday?",
      "output": "Sintetizm arxitekturasida an'anaviy va zamonaviy uslublar birlashtirilib, yangi va yangicha shakllar yaratiladi."
    },
    {
      "id": 800,
      "input": "San'atda \"simmetriya\" qanday ishlatiladi?",
      "output": "Simmetriya san'atda shakllar va elementlarning teng yoki mos keladigan qismlarini joylashtirish orqali muvozanat va uyg'unlikni yaratadi."
    },
    {
      "id": 801,
      "input": "O'zbek madaniyatida \"naqqoshlik\" qanday rivojlanadi?",
      "output": "Naqqoshlik O'zbek madaniyatida an'anaviy naqsh va ornamentlarni yaratish orqali badiiy va estetik an'analarni davom ettiradi."
    },
    {
      "id": 802,
      "input": "Teatrda \"monolog\" nima?",
      "output": "Monolog  bu bir aktor tomonidan ijro etiladigan uzun nutq bo'lib, qahramonning ichki fikrlarini yoki hissiyotlarini aks ettiradi."
    },
    {
      "id": 803,
      "input": "Rassomlikda \"fotorealizm\" qanday ishlatiladi?",
      "output": "Fotorealizm rassomlikda haqiqatni aynan foto tasvirga o'xshash tarzda aniq va detallarga e'tibor berib yaratishga intiladi."
    },
    {
      "id": 804,
      "input": "Musiqada \"tonallik\" nima?",
      "output": "Tonallik  bu musiqa asarining asosiy tonini belgilovchi tizim bo'lib, melodiyalar va akkordlar bu tonallikka moslashadi."
    },
    {
      "id": 805,
      "input": "Arxitektura san'ati va \"yaponiya arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Yapon arxitekturasi tabiiy materiallar va minimalizmga asoslanib, tabiatchilik va estetikaga katta ahamiyat beradi."
    },
    {
      "id": 806,
      "input": "San'atda \"mashinism\" qanday ishlatiladi?",
      "output": "Mashinism san'atda mexanik va texnologik elementlarni estetika bilan uyg'unlashtirib, yangicha shakllar yaratishni anglatadi."
    },
    {
      "id": 807,
      "input": "O'zbek musiqasida \"muqam\" nima?",
      "output": "Muqam O'zbek musiqa tizimining markaziy qismi bo'lib, uni asosan an'anaviy qo'shiqlar, dastgohlar va turli shakllar tashkil etadi."
    },
    {
      "id": 808,
      "input": "Teatrda \"abstrakt drama\" nima?",
      "output": "Abstrakt drama voqealarning ma'nosiz yoki fantastik shakllarda tasvirlanishi, shuningdek, individual his-tuyg'ularni ko'rsatishga qaratilgan janrdir."
    },
    {
      "id": 809,
      "input": "Rassomlikda \"luminizm\" nima?",
      "output": "Luminizm rassomlar tomonidan yorug'lik va soyalar o'yini orqali tafsilotlarni ajratib ko'rsatish va atmosfera yaratish san'ati."
    },
    {
      "id": 810,
      "input": "Musiqada \"arxetip\" nima?",
      "output": "Arxetip musiqada an'anaviy va universal motivlarni ifodalaydi, ular ma'lum bir madaniyatda keng tarqalgan va tushuniladigan elementlardir."
    },
    {
      "id": 811,
      "input": "Arxitektura san'ati va \"urbanizm\" o'rtasidagi aloqalar qanday?",
      "output": "Urbanizm shaharlar va urbanizatsiyalashgan hududlar arxitekturasining samarali va tartibli rivojlanishiga yordam beradi."
    },
    {
      "id": 812,
      "input": "San'atda \"ekspresyonist portret\" qanday ishlatiladi?",
      "output": "Ekspresyonist portret insonning ichki dunyosini, hissiyotlarini va ruhiyatini ko'rsatishga harakat qiladi, ko'pincha deformatsiya va ranglar orqali."
    },
    {
      "id": 813,
      "input": "O'zbek madaniyatida \"xalq musiqasi\" qanday shakllanadi?",
      "output": "Xalq musiqasi O'zbek madaniyatida xalqning turmush tarzini, qadriyatlarini va tarixini ifodalovchi musiqiy shakllar orqali rivojlanadi."
    },
    {
      "id": 814,
      "input": "Teatrda \"absurdist sahna\" nima?",
      "output": "Absurdist sahna voqealar va xarakterlar o'rtasidagi mantiqsizlikni, shuningdek, inson hayotining ma'nosizligini aks ettiradi."
    },
    {
      "id": 815,
      "input": "Rassomlikda \"pastel\" qanday ishlatiladi?",
      "output": "Pastel  bu rangli tayyor pigmentlardan foydalangan holda, nozik va yumshoq rasm chizish texnikasidir, uning texnikasi osonlik bilan aralashtiriladi."
    },
    {
      "id": 816,
      "input": "Musiqada \"lag\" nima?",
      "output": "Lag  bu musiqadagi biror elementning vaqtni kechiktirish bilan ijro etilishi, masalan, ritmik kechikishlar yoki harakatdagi tormozlar."
    },
    {
      "id": 817,
      "input": "Arxitektura san'ati va \"postmodernizm\" o'rtasidagi aloqalar qanday?",
      "output": "Postmodernizm arxitekturasi turli uslublar va tarixiy shakllarni birlashtirgan, o'ziga xos va kutilmagan dizaynlarni yaratadi."
    },
    {
      "id": 818,
      "input": "Musiqada \"atonalizm\" nima?",
      "output": "Atonalizm musiqada an'anaviy tonallikdan voz kechish va har bir notaning teng huquqli bo'lishini anglatadi."
    },
    {
      "id": 819,
      "input": "O'zbek san'ati va \"naxsh\" o'rtasidagi aloqalar qanday?",
      "output": "Naxsh  bu O'zbek san'atining bezakli va geometrik tasvirlarni yaratishda ishlatiladigan shakl va naqshlar to'plamidir."
    },
    {
      "id": 820,
      "input": "Teatrda \"repertuar teatr\" nima?",
      "output": "Repertuar teatrida doimiy ravishda yangi asarlar va spektakllar sahnalashtiriladi, bu tomoshabinlarga turli janrlarni taqdim etadi."
    },
    {
      "id": 821,
      "input": "Rassomlikda \"fotografik realizm\" qanday ishlatiladi?",
      "output": "Fotografik realizm rassomlikda fotoga o'xshash darajada aniq va detallarni ko'rsatishga qaratilgan uslubdir."
    },
    {
      "id": 822,
      "input": "Musiqada \"garmoniya\" nima?",
      "output": "Garmoniya musiqada bir nechta tovushlarning birgalikda uyg'unligi va tartibidir, bu melodiyani qo'llab-quvvatlaydi."
    },
    {
      "id": 823,
      "input": "Arxitektura san'ati va \"neo-klasizm\" o'rtasidagi aloqalar qanday?",
      "output": "Neo-klasizm arxitekturasi antik yunon va rim uslublarini yangilab, simmetriya, ideal shakllar va proporsiyalarga urg'u beradi."
    },
    {
      "id": 824,
      "input": "San'atda \"interaktiv san'at\" qanday ishlatiladi?",
      "output": "Interaktiv san'at tomoshabinlarni faol ishtirok etishga jalb qilib, san'at asarini yaratuvchi va qabul qiluvchi orasidagi chegaralarni yo'qotadi."
    },
    {
      "id": 825,
      "input": "O'zbek musiqasida \"shashmaqom\" nima?",
      "output": "Shashmaqom  O'zbek klassik musiqasining asosiy tizimi bo'lib, unda oltita asosiy maqom va ularning variantlari mavjud."
    },
    {
      "id": 826,
      "input": "Teatrda \"sahna dizayni\" nima?",
      "output": "Sahna dizayni  teatr asarining vizual jihatlarini yaratishga qaratilgan jarayon bo'lib, unda dekoratsiyalar, chiroqlar va kostyumlar ishlatiladi."
    },
    {
      "id": 827,
      "input": "Rassomlikda \"pointilizm\" qanday ishlatiladi?",
      "output": "Pointilizm  bu rangli nuqtalar yordamida tasvir yaratish texnikasi bo'lib, unda nuqtalar birlashtirilganda yangi ranglar va shakllar hosil bo'ladi."
    },
    {
      "id": 828,
      "input": "Musiqada \"orxestr\" nima?",
      "output": "Orxestr  bu turli xil musiqiy asboblarni birlashtirgan musiqiy ansambl bo'lib, asosan simfonik asarlar ijro etiladi."
    },
    {
      "id": 829,
      "input": "Arxitektura san'ati va \"organik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Organik arxitektura tabiat va atrof-muhit bilan uyg'un ravishda ishlab chiqilgan inshootlarni anglatadi, ular tabiiy materiallardan foydalanadi."
    },
    {
      "id": 830,
      "input": "San'atda \"romantizm\" qanday ishlatiladi?",
      "output": "Romantizm san'atda hissiyot, shaxsiy tajriba va tabiatning go'zalligini ta'kidlash orqali, inson ruhiyatining chuqurligini ifodalashni maqsad qiladi."
    },
    {
      "id": 831,
      "input": "O'zbek madaniyatida \"quvnoq musiqa\" qanday aks etadi?",
      "output": "Quvnoq musiqa O'zbek madaniyatida insonning baxti, quvonchi va ijtimoiy bayramlarini aks ettiruvchi jozibali va ritmik qo'shiqlarga asoslanadi."
    },
    {
      "id": 832,
      "input": "Teatrda \"improvizatsiya\" nima?",
      "output": "Improvizatsiya  bu teatrda reja bo'yicha bo'lmagan, aktyorlarning ongsiz ravishda yaratgan va sahnaga chiqarilgan asaridir."
    },
    {
      "id": 833,
      "input": "Rassomlikda \"mural\" qanday ishlatiladi?",
      "output": "Mural  bu devorlarga chizilgan katta o'lchamdagi tasvir bo'lib, u ko'pincha jamoat joylarida ishlatiladi."
    },
    {
      "id": 834,
      "input": "Musiqada \"duet\" nima?",
      "output": "Duet  bu ikkita musiqachining birga ijro etgan asaridir, unda har ikki musiqachi o'z rollarini birgalikda bajaradi."
    },
    {
      "id": 835,
      "input": "Arxitektura san'ati va \"yashil arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Yashil arxitektura atrof-muhitni himoya qilish va energiya tejamkorligi uchun ekologik toza materiallar va texnologiyalarni ishlatadi."
    },
    {
      "id": 836,
      "input": "San'atda \"konstruktivizm\" qanday ishlatiladi?",
      "output": "Konstruktivizm san'atda funksionallikni va texnologiyani san'at shakllarida ifodalashga qaratilgan harakat bo'lib, u minimalizm va geometriyani ta'kidlaydi."
    },
    {
      "id": 837,
      "input": "O'zbek musiqasida \"dastgoh\" nima?",
      "output": "Dastgoh O'zbek musiqasida bir nechta musiqa asarlarini o'z ichiga olgan va o'ziga xos tuzilishga ega bo'lgan shakldir."
    },
    {
      "id": 838,
      "input": "Teatrda \"klassik drama\" nima?",
      "output": "Klassik drama  bu an'anaviy va qat'iy struktura bo'yicha yaratilgan asarlardir, unda xarakterlar, voqealar va qahramonning rivojlanishi belgilangan."
    },
    {
      "id": 839,
      "input": "Rassomlikda \"futurizm\" qanday ishlatiladi?",
      "output": "Futurizm rassomlikda harakat, tezlik va texnologiyaning inqilobiy ko'rinishlarini aks ettiradi, ko'pincha geometrik shakllar va dinamik elementlar bilan."
    },
    {
      "id": 840,
      "input": "Musiqada \"ritmik poliritm\" nima?",
      "output": "Poliritm  bu musiqada bir nechta ritmik strukturani birga qo'llash, bu turli guruhlar o'rtasidagi ritmik uyg'unlikni yaratadi."
    },
    {
      "id": 841,
      "input": "Arxitektura san'ati va \"konstruktivizm\" o'rtasidagi aloqalar qanday?",
      "output": "Konstruktivizm arxitekturasida texnikani va funksionalizmni o'zida mujassamlashtirgan oddiy shakllar va strukturalar ishlatiladi."
    },
    {
      "id": 842,
      "input": "San'atda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizm san'atda tushlar, ong osti va reallikning o'zgarishini tasvirlashga qaratilgan, g'ayrioddiy va tasavvurga asoslangan obrazlar yaratiladi."
    },
    {
      "id": 843,
      "input": "O'zbek madaniyatida \"xalq qo'shiqlari\" qanday shakllanadi?",
      "output": "Xalq qo'shiqlari O'zbek xalqining turmush tarzi, urf-odatlari va tarixiy voqealarini ifodalovchi, oddiy va yodda qoladigan qo'shiqlardan iborat."
    },
    {
      "id": 844,
      "input": "Teatrda \"farqli sa'y-harakat\" nima?",
      "output": "Farqli sa'y-harakat  bu teatrda aktyorning nutqi yoki harakati tomoshabinga kutilmagan yoki ijodiy ta'sir ko'rsatish uchun qo'llaniladi."
    },
    {
      "id": 845,
      "input": "Rassomlikda \"minimalizm\" qanday ishlatiladi?",
      "output": "Minimalizm rassomlikda shakllarni va ranglarni soddalashtirish, asarlarni keraksiz tafsilotlardan ozod qilish orqali minimalistik estetikani yaratadi."
    },
    {
      "id": 846,
      "input": "Musiqada \"subton\" nima?",
      "output": "Subton  bu ovozning pastki chastotasi bo'lib, u odatda musiqaning pastki registrlarida yoki qo'shiqda boshida eshitiladi."
    },
    {
      "id": 847,
      "input": "Arxitektura san'ati va \"integratsiya arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Integratsiya arxitekturasi atrof-muhit, jamiyat va texnologiyalarni birlashtirish orqali inshootlarning samaradorligini va estetik sifatini oshiradi."
    },
    {
      "id": 848,
      "input": "San'atda \"kalligrfiya\" qanday ishlatiladi?",
      "output": "Kalligrfiya  bu go'zal yozuv san'ati bo'lib, harflar va shakllarni estetik tarzda tasvirlash orqali vizual ifodalanadi."
    },
    {
      "id": 849,
      "input": "Arxitektura san'ati va \"biomimetrika\" o'rtasidagi aloqalar qanday?",
      "output": "Biomimetrika arxitekturasida tabiatdagi shakllar va strukturalardan ilhomlanib, barqaror va energiya samarali inshootlar yaratiladi."
    },
    {
      "id": 850,
      "input": "Musiqada \"konsonans\" nima?",
      "output": "Konsonans  bu ikki yoki undan ortiq tovushlarning birgalikda ijro etilishi, ularning bir-biriga uyg'un va yoqimli eshitilishidir."
    },
    {
      "id": 851,
      "input": "O'zbek san'ati va \"samarqand naqshlari\" o'rtasidagi aloqalar qanday?",
      "output": "Samarqand naqshlari O'zbek san'atida o'zining murakkab va geometriyaviy naqshlari bilan mashhur bo'lib, madaniy merosni ifodalaydi."
    },
    {
      "id": 852,
      "input": "Teatrda \"eksperimental drama\" nima?",
      "output": "Eksperimental drama  bu an'anaviy teatr shakllaridan chetlashgan va yangi, o'ziga xos dramatik uslublarni yaratishga intilgan asar turi."
    },
    {
      "id": 853,
      "input": "Rassomlikda \"surrealist portret\" qanday ishlatiladi?",
      "output": "Surrealist portret insonning ichki olamini va tushlarini ifodalashda, ba'zan g'ayrioddiy va fantastik elementlar yordamida tasvirlanadi."
    },
    {
      "id": 854,
      "input": "Musiqada \"fugue\" nima?",
      "output": "Fugue  bu musiqada bir xil tema bir necha marta takrorlanib, turli tovush balandliklarida o'ynaladigan polyfonik shakldir."
    },
    {
      "id": 855,
      "input": "Arxitektura san'ati va \"yangi barokko\" o'rtasidagi aloqalar qanday?",
      "output": "Yangi barokko arxitekturasi noan'anaviy shakllar va bezaklarni zamonaviy materiallar bilan uyg'unlashtirgan uslubdir."
    },
    {
      "id": 856,
      "input": "San'atda \"ekspressionist tasvir\" qanday ishlatiladi?",
      "output": "Ekspressionist tasvir ichki his-tuyg'ularni, harakatlarni va shaxsiy hissiyotlarni kuchli va bezovta shakllar orqali ifodalaydi."
    },
    {
      "id": 857,
      "input": "O'zbek musiqasida \"balet\" qanday rivojlanadi?",
      "output": "O'zbek baleti klassik va zamonaviy raqs shakllarini birlashtirib, turli madaniy elementlarni o'z ichiga olgan yangi uslubni shakllantiradi."
    },
    {
      "id": 858,
      "input": "Teatrda \"monodrama\" nima?",
      "output": "Monodrama  bu faqat bitta aktyorning o'z monologi va harakatlari orqali rivojlanadigan drama janri."
    },
    {
      "id": 859,
      "input": "Rassomlikda \"mozaika\" qanday ishlatiladi?",
      "output": "Mozaika  bu kichik rangli toshlar yoki shisha bo'laklaridan iborat san'at asari bo'lib, ular birlashtirilib katta kompozitsiya yaratadi."
    },
    {
      "id": 860,
      "input": "Musiqada \"pentatonik\" gama nima?",
      "output": "Pentatonik gama  bu beshta nota o'z ichiga olgan musiqiy gama bo'lib, ko'plab xalq musiqalari va bluesda keng qo'llaniladi."
    },
    {
      "id": 861,
      "input": "Arxitektura san'ati va \"yashil inshootlar\" o'rtasidagi aloqalar qanday?",
      "output": "Yashil inshootlar tabiiy resurslardan tejamkor foydalanish va ekologik jihatdan barqaror arxitektura yechimlarini yaratishni maqsad qiladi."
    },
    {
      "id": 862,
      "input": "San'atda \"performans\" qanday ishlatiladi?",
      "output": "Performans san'ati tomoshabinlar bilan bevosita aloqada bo'lib, ijrochining harakati va ifodalarini real vaqt rejimida ko'rsatadi."
    },
    {
      "id": 863,
      "input": "O'zbek madaniyatida \"xalq raqsi\" qanday ifodalanadi?",
      "output": "Xalq raqsi O'zbek madaniyatida xalqning turmush tarzini va qadriyatlarini, ayniqsa marosimlar va bayramlarni tasvirlaydi."
    },
    {
      "id": 864,
      "input": "Teatrda \"absurd drama\" nima?",
      "output": "Absurd drama inson hayotining ma'nosizligini va mantiqsizlikni aks ettiradigan teatr janridir."
    },
    {
      "id": 865,
      "input": "Rassomlikda \"futuristik skulptura\" qanday ishlatiladi?",
      "output": "Futuristik skulptura texnologik yangiliklar, harakat va tezlikni ifodalashda ishlatiladigan yangi shakllar va strukturalarni yaratadi."
    },
    {
      "id": 866,
      "input": "Musiqada \"polifoniya\" nima?",
      "output": "Polifoniya  bu bir nechta mustaqil musiqiy liniyalar bir vaqtda ijro etiladigan uslubdir, unda har bir melodiya o'z yo'lini tutadi."
    },
    {
      "id": 867,
      "input": "Arxitektura san'ati va \"ekspresionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Ekspresionizm arxitekturasi biror shaklni yoki inshootni ma'lum bir his-tuyg'uni ifodalash uchun ishlatadi va ko'pincha noan'anaviy shakllardan foydalanadi."
    },
    {
      "id": 868,
      "input": "San'atda \"minimalist ramka\" qanday ishlatiladi?",
      "output": "Minimalist ramka san'atda soddalashgan va ortiqcha tafsilotlardan voz kechgan uslubda ishlatiladi, bu tasvirni ajratib ko'rsatishga yordam beradi."
    },
    {
      "id": 869,
      "input": "O'zbek musiqasida \"turkman maqomlari\" qanday ajralib turadi?",
      "output": "Turkman maqomlari o'zining ritmik tuzilishi va an'anaviy musiqiy elementlari bilan O'zbek musiqasidan ajralib turadi."
    },
    {
      "id": 870,
      "input": "Teatrda \"klounada\" nima?",
      "output": "Klounada teatr janridir, unda komik va kulgili sahnalar yordamida tomoshabinga hayotning murakkab tomonlari oddiy va kutilmagan tarzda taqdim etiladi."
    },
    {
      "id": 871,
      "input": "Rassomlikda \"transavantgarde\" nima?",
      "output": "Transavantgarde  bu san'atta yangi va eksperimentallikni aks ettiruvchi, an'anaviy uslublardan chiqqan va o'ziga xos eksperimental yondashuvdir."
    },
    {
      "id": 872,
      "input": "Musiqada \"tremolo\" nima?",
      "output": "Tremolo  bu musiqada notaning tez-tez takrorlanishi yoki tovushning doimiy ravishda o'zgarib turadigan kuchi bo'lib, o'zgacha atmosfera yaratadi."
    },
    {
      "id": 873,
      "input": "Arxitektura san'ati va \"stimulativ arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Stimulativ arxitektura odamlar hissiyotlarini va psixologik holatini o'zgartiradigan joylar yaratish uchun yondashuvni anglatadi."
    },
    {
      "id": 874,
      "input": "San'atda \"konstruktivistik kompozitsiya\" qanday ishlatiladi?",
      "output": "Konstruktivistik kompozitsiya shakllarni va simmetriyani jiddiy ravishda inobatga olib, ob'ektiv va tizimli ko'rinishda yaratiladi."
    },
    {
      "id": 875,
      "input": "O'zbek madaniyatida \"badiiy adabiyot\" qanday rivojlanadi?",
      "output": "Badiiy adabiyot O'zbek madaniyatida asrlar davomida rivojlanib, xalqning tarixini, urf-odatlarini va qadriyatlarini aks ettirgan she'rlar va romanlar bilan boyigan."
    },
    {
      "id": 876,
      "input": "Teatrda \"germaniya ekspresionizmi\" qanday ta'sir ko'rsatgan?",
      "output": "Germaniya ekspresionizmi teatrda dramatik xarakterning ichki dunyosini, insonning qayg'ularini va g'ayrioddiy hissiyotlarini aks ettirgan."
    },
    {
      "id": 877,
      "input": "Rassomlikda \"optik illyuziya\" qanday ishlatiladi?",
      "output": "Optik illyuziya rassomlikda rang va shakllarning aldanishiga asoslanib, tomoshabinning ko'zlarini chalg'itish va turli his-tuyg'ularni uyg'otish uchun ishlatiladi."
    },
    {
      "id": 878,
      "input": "Musiqada \"raga\" nima?",
      "output": "Raga  bu Hind musiqa tizimida melodik tuzilma bo'lib, o'zining ranglari va ruhi bilan muayyan vaqt va kayfiyatni ifodalashga qaratilgan."
    },
    {
      "id": 879,
      "input": "Arxitektura san'ati va \"intellektual arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Intellektual arxitektura dizaynning har bir jihatida fikr yuritilgan va aqliy yondashuvga asoslangan, shaharlar va inshootlarni boshqarishda samarali usullarni yaratadi."
    },
    {
      "id": 880,
      "input": "San'atda \"integratsiya dizayni\" qanday ishlatiladi?",
      "output": "Integratsiya dizayni san'ati turli texnologiyalarni va madaniyatlarni birlashtirish orqali, jamoat joylarida estetik va funktsional uyg'unlikni yaratadi."
    },
    {
      "id": 881,
      "input": "Arxitektura san'ati va \"uglerod arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Uglerod arxitekturasi zamonaviy arxitektura elementlarida yuqori sifatli, engil va ekologik toza materiallardan foydalanishni anglatadi."
    },
    {
      "id": 882,
      "input": "Musiqada \"oktav\" nima?",
      "output": "Oktav  bu musiqada ikki tovushning balandligi o'rtasidagi farqni ifodalovchi birlik bo'lib, u ikki notaning o'rtasidagi intervalni anglatadi."
    },
    {
      "id": 883,
      "input": "O'zbek san'ati va \"somonli naqshlar\" o'rtasidagi aloqalar qanday?",
      "output": "Somonli naqshlar O'zbek san'atining bezakli va geometrik uslubini tashkil etadi, asosan to'qimachilikda qo'llaniladi."
    },
    {
      "id": 884,
      "input": "Teatrda \"epik teatr\" nima?",
      "output": "Epik teatr tomoshabinning tafakkurini rivojlantiruvchi va uni real hayotning qiyinchiliklari haqida o'ylashga undovchi teatr janridir."
    },
    {
      "id": 885,
      "input": "Rassomlikda \"impressionizm\" qanday ishlatiladi?",
      "output": "Impressionizm rassomlikda yorug'lik va ranglarning vaqtincha ta'sirini ifodalashga qaratilgan, aniq va noaniq shakllar orqali tasvirlanadi."
    },
    {
      "id": 886,
      "input": "Musiqada \"melodiya\" nima?",
      "output": "Melodiya  bu musiqaning asosiy mavzusini tashkil etadigan tovushlar ketma-ketligi bo'lib, ular tovushlarning balandligi, ritmi va tembrini o'z ichiga oladi."
    },
    {
      "id": 887,
      "input": "Arxitektura san'ati va \"dekontruktsionizm\" o'rtasidagi aloqalar qanday?",
      "output": "Dekonstruktsionizm arxitekturasida shakllar va strukturalar yadrodan chiqarilgan noaniqlik va asimmetriya orqali tasvirlanadi."
    },
    {
      "id": 888,
      "input": "San'atda \"grafika dizayni\" qanday ishlatiladi?",
      "output": "Grafika dizayni san'at va texnologiyaning integratsiyasini ta'minlaydi, vizual ifodaning turli shakllarini yaratishda kompyuter texnologiyalarini ishlatadi."
    },
    {
      "id": 889,
      "input": "O'zbek musiqasida \"makom\" nima?",
      "output": "Makom  bu O'zbek musiqasining asosiy tizimi bo'lib, unda ma'lum bir musiqiy tuzilma va ritmik namunalar mavjud."
    },
    {
      "id": 890,
      "input": "Teatrda \"absurd komediya\" nima?",
      "output": "Absurd komediya odam hayotining ma'nosizligini kulgili va kutilmagan tarzda aks ettiradi, sahnada g'ayrioddiy va mos kelmaydigan voqealar yuz beradi."
    },
    {
      "id": 891,
      "input": "Rassomlikda \"kubizm\" qanday ishlatiladi?",
      "output": "Kubizm rassomlikda ob'ektlar va shakllar geometriyasini oddiy shakllarga ajratib, ko'p burchakli va o'zaro bog'langan ko'rinishda tasvirlaydi."
    },
    {
      "id": 892,
      "input": "Musiqada \"stretto\" nima?",
      "output": "Stretto  bu fugue asarida mavzuning tezroq takrorlanishi, unda tema intervalini qisqartirish orqali ta'sir kuchaytiriladi."
    },
    {
      "id": 893,
      "input": "Arxitektura san'ati va \"ekspressiv minimalizm\" o'rtasidagi aloqalar qanday?",
      "output": "Ekspressiv minimalizm arxitekturasida soddalashgan shakllar va minimal tafsilotlar orqali chuqur hissiy ta'sir yaratishga intiladi."
    },
    {
      "id": 894,
      "input": "San'atda \"digital art\" qanday ishlatiladi?",
      "output": "Digital art kompyuter texnologiyalaridan foydalanib yaratilgan san'atdir, u tasvirlar, grafikalar yoki videolar orqali tasvirlanadi."
    },
    {
      "id": 895,
      "input": "O'zbek madaniyatida \"xalq musiqasi\" qanday aks etadi?",
      "output": "Xalq musiqasi O'zbek madaniyatining eng muhim qismi bo'lib, xalqning kundalik hayoti, marosimlari va tarixiy voqealarini qo'shiqlar orqali ifodalaydi."
    },
    {
      "id": 896,
      "input": "Teatrda \"ritual drama\" nima?",
      "output": "Ritual drama odamlarning diniy yoki madaniy marosimlar orqali tushuncha va qadriyatlarni aks ettirgan, o'ziga xos sahnalar bilan ajralib turadi."
    },
    {
      "id": 897,
      "input": "Rassomlikda \"lirik abstraktsionizm\" qanday ishlatiladi?",
      "output": "Lirik abstraktsionizm ranglar va shakllarni his-tuyg'ularni ifodalash uchun ishlatadi, aniq tasvirlardan voz kechib, toza tasavvurlarni yaratadi."
    },
    {
      "id": 898,
      "input": "Musiqada \"suite\" nima?",
      "output": "Suite  bu bir nechta musiqiy qismlardan iborat asar bo'lib, har bir qism o'ziga xos mavzu va xarakterga ega."
    },
    {
      "id": 899,
      "input": "Arxitektura san'ati va \"tehnologik arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Texnologik arxitektura zamonaviy materiallar va yangi texnologiyalarni ishlatib, inshootlarni funksional va estetik jihatdan samarali qiladi."
    },
    {
      "id": 900,
      "input": "San'atda \"konseptualizm\" qanday ishlatiladi?",
      "output": "Konseptualizm san'atda g'oya va tushunchalarga asoslangan ishlanmalarni yaratishga e'tibor beradi, formalar esa ikkinchi darajali rol o'ynaydi."
    },
    {
      "id": 901,
      "input": "O'zbek musiqasida \"xalq orkestri\" qanday rivojlanadi?",
      "output": "Xalq orkestri O'zbek musiqasining an'anaviy asboblarini birlashtirgan musiqiy ansambl bo'lib, xalq musiqasining turli shakllarini ijro etadi."
    },
    {
      "id": 902,
      "input": "Teatrda \"monolog\" nima?",
      "output": "Monolog  bu bir nechta tomoshabinlar oldida biror aktyorning o'z fikrlarini va his-tuyg'ularini ifodalagan bir qismdan iborat sahna asaridir."
    },
    {
      "id": 903,
      "input": "Rassomlikda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizm rassomlikda ichki his-tuyg'ularni, shaxsiy tajribalarni va jamiyatdagi murakkabliklarni kuchli va ochiq ranglar orqali ifodalashni maqsad qiladi."
    },
    {
      "id": 904,
      "input": "Musiqada \"kanon\" nima?",
      "output": "Kanon  bu musiqada bir xil melodiya yoki tema bir nechta tovush balandliklarida ijro etilishi, ularning bir-biriga nisbatan kechikib kirishi usulidir."
    },
    {
      "id": 905,
      "input": "Arxitektura san'ati va \"organik shakllar\" o'rtasidagi aloqalar qanday?",
      "output": "Organik shakllar arxitekturasida inshootlar tabiat va atrof-muhit bilan uyg'unlikda yaratiladi, ular tabiiy shakllardan ilhomlanadi."
    },
    {
      "id": 906,
      "input": "San'atda \"kollaj\" qanday ishlatiladi?",
      "output": "Kollaj san'ati turli materiallar va tasvirlar birlashtirilib yangi kompozitsiyalar yaratish orqali yangi mazmun yaratish jarayonidir."
    },
    {
      "id": 907,
      "input": "O'zbek madaniyatida \"qadimiy qo'shiqlar\" qanday ajralib turadi?",
      "output": "Qadimiy qo'shiqlar O'zbek madaniyatida tarixiy voqealar, sevgi va qo'rquvlarni aks ettirgan, o'ziga xos an'anaviy uslubda ijro etilgan asarlardir."
    },
    {
      "id": 908,
      "input": "Teatrda \"avantgarde teatr\" nima?",
      "output": "Avantgarde teatr yangi va eksperimentallikni ta'kidlaydi, an'anaviy uslublardan chetlashgan va yangi ifoda shakllarini izlaydi."
    },
    {
      "id": 909,
      "input": "Rassomlikda \"sotsial realizm\" qanday ishlatiladi?",
      "output": "Sotsial realizm rassomlikda ijtimoiy va siyosiy mavzularni, odatdagi odamlarning hayotini realistik tarzda aks ettiradi."
    },
    {
      "id": 910,
      "input": "Arxitektura san'ati va \"sirk arxitekturasi\" o'rtasidagi aloqalar qanday?",
      "output": "Sirk arxitekturasi inshootlarida ajoyib shakllar, yuqori konstruktiv tizimlar va interaktiv muhitlar mavjud bo'lib, odamlarni hayratga soladigan dizaynlar yaratadi."
    },
    {
      "id": 911,
      "input": "Musiqada \"garmonika\" nima?",
      "output": "Garmonika  bu havoni bosib chiqarish orqali tovush chiqaradigan, ko'plab tugmalar orqali boshqariladigan asbobdir."
    },
    {
      "id": 912,
      "input": "O'zbek san'ati va \"qoraqolpoq naqshlari\" o'rtasidagi aloqalar qanday?",
      "output": "Qoraqolpoq naqshlari O'zbek san'ati va uning to'qimachilik an'analarida, ayniqsa gilam va kiyimlarda murakkab geometrik va naturalistik tasvirlar mavjud."
    },
    {
      "id": 913,
      "input": "Teatrda \"moratoriy\" nima?",
      "output": "Moratoriy teatrda tomoshabinga hayotning jiddiy yoki murakkab tomonlarini ko'rsatishdan oldin, vaqtinchalik to'xtash yoki kechikish jarayonini anglatadi."
    },
    {
      "id": 914,
      "input": "Rassomlikda \"yangi realizm\" qanday ishlatiladi?",
      "output": "Yangi realizm rassomlikda kundalik hayotdagi oddiy va tabiiy ob'ektlarni yoki sahnalarni nozik detallar bilan tasvirlashga qaratilgan uslubdir."
    },
    {
      "id": 915,
      "input": "Musiqada \"contrapunt\" nima?",
      "output": "Contrapunt  bu bir vaqtning o'zida bir nechta musiqiy mavzularni ijro etish usuli bo'lib, har bir melodiya o'zini mustaqil tarzda rivojlantiradi."
    },
    {
      "id": 916,
      "input": "Arxitektura san'ati va \"hidroponik inshootlar\" o'rtasidagi aloqalar qanday?",
      "output": "Hidroponik inshootlar atrof-muhitni saqlashga yordam beradigan innovatsion arxitektura yechimlarini yaratishda, suv va energiya resurslaridan samarali foydalanishga asoslanadi."
    },
    {
      "id": 917,
      "input": "San'atda \"stencil san'ati\" qanday ishlatiladi?",
      "output": "Stencil san'ati rangli materiallar orqali naqshlar yoki tasvirlar yaratishda shablonlar va yuqori kontrastli o'zgarishlar ishlatiladi."
    },
    {
      "id": 918,
      "input": "O'zbek musiqasida \"makom usullari\" qanday rivojlanadi?",
      "output": "Makom usullari O'zbek musiqasida o'zining rang-barang va ritmik tizimi bilan ajralib turadi, asosan ma'lum mavzular va turli davrlar bo'yicha ijro etiladi."
    },
    {
      "id": 919,
      "input": "Teatrda \"poliformizm\" nima?",
      "output": "Poliformizm  bu bir nechta dramaturgik uslub va voqea orqali, bir nechta qarashlar va mavzularni birlashtirish jarayonini anglatadi."
    },
    {
      "id": 920,
      "input": "Rassomlikda \"abstrakt ekspressionizm\" qanday ishlatiladi?",
      "output": "Abstrakt ekspressionizm ranglar va shakllarning ichki energiyasini ifodalash orqali, tomoshabinga ijodiy tasavvurlarni ko'rsatishni maqsad qiladi."
    },
    {
      "id": 921,
      "input": "Musiqada \"atonalizm\" nima?",
      "output": "Atonalizm  bu musiqaning an'anaviy tonal tizimidan chetlashgan shaklidir, bunda ma'lum bir ton yoki gama mavjud emas."
    },
    {
      "id": 922,
      "input": "Arxitektura san'ati va \"yuzaga chiqish\" o'rtasidagi aloqalar qanday?",
      "output": "Yuzaga chiqish arxitekturasida inshootlarning tashqi yuzasi estetik jihatdan jozibali bo'lib, tabiiy yoritish va atmosfera yaratish orqali yangi dizaynlar hosil qilinadi."
    },
    {
      "id": 923,
      "input": "San'atda \"holistikalik\" qanday ishlatiladi?",
      "output": "Holistikalik san'ati butunlikni va qismlarning o'zaro bog'liqligini ifodalashga qaratilgan uslubdir, unda barcha elementlar bir-biri bilan uyg'unlikda ishlaydi."
    },
    {
      "id": 924,
      "input": "O'zbek madaniyatida \"xalq yodgorliklari\" qanday ahamiyatga ega?",
      "output": "Xalq yodgorliklari O'zbek madaniyatining tarixiy va diniy an'analarini, xalqning turmush tarzini va qadriyatlarini aks ettiradi."
    },
    {
      "id": 925,
      "input": "Teatrda \"virtual realistik sahna\" nima?",
      "output": "Virtual realistik sahna texnologiya yordamida yaratilgan, fizikaviy va kompyuterli dizaynlarni birlashtirgan sahna shaklidir."
    },
    {
      "id": 926,
      "input": "Rassomlikda \"natura\" qanday ishlatiladi?",
      "output": "Natura rassomlikda tabiatdagi ob'ektlar va manzaralarning bevosita, to'g'ridan-to'g'ri tasvirlanishidir, bu haqiqiy dunyoni aks ettiradi."
    },
    {
      "id": 927,
      "input": "Musiqada \"klavish\" nima?",
      "output": "Klavish  bu pianino yoki klavishli asboblardagi tugma bo'lib, u tovushni chiqarish uchun bosiladi."
    },
    {
      "id": 928,
      "input": "Arxitektura san'ati va \"g'ayrioddiy strukturalar\" o'rtasidagi aloqalar qanday?",
      "output": "G'ayrioddiy strukturalar arxitekturasida noan'anaviy shakllar va materiallar ishlatiladi, ular inshootlarga noyob va innovatsion ko'rinish beradi."
    },
    {
      "id": 929,
      "input": "San'atda \"kalligrafiya\" qanday ishlatiladi?",
      "output": "Kalligrafiya san'ati yozuvni san'ati sifatida ishlatib, harflarning shakllari va tuzilishini estetik jihatdan ifodalashga qaratilgan."
    },
    {
      "id": 930,
      "input": "O'zbek musiqasida \"an'anaviy asboblar\" qanday o'zgaradi?",
      "output": "O'zbek musiqasida an'anaviy asboblar, masalan, rubob, doira, ney va dutor o'zgarib, zamonaviy musiqiy shakllarga moslashadi."
    },
    {
      "id": 931,
      "input": "Teatrda \"yakuniy sahna\" qanday tasvirlanadi?",
      "output": "Yakuniy sahna teatrdagi asar tugashining hissiy va dramatik pallasidir, unda barcha voqealar yakunlanib, tomoshabinlarga xulosa taqdim etiladi."
    },
    {
      "id": 932,
      "input": "Rassomlikda \"piktorializm\" qanday ishlatiladi?",
      "output": "Piktorializm rassomlikda rasmning yorug'lik va ranglar yordamida estetik go'zallikni ifodalashga qaratilgan."
    },
    {
      "id": 933,
      "input": "Musiqada \"dissonans\" nima?",
      "output": "Dissonans  bu musiqada bir-biriga uyg'unsiz yoki qo'pol tovushlarning uyg'unlashmasidir, bu ko'pincha noaniqlik yoki tension yaratarak dramani kuchaytiradi."
    },
    {
      "id": 934,
      "input": "Arxitektura san'ati va \"postmodernizm\" o'rtasidagi aloqalar qanday?",
      "output": "Postmodernizm arxitekturasida an'anaviy shakllar va materiallar qayta ishlanib, kutilmagan va innovatsion dizaynlar hosil qilinadi, u ko'proq estetik va estetik qiyinchiliklarga asoslanadi."
    },
    {
      "id": 935,
      "input": "San'atda \"neoklassizm\" qanday ishlatiladi?",
      "output": "Neoklassizm san'atda klassik g'oyalarni va uslublarni yangilashga qaratilgan, eski san'at uslublarini zamonaviy talqinlar bilan uyg'unlashtiradi."
    },
    {
      "id": 936,
      "input": "O'zbek madaniyatida \"xalq amaliy san'ati\" qanday namoyon bo'ladi?",
      "output": "Xalq amaliy san'ati O'zbek xalqining kundalik hayotida qo'llaniladigan, rang-barang naqshlar va texnikalar yordamida yaratilgan san'atdir."
    },
    {
      "id": 937,
      "input": "Teatrda \"teatrofobiya\" nima?",
      "output": "Teatrofobiya  bu teatr yoki sahnaga chiqishdan qo'rquv hissidir, aktyor yoki tomoshabinning sahnadagi voqealarga nisbatan noqulaylikni anglatadi."
    },
    {
      "id": 938,
      "input": "Rassomlikda \"pop-art\" qanday ishlatiladi?",
      "output": "Pop-art rassomlikda kundalik hayotda uchraydigan komik obrazlar, reklamalar va populyar madaniyat elementlarini tasvirlaydi."
    },
    {
      "id": 939,
      "input": "Arxitektura san'ati va \"yashil binolar\" o'rtasidagi aloqalar qanday?",
      "output": "Yashil binolar ekologik dizaynni targ'ib qiladi, energiya samaradorligini oshirish va tabiiy resurslardan foydalanuvchi arxitektura uslublarini o'z ichiga oladi."
    },
    {
      "id": 940,
      "input": "Musiqada \"polyfonik melodiyalar\" nima?",
      "output": "Polyfonik melodiyalar  bu bir nechta mustaqil tovushlarning bir vaqtning o'zida ijro etilishi, ular bir-biri bilan uyg'unlashgan holda birlashadi."
    },
    {
      "id": 941,
      "input": "O'zbek san'ati va \"g'azal\" janri o'rtasidagi aloqalar qanday?",
      "output": "G'azal janri O'zbek san'ati va adabiyotida yuqori estetik hissiyotlar, muhabbat va falsafiy fikrlarni ifodalovchi asarlarni yaratishda qo'llaniladi."
    },
    {
      "id": 942,
      "input": "Teatrda \"tragikomediya\" nima?",
      "output": "Tragikomediya  bu janr, unda kulgili va jiddiy elementlar birlashtiriladi, insonning murakkab holatlari va hissiyotlari aks ettiriladi."
    },
    {
      "id": 943,
      "input": "Rassomlikda \"geometrik ekspressionizm\" qanday ishlatiladi?",
      "output": "Geometrik ekspressionizm  bu shakl va ranglarni abstrakt tarzda, hissiy va ruhiy tajribalar bilan bog'lab tasvirlash uslubidir."
    },
    {
      "id": 944,
      "input": "Musiqada \"fuga\" nima?",
      "output": "Fuga  bu musiqiy asar shakli bo'lib, unda bir yoki bir nechta mavzular bir necha marta qayta ishlanadi, har bir marta yangi interval va tonallikda takrorlanadi."
    },
    {
      "id": 945,
      "input": "Arxitektura san'ati va \"minimalistik dizayn\" o'rtasidagi aloqalar qanday?",
      "output": "Minimalistik dizayn arxitekturasida oddiy shakllar, soddalashgan detallar va funksionallikni maksimal darajada ta'minlashga intiladi."
    },
    {
      "id": 946,
      "input": "San'atda \"surrealizm\" qanday ishlatiladi?",
      "output": "Surrealizm san'atida reallik va xayolni birlashtirish orqali tushlar, ichki dunyo va g'ayrioddiy obrazlar yaratish maqsad qilinadi."
    },
    {
      "id": 947,
      "input": "O'zbek musiqasida \"rutba\" nima?",
      "output": "Rutba  bu O'zbek musiqasidagi ma'lum bir uslub yoki turdagi musiqa asariga nisbatan qo'llaniladigan tasniflash tizimidir."
    },
    {
      "id": 948,
      "input": "Teatrda \"monodrama\" nima?",
      "output": "Monodrama  bu faqat bitta aktyor ishtirokida ijro etiladigan dramatik asar bo'lib, u tomoshabinni faqat bitta shaxsning ichki kurashlari va tajribalariga tortadi."
    },
    {
      "id": 949,
      "input": "Rassomlikda \"naivizm\" qanday ishlatiladi?",
      "output": "Naivizm rassomlikda sodda va oddiy shakllar, ranglar va kompozitsiyalar orqali hayotning bevosita tasvirini yaratish uslubi hisoblanadi."
    },
    {
      "id": 950,
      "input": "Musiqada \"rubato\" nima?",
      "output": "Rubato  bu musiqada ritmik moslashuv, unda ijrochilikda tezlikni vaqtincha o'zgartirish va melodiya o'ynash usulida erkinlik yaratish mumkin."
    },
    {
      "id": 951,
      "input": "Arxitektura san'ati va \"kengaytirilgan rejalashtirish\" o'rtasidagi aloqalar qanday?",
      "output": "Kengaytirilgan rejalashtirish arxitekturasida inshootlarning mavjud joylari va atrof-muhitiga mos ravishda yirik o'zgarishlar, yangi funksionallik kiritilishi mumkin."
    },
    {
      "id": 952,
      "input": "San'atda \"eksprimental fotografiya\" qanday ishlatiladi?",
      "output": "Eksperimental fotografiya an'anaviy usullardan chetga chiqib, yangi texnikalar, ranglar va tasvirlash usullaridan foydalanishni ta'kidlaydi."
    },
    {
      "id": 953,
      "input": "O'zbek madaniyatida \"to'y marosimi\" qanday ifodalanadi?",
      "output": "O'zbek madaniyatida to'y marosimi o'ziga xos an'analar, raqslar, qo'shiqlar va milliy kiyimlarni o'z ichiga olgan qadimiy va zamonaviy elementlar bilan ifodalanadi."
    },
    {
      "id": 954,
      "input": "Teatrda \"dokumental drama\" nima?",
      "output": "Dokumental drama  bu real voqealarga asoslangan, hayotiy sahnalar va faktlarni dramatik shaklda ifodalovchi teatr janridir."
    },
    {
      "id": 955,
      "input": "Rassomlikda \"metafizik san'at\" qanday ishlatiladi?",
      "output": "Metafizik san'at xayoliy va tushunarsiz tasvirlar orqali mavjudlik, vaqt va haqiqatning chuqur tushunchalarini aks ettirishga intiladi."
    },
    {
      "id": 956,
      "input": "Musiqada \"modulatsiya\" nima?",
      "output": "Modulatsiya  bu musiqada tonallikni yoki kalitni o'zgartirish jarayonidir, bu orqali asar yangi musiqiy rangga ega bo'ladi."
    },
    {
      "id": 957,
      "input": "Arxitektura san'ati va \"urbanoistika\" o'rtasidagi aloqalar qanday?",
      "output": "Urbanoistika shaharsozlik va inshootlar arxitekturasining jamiyat va ekologiyaga qanday ta'sir qilishini o'rganadi, shahar dizaynining asosiy tamoyillarini yaratadi."
    },
    {
      "id": 958,
      "input": "San'atda \"grafiti\" qanday ishlatiladi?",
      "output": "Grafiti  bu ko'cha san'ati turidir, unda devor yoki boshqa jismoniy yuzalarda rasm, yozuv yoki naqshlar yasaladi, ular ko'pincha ijtimoiy va siyosiy g'oyalarni ifodalaydi."
    },
    {
      "id": 959,
      "input": "O'zbek musiqasida \"dastan\" qanday ahamiyatga ega?",
      "output": "Dastan O'zbek musiqasida xalqning tarixiy, eposik va folklor merosini saqlash va ularni yangi avlodga yetkazish vositasi hisoblanadi."
    },
    {
      "id": 960,
      "input": "Teatrda \"improvizatsiya\" nima?",
      "output": "Improvizatsiya teatrda rejissyor yoki aktyor tomonidan rejalashtirilmagan tarzda, vaziyatga qarab sahnada o'zgarishlar kiritishni anglatadi."
    },
    {
      "id": 961,
      "input": "Rassomlikda \"realisme\" qanday ishlatiladi?",
      "output": "Realizm rassomlikda insoniyat va tabiatni, hayotdagi haqiqatni aniq va nozik detallar bilan tasvirlashga qaratilgan uslubdir."
    },
    {
      "id": 962,
      "input": "Musiqada \"melodiyalarni aks ettirish\" nima?",
      "output": "Melodiyalarni aks ettirish musiqada bir mavzuni yoki melodiya fragmentini bir necha marta qayta ishlashni va o'zgartirishni anglatadi."
    },
    {
      "id": 963,
      "input": "Arxitektura san'ati va \"komp'yuuter texnologiyalar\" o'rtasidagi aloqalar qanday?",
      "output": "Komp'yuuter texnologiyalari arxitektura dizaynida yangi texnikalarni va simulyatsiyalarni yaratishda yordam beradi, bu esa arxitekturalarning murakkablik va funksionalligini oshiradi."
    },
    {
      "id": 964,
      "input": "San'atda \"skulptura\" qanday ishlatiladi?",
      "output": "Skulptura san'atida uch o'lchamli shakllar va tasvirlar yaratiladi, ular materiallar orqali jismoniy va vizual ifodalar orqali tasvirlanadi."
    },
    {
      "id": 965,
      "input": "O'zbek madaniyatida \"naqqoshlik\" nima?",
      "output": "Naqqoshlik O'zbek madaniyatida dekorativ va amaliy san'atni ifodalovchi uslubdir, unda naqshlar va bezaklar asosan to'qimachilikda qo'llaniladi."
    },
    {
      "id": 966,
      "input": "Teatrda \"pantomima\" nima?",
      "output": "Pantomima  bu aktyorlar tomonidan sozlarsiz ifodalanadigan drama janri bo'lib, faqat tana tili va yuz ifodalaridan foydalanadi."
    },
    {
      "id": 967,
      "input": "Rassomlikda \"romantizm\" qanday ishlatiladi?",
      "output": "Romantizm rassomlikda tasvirning hissiy va dramatik jihatlarini kuchaytirishga, tabiat va insoniyatning idealizatsiyasiga yo'naltirilgan uslubdir."
    },
    {
      "id": 968,
      "input": "Musiqada \"tembr\" nima?",
      "output": "Tembr  bu tovushning xususiyatini belgilovchi atribut bo'lib, u tovushning sifatini, o'ziga xosligini va rangini aniqlaydi."
    },
    {
      "id": 969,
      "input": "Arxitektura san'ati va \"landshaft arxitektura\" o'rtasidagi aloqalar qanday?",
      "output": "Landshaft arxitekturasi tabiiy va sun'iy elementlarning birlashgan dizaynini yaratib, atrof-muhitni estetik va ekologik jihatdan muvozanatli qilishga intiladi."
    },
    {
      "id": 970,
      "input": "Arxitektura san'ati va \"biomimetika\" o'rtasidagi aloqalar qanday?",
      "output": "Biomimetika arxitektura dizaynida tabiatdagi shakl va strukturalardan ilhomlanib, inson va tabiat o'rtasidagi uyg'unlikni ta'minlashga yordam beradi."
    },
    {
      "id": 971,
      "input": "Musiqada \"sonata\" nima?",
      "output": "Sonata  bu musiqiy asar shakli bo'lib, unda bir nechta qismlar mavjud bo'lib, har biri alohida tematik va melodik xususiyatlarga ega."
    },
    {
      "id": 972,
      "input": "O'zbek san'ati va \"naqqoshlik san'ati\" o'rtasidagi aloqalar qanday?",
      "output": "Naqqoshlik san'ati O'zbek xalqining an'anaviy bezak san'ati bo'lib, uning asarlarini ko'plab to'qimachilik va gilamsozlikda uchratish mumkin."
    },
    {
      "id": 973,
      "input": "Teatrda \"absurd drama\" nima?",
      "output": "Absurd drama  bu teatr janri bo'lib, unda inson hayotining ma'no va mantiqdan ajralgan, tasavvur qilinmaydigan voqealar va dialoglar ko'rsatiladi."
    },
    {
      "id": 974,
      "input": "Rassomlikda \"informalizm\" qanday ishlatiladi?",
      "output": "Informalizm san'ati tasvirlarning ichki hissiyotlarini ifodalashga, shakl va rangi bilan eksperimentlarga yo'naltirilgan abstrakt uslubdir."
    },
    {
      "id": 975,
      "input": "Musiqada \"konsonans\" nima?",
      "output": "Konsonans  bu musiqada tovushlar orasidagi uyg'unlik va xushyoqishligi, ular bir-biriga yaxshi mos keladi va jozibador tovush hosil qiladi."
    },
    {
      "id": 976,
      "input": "Arxitektura san'ati va \"energiya samaradorligi\" o'rtasidagi aloqalar qanday?",
      "output": "Energiya samaradorligi arxitektura dizaynida atrof-muhitni himoya qilish va energiya sarfini kamaytirishga qaratilgan texnologiyalardan foydalanishni anglatadi."
    },
    {
      "id": 977,
      "input": "San'atda \"eksprimental musiqiy asarlar\" qanday ishlatiladi?",
      "output": "Eksprimental musiqiy asarlar yangi tovushlarni va noan'anaviy usullarni qo'llab, musiqaning an'anaviy shakllaridan chetga chiqadi."
    },
    {
      "id": 978,
      "input": "O'zbek madaniyatida \"zamin shodasi\" qanday ifodalanadi?",
      "output": "Zamin shodasi O'zbek madaniyatida agrar va tabiatga oid marosimlar bilan bog'liq bo'lib, ko'plab folklor an'analariga asoslanadi."
    },
    {
      "id": 979,
      "input": "Teatrda \"kvest\" nima?",
      "output": "Kvest  bu interaktiv teatr janri bo'lib, unda tomoshabinlar voqealar rivojida bevosita qatnashib, muammoni yechishga yordam beradilar."
    },
    {
      "id": 980,
      "input": "Rassomlikda \"impressionizm\" qanday ishlatiladi?",
      "output": "Impressionizm rassomlikda yorug'lik va ranglarning o'zgarishini ko'rsatish orqali, ob'ektlarning hissiy ta'sirini ifodalashga yo'naltirilgan uslubdir."
    },
    {
      "id": 981,
      "input": "Musiqada \"tremolo\" nima?",
      "output": "Tremolo  bu musiqada tovushning tez-tez va tez o'zgarishini hosil qilish usuli bo'lib, unda biror notaning qayta-qayta ijro etilishi sodir bo'ladi."
    },
    {
      "id": 982,
      "input": "Arxitektura san'ati va \"intellektual inshootlar\" o'rtasidagi aloqalar qanday?",
      "output": "Intellektual inshootlar arxitekturasida texnologiyalar, aqlli tizimlar va avtomatik boshqaruvlar yordamida resurslar samaradorligi va ijtimoiy muhitni yaxshilashga qaratilgan."
    },
    {
      "id": 983,
      "input": "San'atda \"futurizm\" qanday ishlatiladi?",
      "output": "Futurizm san'atida kelajakni, texnologiyaning rivojlanishini va dinamik harakatlarni tasvirlashga urg'u beriladi."
    },
    {
      "id": 984,
      "input": "O'zbek musiqasida \"maqom\" nima?",
      "output": "Maqom  bu O'zbek musiqasining klassik janri bo'lib, o'ziga xos tonallik va ritmik tizimga asoslanadi, murakkab va ko'p asarlardan iborat."
    },
    {
      "id": 985,
      "input": "Teatrda \"oklahoma uslubi\" nima?",
      "output": "Oklahoma uslubi teatrda Amerikaning qishloq hayoti va madaniyatiga asoslangan, musiqiy va dramatik elementlarni birlashtiruvchi janrdir."
    },
    {
      "id": 986,
      "input": "Rassomlikda \"pop-suret\" qanday ishlatiladi?",
      "output": "Pop-suret san'ati ommaviy madaniyat, reklama va mashhur shaxslarning obrazlari va timsollarini san'atda tasvirlashni o'z ichiga oladi."
    },
    {
      "id": 987,
      "input": "Musiqada \"poliritm\" nima?",
      "output": "Poliritm  bu bir necha ritmik tuzilmalar yoki mavzular bir-biriga zid bo'lgan holda ijro etilishi bo'lib, musiqada murakkab va ritmik tavsiflar yaratadi."
    },
    {
      "id": 988,
      "input": "Arxitektura san'ati va \"samarali fazo\" o'rtasidagi aloqalar qanday?",
      "output": "Samarali fazo arxitekturasi yuzaga kelgan muhitni optimal tarzda tashkil etish, binolarda funksionallik va ergonomikani ta'minlashga yo'naltiriladi."
    },
    {
      "id": 989,
      "input": "San'atda \"surrealistik portret\" qanday ishlatiladi?",
      "output": "Surrealistik portretlar odatda inson yuzining yoki shaxsiyatining oddiylikdan tashqari, orzular va xayoliy holatlar bilan ifodalangan shakllarini tasvirlaydi."
    },
    {
      "id": 990,
      "input": "O'zbek madaniyatida \"jahon madaniyatiga qo'shgan hissa\" qanday ifodalanadi?",
      "output": "O'zbek madaniyati o'zining o'ziga xos adabiyoti, musiqasi va rassomlik an'analari orqali jahonga o'z hissasini qo'shgan va zamonaviy san'atga ta'sir ko'rsatgan."
    },
    {
      "id": 991,
      "input": "Teatrda \"tatratrik drama\" nima?",
      "output": "Tatratrik drama sahnada barcha his-tuyg'ular va voqealarni chuqur dramatik tarzda taqdim etuvchi, tomoshabinni ko'proq o'ziga jalb qilishga qaratilgan janrdir."
    },
    {
      "id": 992,
      "input": "Rassomlikda \"ekspressionizm\" qanday ishlatiladi?",
      "output": "Ekspressionizm rassomlikda inson ruhiyatining noaniq va beqaror holatlarini, his-tuyg'ularni juda jonli ranglar va shakllar bilan ifodalashga asoslanadi."
    },
    {
      "id": 993,
      "input": "Musiqada \"dodekafoniya\" nima?",
      "output": "Dodekafoniya  bu musiqada o'n ikki tonning bir xil darajada ishlatilishini ta'minlaydigan, tonal tizimga qarshi qo'llaniladigan kompozitsion uslubdir."
    },
    {
      "id": 994,
      "input": "Arxitektura san'ati va \"vagabond inshootlar\" o'rtasidagi aloqalar qanday?",
      "output": "Vagabond inshootlar arxitekturasida yashash va ishlash joylari minimalizm va samimiy dizayn asosida, o'zaro bog'liq va energiya samarali tarzda rejalashtiriladi."
    },
    {
      "id": 995,
      "input": "San'atda \"hibrid san'at\" qanday ishlatiladi?",
      "output": "Hibrid san'at an'anaviy va yangi san'at shakllarini birlashtirib, turli materiallar va texnologiyalar yordamida noyob san'at asarlarini yaratishga asoslanadi."
    },
    {
      "id": 996,
      "input": "O'zbek musiqasida \"xonandalar va kuychilar\" roli qanday?",
      "output": "Xonandalar va kuychilar O'zbek musiqasining rivojlanishida muhim rol o'ynaydi, ular an'anaviy va zamonaviy ijro usullarini birlashtirib, musiqani yangi avlodlarga yetkazadi."
    },
    {
      "id": 997,
      "input": "Teatrda \"antitez\" nima?",
      "output": "Antitez  bu teatrda qarama-qarshi g'oyalar yoki obrazlarni taqqoslash orqali, konfliktlarni keltirib chiqarish va dramatik ta'sir yaratish usulidir."
    },
    {
      "id": 998,
      "input": "Rassomlikda \"transavangardizm\" qanday ishlatiladi?",
      "output": "Transavangardizm san'ati oldingi avangardistik harakatlardan ajralib, yangi estetik va ideologik g'oyalarni yaratishga qaratilgan uslubdir."
    },
    {
      "id": 999,
      "input": "Musiqada \"leitmotiv\" nima?",
      "output": "Leitmotiv  bu musiqada biror mavzu yoki obrazni takrorlanuvchi, aniq va mos keladigan melodiyalar orqali ifodalashdir."
    },
    {
      "id": 1000,
      "input": "Arxitektura san'ati va \"shaharsozlik\" o'rtasidagi aloqalar qanday?",
      "output": "Shaharsozlik arxitekturani shaharni rejalashtirish va boshqarishda birlashtiradi, aholining ehtiyojlariga mos keladigan infratuzilmani yaratishga yordam beradi."
    },
    {
      "id": 1001,
      "input": "Ozbek madaniy merosi haqida qanday bilimlaringiz bor?",
      "output": "Samarqand, Buxoro va Xiva kabi shaharlardagi memoriy yodgorliklar haqida bilaman."
    },
    {
      "id": 1002,
      "input": "Teatr tomoshalarini qanchalik tez-tez tomosha qilasiz?",
      "output": "Kamdan-kam, lekin imkon bolsa, mahalliy teatrlarni qollab-quvvatlashga harakat qilaman."
    },
    {
      "id": 1003,
      "input": "Sizningcha, zamonaviy sanat klassik sanatga tasir qiladimi?",
      "output": "Ha, zamonaviy sanat klassik asarlardan ilhom oladi va ularni yangi shakllarda qayta yaratadi."
    },
    {
      "id": 1004,
      "input": "Qaysi madaniyat festivallari yoki tadbirlariga qatnashgansiz?",
      "output": "Navroz va xalqaro kinofestivallarda qatnashganman."
    },
    {
      "id": 1005,
      "input": "Sizningcha, sanat insonning ichki dunyosini qanday boyitadi?",
      "output": "Sanat insonni oylashga, his qilishga va turli xil nuqtai nazarlarni qabul qilishga undaydi."
    },
    {
      "id": 1006,
      "input": "Musiqa janrlari orasida qaysi biri sizga yaqinroq?",
      "output": "Klassik va xalq musiqasi, chunki ular chuqur tarixiy ildizlarga ega."
    },
    {
      "id": 1007,
      "input": "Siz biron marta muzeyga yoki sanat galereyasiga borganmisiz?",
      "output": "Ha, borganman, koproq tarixiy va rassomlik asarlarini korishni yoqtiraman."
    },
    {
      "id": 1008,
      "input": "Madaniyat va sanatni rivojlantirish uchun nimalarni qilish kerak deb oylaysiz?",
      "output": "Yosh avlodni bu sohalarga qiziqtirish va davlat tomonidan koproq qollab-quvvatlash kerak."
    },
    {
      "id": 1009,
      "input": "Kitob oqish madaniyatini rivojlantirish uchun qanday tavsiyalar berasiz?",
      "output": "Kitobxonlik klublarini tashkil qilish va yoshlarni adabiyotga qiziqtirish uchun tanlovlar otkazish kerak."
    },
    {
      "id": 1010,
      "input": "Siz qaysi mashhur sanatkorlarning ijodini qadrlaysiz?",
      "output": "Leonardo da Vinchi, Amir Temur davridagi memorlar va Alisher Navoiy kabi ijodkorlarni."
    },
    {
      "id": 1011,
      "input": "Kino sanati haqida fikringiz qanday?",
      "output": "Bu zamonaviy davrda hissiy va vizual tasirning kuchli vositasi hisoblanadi."
    },
    {
      "id": 1012,
      "input": "Siz madaniyatlararo muloqotni qanday rivojlantirish mumkin deb oylaysiz?",
      "output": "Turli xalq festivallari, sanat korgazmalari va madaniy almashuv dasturlari orqali."
    },
    {
      "id": 1013,
      "input": "Madaniy merosni saqlash uchun qanday choralar korish kerak?",
      "output": "Restavratsiya qilish, xalqaro tashkilotlar bilan hamkorlik qilish va turistlarga malumot yetkazish."
    },
    {
      "id": 1014,
      "input": "Sanat bilan shugullanishni ozingiz sinab korganmisiz?",
      "output": "Ha, bolaligimda rasm chizish va musiqa asboblarini chalishni organishga harakat qilganman."
    },
    {
      "id": 1015,
      "input": "Mahalliy sanatkorlar haqida qanday fikrdasiz?",
      "output": "Ular mahalliy madaniyatni saqlash va rivojlantirishda muhim rol oynaydi."
    },
    {
      "id": 1016,
      "input": "Sanat va texnologiya uygunligi haqida nima deya olasiz?",
      "output": "Texnologiya sanatni yangi bosqichga olib chiqdi, masalan, raqamli sanat va virtual korgazmalar."
    },
    {
      "id": 1017,
      "input": "Ozbek sanatini xalqaro maydonda qanday tanitish mumkin?",
      "output": "Korgazmalar va xalqaro tadbirlarda ishtirok etish, media orqali targib qilish."
    }
  ]