[
  {
    "id": 1,
    "input": "Qaysi turdagi investitsiyalarni afzal ko‘rasiz: uzoq muddatli yoki qisqa muddatli?",
    "output": "Uzoq muddatli, chunki ular barqaror daromad keltirishga moyil."
  },
  {
    "id": 2,
    "input": "Investitsiya qilishdan oldin qanday omillarga e’tibor berasiz?",
    "output": "Risk darajasi, kutilayotgan daromad va investitsiya muddati."
  },
  {
    "id": 3,
    "input": "Moliyaviy savodxonlikni oshirish uchun qanday resurslardan foydalanasiz?",
    "output": "Kitoblar, onlayn kurslar va moliyaviy mutaxassislarning maslahatlari."
  },
  {
    "id": 4,
    "input": "Siz uchun investitsiyada xavfsizlikmi yoki yuqori daromadmi muhimroq?",
    "output": "Xavfsizlik muhimroq, ammo imkoniyat bo‘lsa, balansni saqlashga harakat qilaman."
  },
  {
    "id": 5,
    "input": "Siz qimmatli qog‘ozlarga investitsiya qilishni foydali deb hisoblaysizmi?",
    "output": "Ha, agar bozorni to‘g‘ri tahlil qila olsangiz, yaxshi daromad olish mumkin."
  },
  {
    "id": 6,
    "input": "Moliyaviy rejalashtirishni qaysi muddatda amalga oshirasiz: qisqa yoki uzoq muddatda?",
    "output": "Uzoq muddatli rejalashtirishga afzal beraman, chunki u barqaror natija beradi."
  },
  {
    "id": 7,
    "input": "Passiv daromad olishni rejalashtirganmisiz?",
    "output": "Ha, bu orqali moliyaviy erkinlikka erishish mumkin deb o‘ylayman."
  },
  {
    "id": 8,
    "input": "Sizningcha, moliyaviy savodxonlikning eng muhim jihati nima?",
    "output": "To‘g‘ri byudjet tuzish va qarzlarni boshqarish."
  },
  {
    "id": 9,
    "input": "Siz investitsiya portfelingizni diversifikatsiya qilasizmi?",
    "output": "Albatta, riskni kamaytirish uchun turli aktivlarga mablag‘ kiritaman."
  },
  {
    "id": 10,
    "input": "Sizning fikringizcha, investitsiya uchun eng yaxshi soha qaysi?",
    "output": "Texnologiya, ko‘chmas mulk va sog‘liqni saqlash sohalarini foydali deb hisoblayman."
  },
  {
    "id": 11,
    "input": "Siz biron marta kriptovalyutaga investitsiya qilganmisiz?",
    "output": "Ha, kichik miqdorda sinab ko‘rganman, ammo risklari yuqori ekanligini bilaman."
  },
  {
    "id": 12,
    "input": "Moliyaviy xatolarni oldini olish uchun qanday choralar ko‘rasiz?",
    "output": "Har qanday qaror qabul qilishdan oldin batafsil tahlil qilaman."
  },
  {
    "id": 13,
    "input": "Moliyaviy erkinlikka erishish uchun qanday maslahat berasiz?",
    "output": "Yaxshi rejalashtirish, intizomli tejash va oqilona investitsiya qilish kerak."
  },
  {
    "id": 14,
    "input": "Sizningcha, birinchi navbatda nimaga investitsiya qilish kerak?",
    "output": "Bilim va o‘z qobiliyatlaringizga, chunki bu uzoq muddatda daromad keltiradi."
  },
  {
    "id": 15,
    "input": "Kichik investitsiyalarni boshlash uchun qaysi yo‘lni tanlashni maslahat berasiz?",
    "output": "Omonat hisobvaraqlari yoki fond indekslariga kichik mablag‘ kiritish yaxshi boshlanish."
  },
  {
    "id": 16,
    "input": "Siz moliyaviy masalalarda maslahat olasizmi?",
    "output": "Ha, mutaxassislardan maslahat olish foydali bo‘ladi."
  },
  {
    "id": 17,
    "input": "Moliyaviy rejangizga qancha vaqt oralig‘ida qayta ko‘rib chiqasiz?",
    "output": "Har 6 oyda yoki ehtiyojga qarab."
  },
  {
    "id": 18,
    "input": "Investitsiya nima?",
    "output": "Investitsiya — bu moliyaviy yoki jismoniy aktivlarga mablag' kiritish orqali daromad olish maqsadi."
  },
  {
    "id": 19,
    "input": "Moliyaviy savodxonlik nima?",
    "output": "Moliyaviy savodxonlik — shaxs yoki tashkilotning moliyaviy resurslarni boshqarish va foydalanish qobiliyati."
  },
  {
    "id": 20,
    "input": "Passiv daromad nima?",
    "output": "Passiv daromad — ishlamagan holda keladigan daromad, masalan, aktsiyalar yoki mulkdan olinadigan daromad."
  },
  {
    "id": 21,
    "input": "Aktivlar va passivlar orasidagi farqni tushuntiring.",
    "output": "Aktivlar — qiymatga ega bo'lgan va daromad keltiradigan mol-mulk; passivlar — qarz yoki majburiyatlar."
  },
  {
    "id": 22,
    "input": "Aktsiya nima?",
    "output": "Aktsiya — kompaniyaning ulushini anglatadi, aktsiya egasi kompaniyaga nisbatan ulushga ega bo'ladi."
  },
  {
    "id": 23,
    "input": "Obligatsiya nima?",
    "output": "Obligatsiya — bu qarz qog'ozi, uni chiqaruvchi davlat yoki korporatsiya qarzini to'lashni va'da qiladi."
  },
  {
    "id": 24,
    "input": "Diversifikatsiya nima?",
    "output": "Diversifikatsiya — investitsiya portfelini turli aktivlarga taqsimlash orqali riskni kamaytirish."
  },
  {
    "id": 25,
    "input": "Riskni boshqarish nima?",
    "output": "Riskni boshqarish — investitsiyalar bilan bog'liq xavf-xatarlarni aniqlash va kamaytirish strategiyasi."
  },
  {
    "id": 26,
    "input": "Likvidlik nima?",
    "output": "Likvidlik — aktivning naqd pulga aylanish tezligi va osonligi."
  },
  {
    "id": 27,
    "input": "Kompaniya qiymatini baholashda qanday usullar mavjud?",
    "output": "Foyda koeffitsienti, diskontlangan naqd pul oqimlari (DCF) va bozor taqqoslash kabi usullar."
  },
  {
    "id": 28,
    "input": "Passiv daromadni qanday yaratish mumkin?",
    "output": "Investitsiya portfeli, qimmatli qog'ozlar, ko'chmas mulk yoki biznesdan passiv daromad olish mumkin."
  },
  {
    "id": 29,
    "input": "Investitsiyalarning turlari qanday?",
    "output": "Aksiyalar, obligatsiyalar, ko'chmas mulk, qimmatli qog'ozlar va boshqa aktivlar."
  },
  {
    "id": 30,
    "input": "Kapital daromadining afzalliklari qanday?",
    "output": "Soliqqa tortilishi past, uzoq muddatli daromad olish imkoniyati va investitsiya qiymatini oshirish."
  },
  {
    "id": 31,
    "input": "Qanday qilib ko'chmas mulkka investitsiya qilish mumkin?",
    "output": "Uy yoki tijorat mulkini sotib olish, ijaraga berish yoki mulkni qiymat oshishi bilan sotish."
  },
  {
    "id": 32,
    "input": "Qimmatli qog'ozlar nima?",
    "output": "Bular investitsiya sifatida foydalaniladigan, ko'chirish va sotish mumkin bo'lgan hujjatlar."
  },
  {
    "id": 33,
    "input": "Invesment portfelini qanday diversifikatsiya qilish kerak?",
    "output": "Turli xil aktivlar va sohalarga investitsiya qilish, riskni kamaytirish va daromadni oshirish maqsadida."
  },
  {
    "id": 34,
    "input": "\"Yashirin xatolik\" nima?",
    "output": "Investorning kutilmagan yo'qotishlarga olib keladigan noto'g'ri qarorlar qabul qilish xatoliklari."
  },
  {
    "id": 35,
    "input": "Soliqni optimallashtirish qanday amalga oshiriladi?",
    "output": "Investitsiyalarning soliqqa ta'sirini tushunish va soliqlarni kamaytirish uchun samarali strategiyalarni qo'llash."
  },
  {
    "id": 36,
    "input": "Kredit kartalaridan qanday foydalanish kerak?",
    "output": "Ularni ehtiyotkorlik bilan boshqarish, to'lovlarni o'z vaqtida amalga oshirish va foizlarni kamaytirish."
  },
  {
    "id": 37,
    "input": "Nafaqaga chiqish uchun qanday investitsiya qilish kerak?",
    "output": "Uzun muddatli investitsiyalarni tanlash, masalan, pensiya fondlari, aksiyalar va obligatsiyalar."
  },
  {
    "id": 38,
    "input": "Moliya bozorlarining turlari qanday?",
    "output": "Aktsiyalar bozori, obligatsiyalar bozori, valyuta bozori va tovarlar bozori."
  },
  {
    "id": 39,
    "input": "Aktivlar narxining o'sishiga ta'sir qiladigan omillar nima?",
    "output": "Bozor talab va taklifi, iqtisodiy o'sish, siyosiy vaziyat va global voqealar."
  },
  {
    "id": 40,
    "input": "Inflatsiya va uning investitsiyalarga ta'siri qanday?",
    "output": "Inflatsiya qiymatni kamaytirishi mumkin, lekin ba'zi investitsiyalar bunga qarshi kurashadi."
  },
  {
    "id": 41,
    "input": "Mahalliy va xalqaro investitsiyalar orasidagi farqni tushuntiring.",
    "output": "Mahalliy investitsiyalar o'z mamlakatda amalga oshiriladi, xalqaro investitsiyalar esa boshqa davlatlarda."
  },
  {
    "id": 42,
    "input": "Investitsiya qilishdan oldin qanday tahlil o'tkazish kerak?",
    "output": "Bozor holatini, kompaniyaning moliyaviy holatini va iqtisodiy tendentsiyalarni tahlil qilish."
  },
  {
    "id": 43,
    "input": "Sarmoya kiritishda xavfni kamaytirishning asosiy strategiyalari nimalar?",
    "output": "Diversifikatsiya, riskni boshqarish, uzoq muddatli yondashuv va bozorni kuzatib borish."
  },
  {
    "id": 44,
    "input": "To'g'ri kreditni qanday tanlash kerak?",
    "output": "Foiz stavkalarini, shartlarni va kreditning umumiy narxini tahlil qilish."
  },
  {
    "id": 45,
    "input": "Ko'chmas mulk sarmoyalarida qanday xatoliklar bor?",
    "output": "Bozorni noto'g'ri tahlil qilish, yaxshi joylashuvni tanlamaslik yoki xarajatlarni haddan tashqari oshirish."
  },
  {
    "id": 46,
    "input": "Shaxsiy byudjetni qanday tuzish kerak?",
    "output": "Daromad va xarajatlarni tahlil qilib, maqsadlar qo'yish va byudjetni qat'iy rioya qilish."
  },
  {
    "id": 47,
    "input": "Sarmoyalar uchun eng yaxshi davr qachon?",
    "output": "Bu bozor sharoitiga, iqtisodiy holatga va individual maqsadlarga bog'liq."
  },
  {
    "id": 48,
    "input": "Investitsiya qilishdan oldin qanday hisobotlarni o'rganish kerak?",
    "output": "Kompaniya balans hisobotlari, daromadlar va xarajatlar, naqd pul oqimlari."
  },
  {
    "id": 49,
    "input": "Davlat qarzi va uning iqtisodiy ta'siri haqida nima bilishingiz kerak?",
    "output": "Davlat qarzi iqtisodiy o'sishni to'xtatishi yoki inflyatsiyani oshirishi mumkin, lekin yaxshi boshqarilsa foydali bo'lishi mumkin."
  },
  {
    "id": 50,
    "input": "To'lov balansini qanday tahlil qilish mumkin?",
    "output": "Eksport va importni, xizmatlar va kapital harakatlarini hisoblash."
  },
  {
    "id": 51,
    "input": "Xavf va daromad o'rtasidagi aloqani qanday tushunish mumkin?",
    "output": "Xavfni kamaytirgan sayin, daromadlar ham pasayishi mumkin, lekin yaxshi riskni boshqarish yuqori daromad olish imkonini yaratadi."
  },
  {
    "id": 52,
    "input": "Kapitalni qanday samarali investitsiya qilish mumkin?",
    "output": "Uzun muddatli va diversifikatsiyalangan investitsiyalarni tanlash orqali."
  },
  {
    "id": 53,
    "input": "Qaysi investitsiyalar qisqa muddatda yuqori daromad keltirishi mumkin?",
    "output": "Aksiyalar yoki ko'chmas mulk bozorlarida qisqa muddatli o'zgarishlardan foydalanish mumkin."
  },
  {
    "id": 54,
    "input": "Moliyaviy rejalashtirish nima?",
    "output": "Shaxsiy yoki korporativ daromad va xarajatlarni rejalashtirish, kelajakdagi moliyaviy maqsadlarga erishish."
  },
  {
    "id": 55,
    "input": "Moliya bozorining turli ishtirokchilari kimlar?",
    "output": "Investorlar, brokerlar, savdogarlar, davlatlar va moliya muassasalari."
  },
  {
    "id": 56,
    "input": "Kredit reytingi nima?",
    "output": "Kredit reytingi shaxs yoki korporatsiyaning qarz majburiyatlarini to'lash qobiliyatini baholovchi ko'rsatkich."
  },
  {
    "id": 57,
    "input": "Soliq rejalarini qanday tuzish mumkin?",
    "output": "Mavjud soliqlarni tahlil qilib, optimallashtirish uchun strategiyalar ishlab chiqish."
  },
  {
    "id": 58,
    "input": "Investitsiya strategiyasining turlari qanday?",
    "output": "Yangi boshlovchilar uchun konservativ, riskni yuqori olganlar uchun agressiv va o'rtacha yondashuvlar."
  },
  {
    "id": 59,
    "input": "Aksiyalar bozorining qanday asosiy ko'rsatkichlari mavjud?",
    "output": "Bozor indeksi, P/E koeffitsienti, dividend rentabelligi va volatillik."
  },
  {
    "id": 60,
    "input": "Riskni baholashning asosiy usullari nimalar?",
    "output": "Statistika, qiymat atrofida riskni o'lchash, tarixiy ma'lumotlarni tahlil qilish."
  },
  {
    "id": 61,
    "input": "Yangi boshlovchilar uchun eng yaxshi investitsiyalar qaysilar?",
    "output": "Diversifikatsiyalangan fondlar, indeks fondlar, ko'chmas mulk va ta'limga investitsiyalar."
  },
  {
    "id": 62,
    "input": "Ko'chmas mulkni sotib olishning afzalliklari nimalar?",
    "output": "Boshqarish osonligi, passiv daromad olish imkoniyati va mulkning qiymatini oshirish."
  },
  {
    "id": 63,
    "input": "Investitsiyalarning soliq ta'siri qanday?",
    "output": "Soliqlar dividendlar, kapital daromadlar va foizlar bo'yicha olinishi mumkin."
  },
  {
    "id": 64,
    "input": "Moliya rejalashtirishda to'lovni optimallashtirish qanday amalga oshiriladi?",
    "output": "Kreditlarni vaqtida to'lash, yuqori foizlarni kamaytirish va byudjetni rejalashtirish."
  },
  {
    "id": 65,
    "input": "Aktsiya bozorida qachon sotish kerak?",
    "output": "Bozorni tahlil qilib, yuqori daromad olish imkoniyatlarini hisobga olib sotish kerak."
  },
  {
    "id": 66,
    "input": "O'z biznesingizga investitsiya qilishda qanday xatoliklar mavjud?",
    "output": "Bozorni noto'g'ri tahlil qilish, resurslarni samarali ishlatmaslik va rejalashtirishda xatoliklar."
  },
  {
    "id": 67,
    "input": "Obligatsiyalarni sotib olishning afzalliklari nimalar?",
    "output": "Past xavf va uzoq muddatda barqaror daromad olish imkoniyati."
  },
  {
    "id": 68,
    "input": "Ehtiyotkorlik bilan investitsiya qilishning asosiy tamoyillari qanday?",
    "output": "Riskni kamaytirish, diversifikatsiya, bozor tahlili va uzoq muddatli strategiyalarni amalga oshirish."
  },
  {
    "id": 69,
    "input": "Investorlar qanday qilib bozorni tahlil qilishadi?",
    "output": "Fundamental tahlil, texnik tahlil, va makroiqtisodiy omillarni hisobga olish."
  },
  {
    "id": 70,
    "input": "Qimmatli qog'ozlar bozori qanday ishlaydi?",
    "output": "Investorlar va savdogarlar o'rtasida qimmatli qog'ozlar sotilishi va sotib olinishi orqali kapitalni taqsimlash."
  },
  {
    "id": 71,
    "input": "Naqd pul oqimi nima?",
    "output": "Biror sub'ektning daromadlari va xarajatlari orasidagi farq, bu biznesning moliyaviy holatini ko'rsatadi."
  },
  {
    "id": 72,
    "input": "Moliya xavfini boshqarishda qanday vositalar mavjud?",
    "output": "Diversifikatsiya, hedging, sug'urta va limitlashtirish strategiyalari."
  },
  {
    "id": 73,
    "input": "Ko'chmas mulkka investitsiya qilishning yillik rentabelligi qanday hisoblanadi?",
    "output": "Mulkning ijarasidan kelgan daromadni mulkning qiymatiga nisbatan hisoblash."
  },
  {
    "id": 74,
    "input": "Kriptovalyutalarga investitsiya qilishning afzalliklari nimalar?",
    "output": "Tez o'zgaruvchan bozor, yuqori daromad olish imkoniyati, ammo yuqori risk."
  },
  {
    "id": 75,
    "input": "Soliqdan tejash uchun qanday investitsiyalar qilish mumkin?",
    "output": "Pensiya jamg'armalari, soliq imtiyozlari beradigan investitsiya fondlari."
  },
  {
    "id": 76,
    "input": "Fond bozorlaridagi volatillik nima?",
    "output": "Bozor narxlarining keskin va tez-tez o'zgarishi, ko'pincha investorlar uchun xavf tug'diradi."
  },
  {
    "id": 77,
    "input": "Investitsiya portfelini qanday samarali boshqarish mumkin?",
    "output": "Xavflarni tahlil qilish, aktivlarni diversifikatsiya qilish va vaqt o'tishi bilan qayta tekshirish."
  },
  {
    "id": 78,
    "input": "Yangi boshlovchilar uchun qaysi moliyaviy vositalar eng samarali?",
    "output": "Indeks fondlari, omonatlar, ko'chmas mulk va uzoq muddatli obligatsiyalar."
  },
  {
    "id": 79,
    "input": "Bozorni tahlil qilishda eng muhim iqtisodiy ko'rsatkichlar qanday?",
    "output": "Ishsizlik darajasi, inflyatsiya, yalpi ichki mahsulot (GDP) va foiz stavkalari."
  },
  {
    "id": 80,
    "input": "Yillik investitsiya rentabelligi qanday hisoblanadi?",
    "output": "Yillik daromadni investitsiya qiymatiga bo'lib, foiz shaklida ifodalash."
  },
  {
    "id": 81,
    "input": "Xalqaro investitsiyalarni qanday boshqarish kerak?",
    "output": "Xalqaro bozorlarni o'rganish, valyuta risklarini hisobga olish va xalqaro soliq tizimlarini tushunish."
  },
  {
    "id": 82,
    "input": "Moliya muassasalari qanday faoliyat yuritadi?",
    "output": "Ular kreditlar berish, sarmoyalar jalb qilish va investitsiyalarni boshqarish kabi faoliyatlarni amalga oshiradi."
  },
  {
    "id": 83,
    "input": "Portfelni qayta balanslash nima?",
    "output": "Portfeli tarkibini o'zgartirish, yangi sharoitlarga moslashtirish va risklarni boshqarish."
  },
  {
    "id": 84,
    "input": "Aksiyalar bozorida o'zgarishlarni qanday prognoz qilish mumkin?",
    "output": "Makroiqtisodiy omillarni, kompaniya hisobotlarini va bozorning texnik tahlilini tahlil qilish."
  },
  {
    "id": 85,
    "input": "Raqamli aktivlar nima?",
    "output": "Raqamli aktivlar - bu raqamli formatda mavjud bo'lgan, muomalaga kiritilgan yoki investitsiya qilinadigan aktivlar, masalan, kriptovalyutalar."
  },
  {
    "id": 86,
    "input": "Portfelni diversifikatsiya qilishda qanday strategiyalar mavjud?",
    "output": "Sektorlar, aktivlar turlari va geografik hududlar bo'yicha diversifikatsiya qilish."
  },
  {
    "id": 87,
    "input": "Aktsiyalar bozorida sotish va sotib olishning optimal vaqti qanday aniqlanadi?",
    "output": "Bozorni tahlil qilib, aksiyalarning qiymati va kompaniyaning moliyaviy holatiga qarab qaror qabul qilish."
  },
  {
    "id": 88,
    "input": "Forex bozorida qanday qilib sarmoya qilish mumkin?",
    "output": "Valyutalar o'rtasidagi farqlarni hisobga olib, valyutalar bozorida savdo qilish."
  },
  {
    "id": 89,
    "input": "Investitsiya qilishdan oldin qanday hujjatlar tayyorlash kerak?",
    "output": "Biznes-reja, risklarni baholash hisobotlari, moliyaviy tahlil va soliq hisobotlari."
  },
  {
    "id": 90,
    "input": "Ko'chmas mulkni sotishdan qanday foyda olish mumkin?",
    "output": "Qiymatning oshishi yoki ijaradan olinadigan daromad."
  },
  {
    "id": 91,
    "input": "Korporativ obligatsiyalar nima?",
    "output": "Kompaniyalar tomonidan chiqarilgan qarz qog'ozlari, investorlar uchun barqaror daromad manbai."
  },
  {
    "id": 92,
    "input": "Investitsiya qilish uchun yaxshi vaqtni qanday aniqlash mumkin?",
    "output": "Makroiqtisodiy sharoitlarni, bozor va iqtisodiy ko'rsatkichlarni tahlil qilish."
  },
  {
    "id": 93,
    "input": "Dividendlarni qanday hisoblash mumkin?",
    "output": "Kompaniyaning daromadlaridan chiqarilgan dividendlar aktsiya soniga bo'linadi."
  },
  {
    "id": 94,
    "input": "Investitsiyalarning asosiy turlari nima?",
    "output": "Aksiyalar, obligatsiyalar, ko'chmas mulk, kriptovalyutalar, va boshqa qimmatli qog'ozlar."
  },
  {
    "id": 95,
    "input": "Moliya bozorining likvidligi nima?",
    "output": "Aktivlarning naqd pulga aylanish tezligi va osonligi."
  },
  {
    "id": 96,
    "input": "\"Yuqori risk, yuqori daromad\" tamoyilining mohiyati nima?",
    "output": "Yuqori riskka ega bo'lgan investitsiyalar odatda yuqori daromad olish imkoniyatini taqdim etadi."
  },
  {
    "id": 97,
    "input": "Investitsiya qilishda xarajatlarni qanday boshqarish kerak?",
    "output": "Foydali investitsiya vositalarini tanlab, soliq, komissiya va boshqa xarajatlarni kamaytirish."
  },
  {
    "id": 98,
    "input": "Investitsiya qilishning qisqa muddatli va uzoq muddatli strategiyalari qanday farqlanadi?",
    "output": "Qisqa muddatda tez daromad olish, uzoq muddatda esa barqaror va yuqori rentabellikka erishish."
  },
  {
    "id": 99,
    "input": "Kredit va qarz o'rtasidagi farq nima?",
    "output": "Kredit — bu kreditni olish uchun ma'lum bir mablag'ning belgilangan muddati; qarz esa umumiy majburiyatdir."
  },
  {
    "id": 100,
    "input": "Yangi boshlovchilar uchun qanday investitsiya platformalarini tanlash kerak?",
    "output": "Past komissiya stavkalari, foydalanuvchilarga qulay interfeys va yaxshi mijozlarga xizmat ko'rsatish."
  },
  {
    "id": 101,
    "input": "Shaxsiy moliyaviy maqsadlarni qanday belgilash kerak?",
    "output": "Uzoq va qisqa muddatli maqsadlarni aniq va o'lchovli qilib belgilash, ularni amalga oshirish rejasini tuzish."
  },
  {
    "id": 102,
    "input": "Sarmoya kiritishda iqtisodiy indikatorlar nima?",
    "output": "Yalpi ichki mahsulot (GDP), inflyatsiya darajasi, ishsizlik darajasi va foiz stavkalari."
  },
  {
    "id": 103,
    "input": "Kriptovalyutaga investitsiya qilishda xavflar qanday?",
    "output": "Bozorning yuqori volatilligi, tartibga solishning yo'qligi, xavf-xatarlar va noqonuniy faoliyatlar."
  },
  {
    "id": 104,
    "input": "Ijaraga ko'chmas mulkni berishning afzalliklari nimalar?",
    "output": "Doimiy passiv daromad, mulkning qiymatini oshirish imkoniyati va bozor narxining o'sishi."
  },
  {
    "id": 105,
    "input": "Risklarni boshqarishda qanday vositalar mavjud?",
    "output": "Diversifikatsiya, sug'urta, foiz o'zgarishlari uchun hedging va xarajatlarni optimallashtirish."
  },
  {
    "id": 106,
    "input": "Qimmatli qog'ozlarga investitsiya qilishning eng yaxshi usuli qanday?",
    "output": "Diversifikatsiyalangan fondlar yoki indeks fondlariga investitsiya qilish."
  },
  {
    "id": 107,
    "input": "Soliq rejimlarini optimallashtirish qanday amalga oshiriladi?",
    "output": "Soliqni kamaytirish uchun pensiya jamg'armalariga yoki soliq imtiyozlari beradigan investitsiya mahsulotlariga sarmoya kiritish."
  },
  {
    "id": 108,
    "input": "Ijtimoiy investitsiyalar qanday amalga oshiriladi?",
    "output": "Ijtimoiy jihatdan mas'uliyatli investitsiya (SRI) orqali, atrof-muhitga ta'sirni kamaytirish."
  },
  {
    "id": 109,
    "input": "Dividendlarni qabul qilish va qayta investitsiya qilishning afzalliklari qanday?",
    "output": "Dividendlarni qayta investitsiya qilish orqali daromadni oshirish, ularni olish esa passiv daromadni ta'minlaydi."
  },
  {
    "id": 110,
    "input": "Moliya bozori volatiligi nima?",
    "output": "Moliya bozorida qiymatlar o'zgarishining tezligi va kengligi."
  },
  {
    "id": 111,
    "input": "Kreditlar va qarzlar bo'yicha to'lovlarni qanday optimallashtirish mumkin?",
    "output": "Yillik foizlarni kamaytirish, kreditorlar bilan qayta muzokaralar olib borish va muddatlarni belgilash."
  },
  {
    "id": 112,
    "input": "Investitsiyalarda likvidlik muammosi nima?",
    "output": "Aktivlarning tezda naqd pulga aylantirilmasligi va ulardan foydalanishning qiyinlashishi."
  },
  {
    "id": 113,
    "input": "Kompaniya qiymatini oshirishning asosiy usullari nimalar?",
    "output": "Innovatsiyalar, samarali boshqaruv, xarajatlarni qisqartirish va foydali investitsiyalar."
  },
  {
    "id": 114,
    "input": "Portfelni qayta balanslash qanday amalga oshiriladi?",
    "output": "Portfel tarkibini bozor sharoitlariga mos ravishda o'zgartirish, riskni boshqarish uchun."
  },
  {
    "id": 115,
    "input": "Aksiyalarni sotib olishda qanday tahlil usullaridan foydalanish kerak?",
    "output": "Texnik va fundamental tahlil orqali kompaniyaning moliyaviy holatini va bozor harakatlarini o'rganish."
  },
  {
    "id": 116,
    "input": "Soliqdan tejamkor investitsiyalar qanday amalga oshiriladi?",
    "output": "Soliqdan ajralgan foydalarga ega investitsiya vositalariga mablag' kiritish, masalan, pensiya jamg'armalari."
  },
  {
    "id": 117,
    "input": "Xalqaro bozorlar bilan sarmoya qilishning afzalliklari qanday?",
    "output": "Geografik diversifikatsiya, bozor o'zgarishlaridan foydalangan holda yuqori rentabellikka erishish."
  },
  {
    "id": 118,
    "input": "Fond bozorlarida muvaffaqiyatli sarmoya qilishning asosiy tamoyillari nimalar?",
    "output": "Diversifikatsiya, riskni boshqarish, uzoq muddatli yondashuv va bozorni kuzatib borish."
  },
  {
    "id": 119,
    "input": "Investitsiya qilishda qanday risklar mavjud?",
    "output": "Bozorning volatilligi, iqtisodiy o'zgarishlar, kompaniyaning moliyaviy holati va siyosiy risklar."
  },
  {
    "id": 120,
    "input": "Moliya tahlili nima va qanday amalga oshiriladi?",
    "output": "Moliya tahlili - bu kompaniyaning moliyaviy hisobotlarini o'rganish orqali uning faoliyatini baholash."
  },
  {
    "id": 121,
    "input": "Foiz stavkalari qanday ishlaydi va ularning investitsiyalarga ta'siri qanday?",
    "output": "Foiz stavkasi investitsiyalarni jalb qilishda muhim rol o'ynaydi, yuqori foiz stavkalari kredit olishni qiyinlashtiradi."
  },
  {
    "id": 122,
    "input": "Omonat hisoblari va ularga investitsiya qilishning afzalliklari nimalar?",
    "output": "Kam xavf bilan passiv daromad olish imkoniyati, likvidlikning yuqoriligi."
  },
  {
    "id": 123,
    "input": "Aktsiyalarni tahlil qilishda qanday texnik usullar mavjud?",
    "output": "Grafiklar, o'zgarishlar indikatorlari, trendlarni tahlil qilish va texnik ko'rsatkichlar."
  },
  {
    "id": 124,
    "input": "O'zgaruvchan bozor sharoitida qanday strategiyalarni qo'llash kerak?",
    "output": "Diversifikatsiya, risklarni boshqarish, va bozor o'zgarishlarini kuzatib borish."
  },
  {
    "id": 125,
    "input": "O'zbekiston bozorida investitsiya qilishning afzalliklari qanday?",
    "output": "Barqaror iqtisodiy rivojlanish, soliq imtiyozlari, yangi sohalarga sarmoya kiritish imkoniyatlari."
  },
  {
    "id": 126,
    "input": "Diversifikatsiya nima va qanday amalga oshiriladi?",
    "output": "Diversifikatsiya - bu sarmoyalarni bir necha turdagi aktivlarga taqsimlash orqali riskni kamaytirish."
  },
  {
    "id": 127,
    "input": "Ko'chmas mulkni investitsiya sifatida tanlashda qanday jihatlarga e'tibor qaratish kerak?",
    "output": "Joylashuv, bozorning tendensiyalari, yillik rentabellik va soliq majburiyatlari."
  },
  {
    "id": 128,
    "input": "Kapitalni oshirishning eng samarali usuli qanday?",
    "output": "Investitsiya qilish, biznesni rivojlantirish, yuqori rentabellikli aktivlarga sarmoya kiritish."
  },
  {
    "id": 129,
    "input": "Risklarni minimallashtirish uchun qanday usullar mavjud?",
    "output": "Sug'urta, diversifikatsiya, riskni boshqarish strategiyalari, har xil bozorlarga sarmoya kiritish."
  },
  {
    "id": 130,
    "input": "Qimmatli qog'ozlarga investitsiya qilishda qanday turdagi xatarlar mavjud?",
    "output": "Bozorning o'zgaruvchanligi, kompaniyaning moliyaviy holati, iqtisodiy muammolar va siyosiy risklar."
  },
  {
    "id": 131,
    "input": "Aksiyalarga investitsiya qilishda qanday tahlil usulidan foydalanish kerak?",
    "output": "Fundamental va texnik tahlilni birgalikda qo'llash."
  },
  {
    "id": 132,
    "input": "Omonatlarni qanday optimallashtirish mumkin?",
    "output": "Foiz stavkalarini solishtirib, yuqori daromad keltiruvchi omonatlarni tanlash."
  },
  {
    "id": 133,
    "input": "Kriptovalyutalarga investitsiya qilishda qanday xavf-xatarlar mavjud?",
    "output": "Raqamli aktivlarning o'zgaruvchanligi, tartibga solishning yo'qligi, xavfsizlikka oid muammolar."
  },
  {
    "id": 134,
    "input": "Yangi biznesga sarmoya kiritishda qanday tahlil qilish kerak?",
    "output": "Bozorni o'rganish, kompaniyaning moliyaviy holatini, boshqaruvni va biznes modelini baholash."
  },
  {
    "id": 135,
    "input": "Kredit olishda qanday omillarni hisobga olish kerak?",
    "output": "Foiz stavkalari, kredit muddati, to'lovlar va kredit tarixini tekshirish."
  },
  {
    "id": 136,
    "input": "O'zgaruvchan iqtisodiy sharoitlarda investitsiya strategiyalari qanday bo'lishi kerak?",
    "output": "Risklarni kamaytirish va bozorni tahlil qilish, qiyin sharoitda diversifikatsiya qilish."
  },
  {
    "id": 137,
    "input": "Korporativ obligatsiyalarni sotib olishning afzalliklari nimalar?",
    "output": "Barqaror daromad olish, riskni kamaytirish va likvidlikni ta'minlash."
  },
  {
    "id": 138,
    "input": "Soliq to'lovchilar uchun qanday sarmoya vositalari mavjud?",
    "output": "Pensiya jamg'armalari, soliq imtiyozlari beruvchi fondlar, soliqdan ajralgan investitsiyalar."
  },
  {
    "id": 139,
    "input": "Aktsiyalar bozorining eng yaxshi vaqtini qanday topish mumkin?",
    "output": "Makroiqtisodiy ko'rsatkichlar, kompaniya hisobotlari va bozor tahlilidan foydalanish."
  },
  {
    "id": 140,
    "input": "Moliya rejalashtirishda yillik budjetni qanday tuzish mumkin?",
    "output": "Kiritish va chiqarish oqimlarini tahlil qilib, harajatlarni kamaytirish va daromadni oshirish."
  },
  {
    "id": 141,
    "input": "O'zgaruvchan bozor sharoitida sarmoya qilishning afzalliklari qanday?",
    "output": "Yangi imkoniyatlar yaratish, ammo bozorni tahlil qilish va risklarni boshqarish zarur."
  },
  {
    "id": 142,
    "input": "Moliya bozoridagi balansi qanday amalga oshiriladi?",
    "output": "Aktivlar va passivlar o'rtasidagi muvozanatni ta'minlash, rentabellikni oshirish."
  },
  {
    "id": 143,
    "input": "Qimmatli qog'ozlar bozoridagi savdo vositalari qanday?",
    "output": "Aksiyalar, obligatsiyalar, indeks fondlari, va ETF (Exchange Traded Fund)."
  },
  {
    "id": 144,
    "input": "Shaxsiy moliya rejasini qanday tuzish kerak?",
    "output": "Daromad va xarajatlarni tahlil qilish, maqsadlarni belgilash, qarzlarni to'lash rejasini tuzish."
  },
  {
    "id": 145,
    "input": "Sarmoya qilishda yuqori rentabellikni ta'minlashning asosiy yo'llari nimalar?",
    "output": "Diversifikatsiya, yuqori daromad keltiruvchi aktivlarga sarmoya kiritish va riskni boshqarish."
  },
  {
    "id": 146,
    "input": "Sug'urta nima va unga qanday investitsiya qilish mumkin?",
    "output": "Sug'urta - bu xavflarni boshqarish vositasi, sarmoya kiritish orqali barqaror daromad olish mumkin."
  },
  {
    "id": 147,
    "input": "Investitsiya qilishda qayta balanslashning afzalliklari qanday?",
    "output": "Riskni boshqarish, portfelni optimallashtirish va sarmoya qilishning samaradorligini oshirish."
  },
  {
    "id": 148,
    "input": "Xalqaro sarmoya kiritishning asosiy turlari nimalar?",
    "output": "Xalqaro fondlar, aksiyalar, obligatsiyalar va ko'chmas mulk."
  },
  {
    "id": 149,
    "input": "Moliya muassasalarining funktsiyalari qanday?",
    "output": "Kreditlar berish, depozitlarni yig'ish, investitsiya qilish, va aktivlarni boshqarish."
  },
  {
    "id": 150,
    "input": "Moliya bozorlarida qanday ko'rsatkichlar yordamida sarmoya qilishni tahlil qilish mumkin?",
    "output": "Bozor indeksi, P/E koeffitsienti, dividend rentabelligi va foiz stavkalari."
  },
  {
    "id": 151,
    "input": "Investitsiyalarni soliqdan himoya qilishning qanday yo'llari mavjud?",
    "output": "Soliq imtiyozli investitsiya hisoblari, pensiya fondlariga sarmoya kiritish va boshqalar."
  },
  {
    "id": 152,
    "input": "Risklarni tahlil qilishda qanday statistik usullar qo'llaniladi?",
    "output": "O'zgarishlarning dispersiyasi, standart og'ish, VaR (Value at Risk) va ehtimollik tahlillari."
  },
  {
    "id": 153,
    "input": "Soliqni optimallashtirish uchun qanday investitsiya turlaridan foydalanish mumkin?",
    "output": "O'zbekistonning soliqqa oid imtiyozlarini taqdim etadigan fondlar va investitsiya vositalari."
  },
  {
    "id": 154,
    "input": "Moliya bozorida yuqori volatillikka ega bo'lgan aktivlar qanday turlari bor?",
    "output": "Kriptovalyutalar, o'zgaruvchan aktsiyalar, va qisqa muddatli obligatsiyalar."
  },
  {
    "id": 155,
    "input": "Yangi boshlovchilar uchun investitsiya qilishda eng yaxshi strategiya qanday bo'lishi kerak?",
    "output": "Uzoq muddatli strategiyalarni tanlash, riskni kamaytirish va o'rganishga asoslangan yondashuv."
  },
  {
    "id": 156,
    "input": "Passiv investitsiya strategiyalari qanday afzalliklarga ega?",
    "output": "Kam xarajatlar, vaqtni tejash, bozor o'zgarishlaridan mustaqil bo'lish va barqaror daromad olish."
  },
  {
    "id": 157,
    "input": "Vaxtinchalik investitsiya qilishning afzalliklari qanday?",
    "output": "Tez daromad olish imkoniyati, qisqa muddatli imkoniyatlardan foydalanish."
  },
  {
    "id": 158,
    "input": "ETF (Exchange Traded Fund) nima va u qanday ishlaydi?",
    "output": "ETF - bu aktsiyalar kabi fond birjalarda savdo qilinadigan, turli xil aktivlarni o'z ichiga olgan investitsiya fondi."
  },
  {
    "id": 159,
    "input": "\"Buy and hold\" strategiyasi nima?",
    "output": "Aktivlarni uzoq muddat saqlash orqali bozorning o'sishini kutish, qisqa muddatli savdolarni kamaytirish."
  },
  {
    "id": 160,
    "input": "Sarmoya kiritishning etik jihatlari qanday?",
    "output": "Ijtimoiy mas'uliyatli investitsiyalarni qo'llab-quvvatlash, atrof-muhit va jamiyat uchun foydalilik."
  },
  {
    "id": 161,
    "input": "Dividendlar va kapital qiymatining farqi nima?",
    "output": "Dividendlar - bu kompaniya foydasidan aktsiya egalariga to'lanadigan ulush, kapital qiymat esa aktsiyaning bozor qiymatidagi o'zgarishlardir."
  },
  {
    "id": 162,
    "input": "\"Risk va daromad\" munosabati qanday tahlil qilinadi?",
    "output": "Risk va daromad o'rtasidagi o'zaro bog'liqlikni o'rganish, yuqori risk yuqori daromad imkoniyatini yaratadi."
  },
  {
    "id": 163,
    "input": "Portfelni boshqarishning eng samarali usullari qanday?",
    "output": "Diversifikatsiya, alohida aktivlar bilan bog'liq riskni kamaytirish va strategik qayta balanslash."
  },
  {
    "id": 164,
    "input": "Kichik bizneslarga investitsiya qilishning afzalliklari nimalar?",
    "output": "Yangi imkoniyatlarni kashf etish, yuqori rentabellik va innovatsiyalar."
  },
  {
    "id": 165,
    "input": "O'zgaruvchan foiz stavkalari sarmoya kiritishda qanday ta'sir ko'rsatadi?",
    "output": "Kreditlar va obligatsiyalarni sotib olishda foiz stavkalarining o'zgarishi rentabellikni ta'sir qiladi."
  },
  {
    "id": 166,
    "input": "Investitsiya turlarini tanlashda iqtisodiy cikllarni qanday hisobga olish kerak?",
    "output": "Iqtisodiy rivojlanish bosqichlarini tahlil qilish va har bir bosqichga mos investitsiya qilish."
  },
  {
    "id": 167,
    "input": "Ko'chmas mulkda risklarni qanday boshqarish mumkin?",
    "output": "Mulkning joylashuvi, ijarachilarning xavfi, sug'urta va bozor tahlili orqali."
  },
  {
    "id": 168,
    "input": "Sarmoyani qayta yo'naltirishning asosiy sabablari qanday?",
    "output": "Foyda olish, yangi imkoniyatlarni kashf etish, va riskni kamaytirish."
  },
  {
    "id": 169,
    "input": "Investitsiya qilishda etika va ijtimoiy mas'uliyat nima?",
    "output": "Atrof-muhitga zarar bermaslik, jamiyatga foyda keltirish va xolis moliyaviy qarorlar qabul qilish."
  },
  {
    "id": 170,
    "input": "Kriptovalyutalarning investitsiya imkoniyatlari qanday?",
    "output": "Bozorlarning yuqori o'zgaruvchanligi, yuqori daromad olish imkoniyatlari, lekin yuqori risk bilan."
  },
  {
    "id": 171,
    "input": "Aktsiyalarning qiymatining o'zgarishini qanday prognoz qilish mumkin?",
    "output": "Fundamental tahlil va texnik tahlil metodlaridan foydalanish."
  },
  {
    "id": 172,
    "input": "Umumiy fondlarga sarmoya kiritishning afzalliklari qanday?",
    "output": "Portfelni diversifikatsiya qilish, kichik o'zgarishlarga nisbatan barqaror rentabellik olish."
  },
  {
    "id": 173,
    "input": "\"Tugallanmagan\" va \"to'liq bo'lgan\" investitsiyalar orasidagi farq nima?",
    "output": "Tugallanmagan investitsiyalar yuqori risk va uzoq muddatli imkoniyatlar bilan bog'liq, to'liq bo'lgan investitsiyalar esa yuqori rentabellik ta'minlaydi."
  },
  {
    "id": 174,
    "input": "Qimmatli qog'ozlarga bo'lgan talabni qanday aniqlash mumkin?",
    "output": "Bozor va iqtisodiy sharoitlarni tahlil qilish, kompaniyaning moliyaviy holatini baholash."
  },
  {
    "id": 175,
    "input": "Investitsiya portfelida aktsiyalar va obligatsiyalar o'rtasidagi muvozanatni qanday saqlash mumkin?",
    "output": "Risk va rentabellikni hisobga olgan holda portfelni qayta balanslash."
  },
  {
    "id": 176,
    "input": "Aksiyalarning likvidligini qanday tahlil qilish mumkin?",
    "output": "Savdolar hajmi, bozor faoliyati va kompaniyaning moliyaviy holati asosida tahlil qilish."
  },
  {
    "id": 177,
    "input": "Kredit reytingi nima va uning investitsiyalarga ta'siri qanday?",
    "output": "Kredit reytingi - bu qarz beruvchilar tomonidan kompaniya yoki davlatning kreditga layoqatini baholash. Past reytinglar yuqori foiz stavkalarini keltiradi."
  },
  {
    "id": 178,
    "input": "Bozorni tahlil qilishda qanday iqtisodiy ko'rsatkichlar eng muhim?",
    "output": "Yalpi ichki mahsulot (GDP), ishsizlik darajasi, inflyatsiya va foiz stavkalari."
  },
  {
    "id": 179,
    "input": "Ijaraga ko'chmas mulkni berishning iqtisodiy samaradorligini qanday baholash mumkin?",
    "output": "Rentabellikni hisoblash, bozor narxlarini tahlil qilish va ijarachilarning to'lov qobiliyati."
  },
  {
    "id": 180,
    "input": "Kriptovalyutalarga investitsiya qilishda risklarni kamaytirish uchun qanday strategiyalar mavjud?",
    "output": "Diversifikatsiya, xavfsiz saqlash va doimiy monitoring qilish."
  },
  {
    "id": 181,
    "input": "Xalqaro investitsiya fondlari qanday ishlaydi?",
    "output": "Xalqaro bozorlar orqali sarmoya kiritish, valyutalar va mintaqalar bo'yicha diversifikatsiya qilish."
  },
  {
    "id": 182,
    "input": "Investitsiya qilishda taxminiy daromadni qanday hisoblash mumkin?",
    "output": "Rentabellik, dividendlar, va aktivlarning qiymat o'zgarishini hisobga olish."
  },
  {
    "id": 183,
    "input": "Rentabellik va likvidlik o'rtasidagi farq nima?",
    "output": "Rentabellik - daromad olish imkoniyati, likvidlik esa aktivlarning naqd pulga aylanish tezligi."
  },
  {
    "id": 184,
    "input": "Investitsiyalarning qisqa muddatli va uzoq muddatli farqlari qanday?",
    "output": "Qisqa muddatli investitsiyalar tezroq daromad keltirishi mumkin, uzoq muddatli investitsiyalar esa barqarorlik va o'sish imkoniyatini ta'minlaydi."
  },
  {
    "id": 185,
    "input": "Kapitalni boshqarishda qanday asosiy printsiplar mavjud?",
    "output": "Diversifikatsiya, risklarni boshqarish, vaqtni samarali ishlatish va bozorni tahlil qilish."
  },
  {
    "id": 186,
    "input": "Inflyatsiyaning investitsiya portfeliga ta'siri qanday?",
    "output": "Inflyatsiya aktivlarning qiymatini kamaytiradi, lekin ba'zi aktivlar, masalan, ko'chmas mulk, undan foyda olish imkoniyatiga ega."
  },
  {
    "id": 187,
    "input": "Soliqni tejash uchun qanday sarmoya vositalaridan foydalanish mumkin?",
    "output": "Soliq imtiyozli omonatlar, pensiya jamg'armalari va soliqdan ozod qilinadigan investitsiyalar."
  },
  {
    "id": 188,
    "input": "Kredit reytingi qanday ta'sir qiladi va uni qanday yaxshilash mumkin?",
    "output": "Yaxshi kredit reytingi past foiz stavkalarini ta'minlaydi, uni yaxshilash uchun qarzlarni to'lash va vaqtida to'lovlarni amalga oshirish zarur."
  },
  {
    "id": 189,
    "input": "Investitsiya portfelingizni qayta balanslash uchun qanday vaqtlar to'g'ri?",
    "output": "Bozor sharoitlari o'zgarganda yoki investitsiya maqsadlaringiz o'zgarganda qayta balanslash kerak."
  },
  {
    "id": 190,
    "input": "Davlat obligatsiyalari qanday sarmoya vositasi hisoblanadi?",
    "output": "Davlat obligatsiyalari - bu davlat tomonidan chiqarilgan, kam riskli, past daromadli sarmoya vositalari."
  },
  {
    "id": 191,
    "input": "Investitsiya portfelini boshqarishda boshqaruv jarayonining ahamiyati qanday?",
    "output": "Portfelni tahlil qilish, risklarni boshqarish va aktivlar o'rtasidagi muvozanatni saqlash uchun boshqaruv muhimdir."
  },
  {
    "id": 192,
    "input": "Yangi texnologiyalarni qo'llagan holda sarmoya qilishning afzalliklari qanday?",
    "output": "Innovatsiyalar o'sish imkoniyatlarini yaratadi, ammo ular yuqori risk va o'zgaruvchanlikni ham keltiradi."
  },
  {
    "id": 193,
    "input": "Investitsiyalarning qiymatining o'zgarishini qanday prognoz qilish mumkin?",
    "output": "Makroiqtisodiy ko'rsatkichlar, bozor tahlili, kompaniya hisobotlari va texnik tahlil yordamida."
  },
  {
    "id": 194,
    "input": "Raqamli aktivlarga sarmoya kiritishning afzalliklari qanday?",
    "output": "Yangi imkoniyatlar, yuqori rentabellik va global miqyosda sarmoya kiritish imkoniyatlari."
  },
  {
    "id": 195,
    "input": "Sug'urta kompaniyalariga sarmoya kiritishning afzalliklari qanday?",
    "output": "Barqaror daromad, uzoq muddatli sarmoyalar, va kam xavf."
  },
  {
    "id": 196,
    "input": "Investitsiya qilishda shaxsiy moliyaviy reja qanday yordam beradi?",
    "output": "Shaxsiy maqsadlar va byudjet asosida investitsiya strategiyasini aniqlashga yordam beradi."
  },
  {
    "id": 197,
    "input": "Vaqtni optimallashtirish va investitsiya qilishning to'g'ri usulini qanday tanlash mumkin?",
    "output": "Aktivlar bo'yicha tahlil, vaqtni samarali boshqarish va uzoq muddatli o'sish maqsadlariga e'tibor qaratish zarur."
  },
  {
    "id": 198,
    "input": "Investitsiya bozoridagi diversifikatsiyaning muhimligi nimalardan iborat?",
    "output": "Risklarni kamaytirish va daromad olish imkoniyatlarini kengaytirish."
  },
  {
    "id": 199,
    "input": "Yangi boshlovchilar uchun aktsiyalarni qanday tanlash kerak?",
    "output": "Kompaniyaning moliyaviy holatini tahlil qilish, tarixiy ko'rsatkichlar va bozor trendlari bilan ishlash."
  },
  {
    "id": 200,
    "input": "Soliqni boshqarishning eng samarali usullari qanday?",
    "output": "Soliq imtiyozli hisoblar, daromadni taqsimlash va soliqdan ozod qilinadigan sarmoyalar."
  },
  {
    "id": 201,
    "input": "Investitsiya qilishda tashkilotlar va fondlar orasidagi farq nima?",
    "output": "Tashkilotlar asosan an'anaviy bizneslar, fondlar esa aktivlarni bir joyda saqlaydigan ko'p sarmoya vositalari."
  },
  {
    "id": 202,
    "input": "Yillik daromadning barqarorligi qanday ta'minlanadi?",
    "output": "Daromadni diversifikatsiya qilish, xatarlardan himoya qilish va bozorni tahlil qilish orqali barqarorlik ta'minlanadi."
  },
  {
    "id": 203,
    "input": "Savdo qilishda bozorni o'rganishning ahamiyati qanday?",
    "output": "Bozor tahlili savdolarni rejalashtirishda yordam beradi va yuqori rentabellik imkoniyatlarini yaratadi."
  },
  {
    "id": 204,
    "input": "Davlat va xususiy sektorlarga sarmoya kiritishning farqi nima?",
    "output": "Davlat sektori odatda kam riskli, xususiy sektor esa yuqori rentabellik va yuqori riskni taqdim etadi."
  },
  {
    "id": 205,
    "input": "Moliya bozori indeksi nima va u qanday ishlaydi?",
    "output": "Moliya bozori indeksi - bu aksiyalar yoki boshqa aktivlar guruhining o'rtacha qiymatini ifodalovchi ko'rsatkich."
  },
  {
    "id": 206,
    "input": "Sarmoya qilishda eng yaxshi vaqtni qanday belgilash mumkin?",
    "output": "Makroiqtisodiy ma'lumotlar, bozor trendlari va kompaniya hisobotlari asosida tahlil qilish."
  },
  {
    "id": 207,
    "input": "Makroiqtisodiy ko'rsatkichlar sarmoya kiritish qarorlariga qanday ta'sir qiladi?",
    "output": "Bozorning umumiy holatini ko'rsatib, sarmoyadorlarga optimal vaqtni belgilash imkonini beradi."
  },
  {
    "id": 208,
    "input": "Investitsiyalarni boshqarishda psixologik faktorlarning ta'siri qanday?",
    "output": "Odamlar hissiy qarorlar qabul qilishi mumkin, bu esa bozorni tahlil qilish va riskni boshqarish strategiyalariga ta'sir qiladi."
  },
  {
    "id": 209,
    "input": "Raqamli pul va an'anaviy valyutalar orasidagi farq nima?",
    "output": "Raqamli pul - elektron shaklda bo'ladi, an'anaviy valyutalar esa markaziy banklar tomonidan chiqariladi."
  },
  {
    "id": 210,
    "input": "Investorlar uchun likvidlikni qanday hisoblash mumkin?",
    "output": "Aktivlarning naqd pulga aylanish tezligi yoki likvidlik ko'rsatkichlari orqali."
  },
  {
    "id": 211,
    "input": "O'zgaruvchan iqtisodiy sharoitlarda sarmoya qilishda qanday strategiyalarni qo'llash kerak?",
    "output": "Risklarni boshqarish, diversifikatsiya va bozorni tezda tahlil qilish."
  },
  {
    "id": 212,
    "input": "Sarmoya kiritishda \"qarz va kapital\" balansini qanday saqlash kerak?",
    "output": "Kichik va katta risklarni boshqarish orqali kapital va qarz o'rtasidagi balansni saqlash muhimdir."
  },
  {
    "id": 213,
    "input": "Investitsiya qilishda vaqtni samarali boshqarishning ahamiyati qanday?",
    "output": "Tezkor o'zgarishlarga moslashish, vaqtni tejash va uzoq muddatli foyda olish imkoniyatlarini yaratish."
  },
  {
    "id": 214,
    "input": "Xalqaro bozorlar bilan sarmoya qilishda qanday xatarlar mavjud?",
    "output": "Valyuta kursi o'zgarishlari, siyosiy noaniqliklar va lokal iqtisodiy holatlarning ta'siri."
  },
  {
    "id": 215,
    "input": "Risklarni baholashda qanday matematik modellar qo'llaniladi?",
    "output": "Modellashtirish, ehtimollik tahlillari va simulyatsiyalar yordamida."
  },
  {
    "id": 216,
    "input": "Kredit olishda moliyaviy rejalashtirishning o'rni qanday?",
    "output": "Kredit olishdan oldin to'lovlarni va foizlarni hisoblab chiqish va barqaror moliyaviy holatni ta'minlash zarur."
  },
  {
    "id": 217,
    "input": "Sarmoyadorlar uchun ko'rsatiladigan xizmatlar nimalardan iborat?",
    "output": "Moliyaviy maslahat, portfelni boshqarish, soliqlarni optimallashtirish va riskni tahlil qilish."
  },
  {
    "id": 218,
    "input": "Sarmoya kiritishda yuqori riskli aktivlarga qanday yondashish kerak?",
    "output": "Yangi imkoniyatlar yaratish, diversifikatsiya qilish va bozorni ehtiyotkorlik bilan kuzatib borish."
  },
  {
    "id": 219,
    "input": "Iqtisodiy o'sish davrida qanday investitsiya turlari foydali bo'ladi?",
    "output": "Aktsiyalar, ko'chmas mulk va innovatsion startaplar."
  },
  {
    "id": 220,
    "input": "Moliya bozorida trendni qanday aniqlash mumkin?",
    "output": "Texnik tahlil, harakatlanuvchi o'rtacha (MA), va boshqa indikatorlar orqali."
  },
  {
    "id": 221,
    "input": "Investitsiya qilishda eng yaxshi vaqtni tanlash uchun qanday indikatorlardan foydalanish kerak?",
    "output": "Bozor tahlili, iqtisodiy ko'rsatkichlar, va kompaniya moliyaviy hisobotlari."
  },
  {
    "id": 222,
    "input": "Sarmoya kiritishning iqtisodiy xavfini qanday kamaytirish mumkin?",
    "output": "Diversifikatsiya, risklarni boshqarish, va bozorni o'z vaqtida tahlil qilish."
  },
  {
    "id": 223,
    "input": "Avtomatlashtirilgan investitsiya tizimlari qanday ishlaydi?",
    "output": "Algoritmik savdolar va dasturiy ta'minot yordamida aktivlar sotib olish va sotish."
  },
  {
    "id": 224,
    "input": "Bozorni tahlil qilishda fundamental va texnik tahlilning farqi nima?",
    "output": "Fundamental tahlil kompaniyaning moliyaviy holatini o'rganishga qaratilgan, texnik tahlil esa bozor harakatlarini prognoz qilishga qaratilgan."
  },
  {
    "id": 225,
    "input": "Investitsiya portfelini diversifikatsiyalashning qanday afzalliklari bor?",
    "output": "Xatarlarni kamaytirish, bozorning turli sharoitlarida barqaror daromad olish."
  },
  {
    "id": 226,
    "input": "Kriptovalyutalar sarmoya kiritishda qanday xavf va imkoniyatlar yaratadi?",
    "output": "Yuqori daromad olish imkoniyatlari, lekin o'zgaruvchanlik va regulyatsiyalarning noaniqligi."
  },
  {
    "id": 227,
    "input": "Moliya bozorida \"boga\" va \"ayiq\" bozorlari nima?",
    "output": "\"Boga\" bozorida narxlar oshib boradi, \"ayiq\" bozorida esa pasayadi."
  },
  {
    "id": 228,
    "input": "Qimmatli qog'ozlar bozorida spekulyatsiyaning afzalliklari va xavflari qanday?",
    "output": "Yuqori rentabellik imkoniyatlari, ammo katta yo'qotish xavfi ham mavjud."
  },
  {
    "id": 229,
    "input": "Moliya bozorida aktivlar narxini qanday prognoz qilish mumkin?",
    "output": "Fundamental va texnik tahlil, iqtisodiy va siyosiy o'zgarishlarni kuzatish orqali."
  },
  {
    "id": 230,
    "input": "Moliya boshqaruvchisi qanday funksiyalarni bajaradi?",
    "output": "Portfelni boshqarish, investitsiya strategiyasini ishlab chiqish, va risklarni tahlil qilish."
  },
  {
    "id": 231,
    "input": "O'zbekiston moliya bozorida investitsiya qilishning afzalliklari qanday?",
    "output": "Yuqori o'sish potentsiali, yangi sarmoya imkoniyatlari va soliq imtiyozlari."
  },
  {
    "id": 232,
    "input": "Moliya bozorlarida foydalanuvchilarni qanday tartibga solish kerak?",
    "output": "Regulyatorlar yordamida, bozorda adolatli savdolarni ta'minlash va xatarlarni kamaytirish."
  },
  {
    "id": 233,
    "input": "Yillik investitsiya daromadi qanday hisoblanadi?",
    "output": "Sarmoya qiymatining o'zgarishi va dividendlar orqali olingan daromadlar yig'indisi."
  },
  {
    "id": 234,
    "input": "Investitsiya qilishda moliyaviy ko'rsatkichlarni tahlil qilishning o'rni qanday?",
    "output": "Kompaniyaning moliyaviy barqarorligini, rentabelligini va o'sish imkoniyatlarini baholash."
  },
  {
    "id": 235,
    "input": "Investitsiya qilishda atrof-muhit, ijtimoiy va boshqaruv (ESG) omillarini hisobga olish qanday ta'sir qiladi?",
    "output": "Sarmoyadorlarga ijtimoiy mas'uliyatli investitsiyalarni tanlashda yordam beradi, hamda uzoq muddatli daromadni oshiradi."
  },
  {
    "id": 236,
    "input": "Kredit kartalari bilan investitsiya qilishning xavflari nimalar?",
    "output": "Yuqori foiz stavkalari, qarzning ortishi va sarmoyaning qisqa muddatli bo'lishi."
  },
  {
    "id": 237,
    "input": "Xalqaro investitsiya imkoniyatlarini qanday baholash kerak?",
    "output": "Xalqaro bozorlar, valyuta kurslari, siyosiy holat va iqtisodiy barqarorlikni tahlil qilish."
  },
  {
    "id": 238,
    "input": "Moliya bozorida portfelni boshqarishda texnik indikatorlar qanday yordam beradi?",
    "output": "Bozor tendensiyalarini aniqlash, narxlar o'zgarishini prognoz qilish va optimal sotish yoki sotib olish nuqtalarini belgilash."
  },
  {
    "id": 239,
    "input": "Moliya boshqaruvi bo'yicha asosiy strategiyalar qanday?",
    "output": "Portfelni diversifikatsiyalash, risklarni boshqarish, va uzoq muddatli o'sish strategiyalarini ishlab chiqish."
  },
  {
    "id": 240,
    "input": "Kichik bizneslarga investitsiya qilishda qanday risklar mavjud?",
    "output": "Bozor o'zgaruvchanligi, raqobatning oshishi va kompaniya boshqaruvining muammolari."
  },
  {
    "id": 241,
    "input": "Aktsiyalarga investitsiya qilishda qanday soliq to'lovlari bo'lishi mumkin?",
    "output": "Dividendlar, sotishdan olingan foyda va boshqa kapital o'zgarishlariga soliq solinishi mumkin."
  },
  {
    "id": 242,
    "input": "Ijtimoiy mas'uliyatli investitsiya (SRI) nima?",
    "output": "Jamiyat va atrof-muhitga ta'sir qiladigan, lekin foyda keltiradigan investitsiyalarni tanlash."
  },
  {
    "id": 243,
    "input": "Investitsiyalarni nazorat qilishda qanday regulyatorlar mavjud?",
    "output": "Milliy va xalqaro regulyatorlar, masalan, Markaziy banklar, moliya vazirliklari va qimmatli qog'ozlar bozorlarini nazorat qiluvchi organlar."
  },
  {
    "id": 244,
    "input": "Davlat mablag'larini qanday investitsiya qilish mumkin?",
    "output": "Davlat obligatsiyalarini sotib olish yoki davlat tomonidan qo'llab-quvvatlanadigan loyihalarda sarmoya kiritish."
  },
  {
    "id": 245,
    "input": "Kriptovalyutalar bilan ishlashda xavfsizlikni ta'minlash qanday amalga oshiriladi?",
    "output": "Kriptovalyutalarni xavfsiz saqlash uchun maxfiy kalitlarni himoya qilish va xavfsiz savdolarni amalga oshirish zarur."
  },
  {
    "id": 246,
    "input": "Investitsiya bozoridagi psixologik ta'sirlar qanday ishlaydi?",
    "output": "Bozor ishtirokchilari hissiy qarorlar qabul qilishadi, bu esa bozorning o'zgaruvchanligini keltirib chiqaradi."
  },
  {
    "id": 247,
    "input": "Avtomatik investitsiya tizimlarining afzalliklari nimalar?",
    "output": "Xatolarsiz, tezkor savdolar va bozorni kuzatish imkoniyatlarini yaratadi, shuningdek, xarajatlarni kamaytiradi."
  },
  {
    "id": 248,
    "input": "Sarmoya kiritishda maxfiylikni saqlash qanday ta'minlanadi?",
    "output": "Shaxsiy ma'lumotlarni himoya qilish, va maxfiy shartnomalar va xavfsizlik protokollarini qo'llash."
  },
  {
    "id": 249,
    "input": "Global moliya bozorlarida investitsiya qilishda qanday valyutalar xavfli bo'lishi mumkin?",
    "output": "Stabil bo'lmagan, iqtisodiy muammolarga duch kelayotgan yoki siyosiy noaniqliklar mavjud valyutalar xavfli bo'lishi mumkin."
  },
  {
    "id": 250,
    "input": "Obligatsiyalarga investitsiya qilishning afzalliklari va xavflari qanday?",
    "output": "Kam risk va barqaror daromad olish imkoniyatlari, lekin inflyatsiya va foiz stavkalarining o'zgarishi xavfi mavjud."
  },
  {
    "id": 251,
    "input": "Sarmoyadorlar uchun ko'rsatiladigan xizmatlar nimalardan iborat?",
    "output": "Moliyaviy maslahat, portfelni boshqarish, soliqlarni optimallashtirish va riskni tahlil qilish."
  },
  {
    "id": 252,
    "input": "Sarmoya kiritishda yuqori riskli aktivlarga qanday yondashish kerak?",
    "output": "Yangi imkoniyatlar yaratish, diversifikatsiya qilish va bozorni ehtiyotkorlik bilan kuzatib borish."
  },
  {
    "id": 253,
    "input": "Iqtisodiy o'sish davrida qanday investitsiya turlari foydali bo'ladi?",
    "output": "Aktsiyalar, ko'chmas mulk va innovatsion startaplar."
  },
  {
    "id": 254,
    "input": "Moliya bozorida trendni qanday aniqlash mumkin?",
    "output": "Texnik tahlil, harakatlanuvchi o'rtacha (MA), va boshqa indikatorlar orqali."
  },
  {
    "id": 255,
    "input": "Investitsiya qilishda eng yaxshi vaqtni tanlash uchun qanday indikatorlardan foydalanish kerak?",
    "output": "Bozor tahlili, iqtisodiy ko'rsatkichlar, va kompaniya moliyaviy hisobotlari."
  },
  {
    "id": 256,
    "input": "Sarmoya kiritishning iqtisodiy xavfini qanday kamaytirish mumkin?",
    "output": "Diversifikatsiya, risklarni boshqarish, va bozorni o'z vaqtida tahlil qilish."
  },
  {
    "id": 257,
    "input": "Avtomatlashtirilgan investitsiya tizimlari qanday ishlaydi?",
    "output": "Algoritmik savdolar va dasturiy ta'minot yordamida aktivlar sotib olish va sotish."
  },
  {
    "id": 258,
    "input": "Bozorni tahlil qilishda fundamental va texnik tahlilning farqi nima?",
    "output": "Fundamental tahlil kompaniyaning moliyaviy holatini o'rganishga qaratilgan, texnik tahlil esa bozor harakatlarini prognoz qilishga qaratilgan."
  },
  {
    "id": 259,
    "input": "Investitsiya portfelini diversifikatsiyalashning qanday afzalliklari bor?",
    "output": "Xatarlarni kamaytirish, bozorning turli sharoitlarida barqaror daromad olish."
  },
  {
    "id": 260,
    "input": "Kriptovalyutalar sarmoya kiritishda qanday xavf va imkoniyatlar yaratadi?",
    "output": "Yuqori daromad olish imkoniyatlari, lekin o'zgaruvchanlik va regulyatsiyalarning noaniqligi."
  },
  {
    "id": 261,
    "input": "Moliya bozorida \"boga\" va \"ayiq\" bozorlari nima?",
    "output": "\"Boga\" bozorida narxlar oshib boradi, \"ayiq\" bozorida esa pasayadi."
  },
  {
    "id": 262,
    "input": "Qimmatli qog'ozlar bozorida spekulyatsiyaning afzalliklari va xavflari qanday?",
    "output": "Yuqori rentabellik imkoniyatlari, ammo katta yo'qotish xavfi ham mavjud."
  },
  {
    "id": 263,
    "input": "Moliya bozorida aktivlar narxini qanday prognoz qilish mumkin?",
    "output": "Fundamental va texnik tahlil, iqtisodiy va siyosiy o'zgarishlarni kuzatish orqali."
  },
  {
    "id": 264,
    "input": "Moliya boshqaruvchisi qanday funksiyalarni bajaradi?",
    "output": "Portfelni boshqarish, investitsiya strategiyasini ishlab chiqish, va risklarni tahlil qilish."
  },
  {
    "id": 265,
    "input": "O'zbekiston moliya bozorida investitsiya qilishning afzalliklari qanday?",
    "output": "Yuqori o'sish potentsiali, yangi sarmoya imkoniyatlari va soliq imtiyozlari."
  },
  {
    "id": 266,
    "input": "Moliya bozorlarida foydalanuvchilarni qanday tartibga solish kerak?",
    "output": "Regulyatorlar yordamida, bozorda adolatli savdolarni ta'minlash va xatarlarni kamaytirish."
  },
  {
    "id": 267,
    "input": "Yillik investitsiya daromadi qanday hisoblanadi?",
    "output": "Sarmoya qiymatining o'zgarishi va dividendlar orqali olingan daromadlar yig'indisi."
  },
  {
    "id": 268,
    "input": "Investitsiya qilishda moliyaviy ko'rsatkichlarni tahlil qilishning o'rni qanday?",
    "output": "Kompaniyaning moliyaviy barqarorligini, rentabelligini va o'sish imkoniyatlarini baholash."
  },
  {
    "id": 269,
    "input": "Investitsiya qilishda atrof-muhit, ijtimoiy va boshqaruv (ESG) omillarini hisobga olish qanday ta'sir qiladi?",
    "output": "Sarmoyadorlarga ijtimoiy mas'uliyatli investitsiyalarni tanlashda yordam beradi, hamda uzoq muddatli daromadni oshiradi."
  },
  {
    "id": 270,
    "input": "Kredit kartalari bilan investitsiya qilishning xavflari nimalar?",
    "output": "Yuqori foiz stavkalari, qarzning ortishi va sarmoyaning qisqa muddatli bo'lishi."
  },
  {
    "id": 271,
    "input": "Xalqaro investitsiya imkoniyatlarini qanday baholash kerak?",
    "output": "Xalqaro bozorlar, valyuta kurslari, siyosiy holat va iqtisodiy barqarorlikni tahlil qilish."
  },
  {
    "id": 272,
    "input": "Moliya bozorida portfelni boshqarishda texnik indikatorlar qanday yordam beradi?",
    "output": "Bozor tendensiyalarini aniqlash, narxlar o'zgarishini prognoz qilish va optimal sotish yoki sotib olish nuqtalarini belgilash."
  },
  {
    "id": 273,
    "input": "Moliya boshqaruvi bo'yicha asosiy strategiyalar qanday?",
    "output": "Portfelni diversifikatsiyalash, risklarni boshqarish, va uzoq muddatli o'sish strategiyalarini ishlab chiqish."
  },
  {
    "id": 274,
    "input": "Kichik bizneslarga investitsiya qilishda qanday risklar mavjud?",
    "output": "Bozor o'zgaruvchanligi, raqobatning oshishi va kompaniya boshqaruvining muammolari."
  },
  {
    "id": 275,
    "input": "Aktsiyalarga investitsiya qilishda qanday soliq to'lovlari bo'lishi mumkin?",
    "output": "Dividendlar, sotishdan olingan foyda va boshqa kapital o'zgarishlariga soliq solinishi mumkin."
  },
  {
    "id": 276,
    "input": "Ijtimoiy mas'uliyatli investitsiya (SRI) nima?",
    "output": "Jamiyat va atrof-muhitga ta'sir qiladigan, lekin foyda keltiradigan investitsiyalarni tanlash."
  },
  {
    "id": 277,
    "input": "Investitsiyalarni nazorat qilishda qanday regulyatorlar mavjud?",
    "output": "Milliy va xalqaro regulyatorlar, masalan, Markaziy banklar, moliya vazirliklari va qimmatli qog'ozlar bozorlarini nazorat qiluvchi organlar."
  },
  {
    "id": 278,
    "input": "Davlat mablag'larini qanday investitsiya qilish mumkin?",
    "output": "Davlat obligatsiyalarini sotib olish yoki davlat tomonidan qo'llab-quvvatlanadigan loyihalarda sarmoya kiritish."
  },
  {
    "id": 279,
    "input": "Kriptovalyutalar bilan ishlashda xavfsizlikni ta'minlash qanday amalga oshiriladi?",
    "output": "Kriptovalyutalarni xavfsiz saqlash uchun maxfiy kalitlarni himoya qilish va xavfsiz savdolarni amalga oshirish zarur."
  },
  {
    "id": 280,
    "input": "Investitsiya bozoridagi psixologik ta'sirlar qanday ishlaydi?",
    "output": "Bozor ishtirokchilari hissiy qarorlar qabul qilishadi, bu esa bozorning o'zgaruvchanligini keltirib chiqaradi."
  },
  {
    "id": 281,
    "input": "Avtomatik investitsiya tizimlarining afzalliklari nimalar?",
    "output": "Xatolarsiz, tezkor savdolar va bozorni kuzatish imkoniyatlarini yaratadi, shuningdek, xarajatlarni kamaytiradi."
  },
  {
    "id": 282,
    "input": "Sarmoya kiritishda maxfiylikni saqlash qanday ta'minlanadi?",
    "output": "Shaxsiy ma'lumotlarni himoya qilish, va maxfiy shartnomalar va xavfsizlik protokollarini qo'llash."
  },
  {
    "id": 283,
    "input": "Global moliya bozorlarida investitsiya qilishda qanday valyutalar xavfli bo'lishi mumkin?",
    "output": "Stabil bo'lmagan, iqtisodiy muammolarga duch kelayotgan yoki siyosiy noaniqliklar mavjud valyutalar xavfli bo'lishi mumkin."
  },
  {
    "id": 284,
    "input": "Obligatsiyalarga investitsiya qilishning afzalliklari va xavflari qanday?",
    "output": "Kam risk va barqaror daromad olish imkoniyatlari, lekin inflyatsiya va foiz stavkalarining o'zgarishi xavfi mavjud."
  },
  {
    "id": 285,
    "input": "Investitsiya qilishda soliqni qanday optimallashtirish mumkin?",
    "output": "Soliq imtiyozlari, pensiya fondlari va o'zgaruvchan soliq stavkalariga asoslanib, sarmoyalarni joylashtirish."
  },
  {
    "id": 286,
    "input": "Kriptovalyutalar orqali investitsiya qilishning afzalliklari va xavflari qanday?",
    "output": "Yuqori rentabellik imkoniyatlari, lekin o'zgaruvchanlik va regulyatsiya xavfi mavjud."
  },
  {
    "id": 287,
    "input": "Sarmoya kiritishda \"forex\" bozorida ishlashning qanday xususiyatlari bor?",
    "output": "Yirik likvidlik, ammo yuqori risklar va tezkor bozor o'zgarishlari."
  },
  {
    "id": 288,
    "input": "Bozorni tahlil qilishda \"fundamental tahlil\" va \"texnik tahlil\"ni qanday birlashtirish mumkin?",
    "output": "Ikkala tahlilni birga qo'llash, bozorning iqtisodiy holatini va narx harakatlarini o'rganish."
  },
  {
    "id": 289,
    "input": "Iqtisodiy krizisda investitsiya qilish uchun qanday strategiyalarni qo'llash mumkin?",
    "output": "Xavfsiz aktivlarga sarmoya kiritish, qisqa muddatli investitsiyalar va aktivlarni diversifikatsiya qilish."
  },
  {
    "id": 290,
    "input": "O'zbekiston moliya bozorida yangi texnologiyalarni qo'llashning imkoniyatlari qanday?",
    "output": "Fintech loyihalari, onlayn sarmoya kiritish va raqamli aktivlar yordamida yangi imkoniyatlar yaratilmoqda."
  },
  {
    "id": 291,
    "input": "Aktsiyalarni tanlashda qanday moliyaviy ko'rsatkichlar muhim?",
    "output": "Rentabellik, likvidlik, qarz-to'lov koeffitsienti va kompaniyaning umumiy moliyaviy holati."
  },
  {
    "id": 292,
    "input": "Sarmoya kiritishda psixologik faktorlarga qanday e'tibor berish kerak?",
    "output": "Hissiy qarorlar qabul qilishdan saqlanish, sabr-toqat va uzoq muddatli strategiyalarga sodiqlik."
  },
  {
    "id": 293,
    "input": "Moliya bozoridagi foiz stavkalari va ularning ta'siri qanday?",
    "output": "Yuqori foiz stavkalari sarmoya qilishni qiyinlashtiradi, ammo joriy foizlardan daromad olish imkoniyatini oshiradi."
  },
  {
    "id": 294,
    "input": "Ko'chmas mulk investitsiyalarining asosiy afzalliklari qanday?",
    "output": "Barqaror daromad, inflyatsiyaga qarshi himoya va aktivning qiymatining oshishi."
  },
  {
    "id": 295,
    "input": "Kriptovalyutalarga investitsiya qilishda risklarni qanday boshqarish mumkin?",
    "output": "Diversifikatsiya, xavfsiz saqlash va doimiy bozor kuzatuvi orqali."
  },
  {
    "id": 296,
    "input": "O'zgaruvchan bozor sharoitida investitsiyalarni qanday optimallashtirish mumkin?",
    "output": "Xavfni minimallashtirish, likvidlikni saqlash va qisqa muddatli investitsiya strategiyalarini qo'llash."
  },
  {
    "id": 297,
    "input": "Sarmoya qilishda qanday iqtisodiy ko'rsatkichlar muhim?",
    "output": "Ishsizlik darajasi, inflyatsiya, o'sish sur'atlari va xususiy sektorga bo'lgan talab."
  },
  {
    "id": 298,
    "input": "Sarmoya kiritishda \"value investing\" va \"growth investing\" farqlari qanday?",
    "output": "\"Value investing\" kompaniyalarni ular arzondan sotilayotgan vaqtida sotib olishga, \"growth investing\" esa o'sish imkoniyatlariga e'tibor qaratadi."
  },
  {
    "id": 299,
    "input": "Xalqaro sarmoya kiritishda qanday valyutalar bilan ishlash xavflidir?",
    "output": "Barqaror bo'lmagan valyutalar, siyosiy muammolarga duch kelayotgan mamlakatlarning valyutalari xavf tug'diradi."
  },
  {
    "id": 300,
    "input": "Investitsiya portfelini boshqarishda risklarni qanday taqsimlash mumkin?",
    "output": "Aktivlar turiga, bozorlarga va geografik joylashuvga qarab diversifikatsiya qilish."
  },
  {
    "id": 301,
    "input": "Moliya bozorida \"buyuk bozor\" va \"kichik bozor\" turlari qanday farq qiladi?",
    "output": "\"Buyuk bozor\"da ko'plab ishtirokchilar va yuqori likvidlik mavjud, \"kichik bozor\"da esa ko'proq risklar va kamroq likvidlik."
  },
  {
    "id": 302,
    "input": "Xalqaro moliyaviy bozorlar bilan tanishishning qanday afzalliklari bor?",
    "output": "Kengroq diversifikatsiya imkoniyatlari, yuqori rentabellik va yangi bozorlarni o'rganish."
  },
  {
    "id": 303,
    "input": "O'zbekiston moliya bozorida davlat obligatsiyalariga investitsiya qilishning afzalliklari qanday?",
    "output": "Davlat tomonidan kafolatlangan xavfsizlik, past risk va doimiy daromad olish imkoniyati."
  },
  {
    "id": 304,
    "input": "\"Hedging\" strategiyasi nima va qanday ishlaydi?",
    "output": "Hedging - bu riskni kamaytirish uchun aktivlarni qarama-qarshi pozitsiyalar bilan himoya qilish."
  },
  {
    "id": 305,
    "input": "Aktsiyalarni sotib olishda bozorni qanday tahlil qilish kerak?",
    "output": "Narx va hajmni tahlil qilish, kompaniyaning moliyaviy holatini baholash va bozor trendlarini aniqlash."
  },
  {
    "id": 306,
    "input": "Sarmoya kiritishning uzoq muddatli strategiyalaridan qanday foydalanish mumkin?",
    "output": "Kompaniyalar va bozorlar o'zgarishini prognoz qilish, o'sish imkoniyatlarini topish va diversifikatsiya qilish."
  },
  {
    "id": 307,
    "input": "Moliya bozorida \"bull market\" nima va qanday strategiyalarni qo'llash mumkin?",
    "output": "\"Bull market\"da bozor narxlari o'sadi, bu vaqtda o'sishga qaratilgan investitsiya strategiyalarini qo'llash mumkin."
  },
  {
    "id": 308,
    "input": "Raqamli moliya (fintech) imkoniyatlari qanday o'smoqda?",
    "output": "Mobil ilovalar, onlayn kreditlash, va raqamli to'lov tizimlari sarmoya kiritish imkoniyatlarini kengaytiradi."
  },
  {
    "id": 309,
    "input": "Kriptovalyutalar bo'yicha regulyatsiya qanday amalga oshiriladi?",
    "output": "Hukumatlar va xalqaro moliyaviy tashkilotlar tomonidan blockchain texnologiyasini boshqarish va ruxsatnomalar yaratish."
  },
  {
    "id": 310,
    "input": "O'zgaruvchan bozor sharoitida qimmatli qog'ozlar bozorini qanday boshqarish mumkin?",
    "output": "Xavfni tahlil qilish, diversifikatsiya va bozor o'zgarishlariga tezda moslashish."
  },
  {
    "id": 311,
    "input": "Investitsiyalarning asosiy maqsadi qanday bo'lishi kerak?",
    "output": "Moliyaviy maqsadlarni amalga oshirish, passiv daromad olish va kapitalni oshirish."
  },
  {
    "id": 312,
    "input": "Sarmoya kiritish jarayonida qanday ijtimoiy va siyosiy faktorlarni hisobga olish kerak?",
    "output": "Iqtisodiy siyosat, hukumatning fiskal siyosati, bozor regulyatsiyasi va siyosiy barqarorlik."
  },
  {
    "id": 313,
    "input": "Aktsiyalarni sotib olishda bozor bo'shliqidan qanday foydalanish mumkin?",
    "output": "Bozorning kamchiliklaridan foydalanib, undervalued (qiymati past) aktsiyalarni sotib olish."
  },
  {
    "id": 314,
    "input": "\"Crowdfunding\" investitsiya modelining afzalliklari qanday?",
    "output": "Kam xavf bilan yangi bizneslarni moliyalashtirish imkoniyatlari, lekin likvidlik kamligi."
  },
  {
    "id": 315,
    "input": "Portfelni boshqarishda qanday texnologiyalar yordam beradi?",
    "output": "Avtomatik tizimlar, dasturiy tahlil va algoritmik savdolar orqali samarali boshqaruv amalga oshiriladi."
  },
  {
    "id": 316,
    "input": "O'zgaruvchan iqtisodiy sharoitda moliyaviy planni qanday yangilash kerak?",
    "output": "Iqtisodiy o'zgarishlarga qarab, xarajatlarni qisqartirish, aktivlarni diversifikatsiyalash va investitsiyalarni qayta taqsimlash."
  },
  {
    "id": 317,
    "input": "Investitsiya qilishda soliqni qanday optimallashtirish mumkin?",
    "output": "Soliq imtiyozlari, pensiya fondlari va o'zgaruvchan soliq stavkalariga asoslanib, sarmoyalarni joylashtirish."
  },
  {
    "id": 318,
    "input": "Kriptovalyutalar orqali investitsiya qilishning afzalliklari va xavflari qanday?",
    "output": "Yuqori rentabellik imkoniyatlari, lekin o'zgaruvchanlik va regulyatsiya xavfi mavjud."
  },
  {
    "id": 319,
    "input": "Sarmoya kiritishda \"forex\" bozorida ishlashning qanday xususiyatlari bor?",
    "output": "Yirik likvidlik, ammo yuqori risklar va tezkor bozor o'zgarishlari."
  },
  {
    "id": 320,
    "input": "Bozorni tahlil qilishda \"fundamental tahlil\" va \"texnik tahlil\"ni qanday birlashtirish mumkin?",
    "output": "Ikkala tahlilni birga qo'llash, bozorning iqtisodiy holatini va narx harakatlarini o'rganish."
  },
  {
    "id": 321,
    "input": "Iqtisodiy krizisda investitsiya qilish uchun qanday strategiyalarni qo'llash mumkin?",
    "output": "Xavfsiz aktivlarga sarmoya kiritish, qisqa muddatli investitsiyalar va aktivlarni diversifikatsiya qilish."
  },
  {
    "id": 322,
    "input": "O'zbekiston moliya bozorida yangi texnologiyalarni qo'llashning imkoniyatlari qanday?",
    "output": "Fintech loyihalari, onlayn sarmoya kiritish va raqamli aktivlar yordamida yangi imkoniyatlar yaratilmoqda."
  },
  {
    "id": 323,
    "input": "Aktsiyalarni tanlashda qanday moliyaviy ko'rsatkichlar muhim?",
    "output": "Rentabellik, likvidlik, qarz-to'lov koeffitsienti va kompaniyaning umumiy moliyaviy holati."
  },
  {
    "id": 324,
    "input": "Sarmoya kiritishda psixologik faktorlarga qanday e'tibor berish kerak?",
    "output": "Hissiy qarorlar qabul qilishdan saqlanish, sabr-toqat va uzoq muddatli strategiyalarga sodiqlik."
  },
  {
    "id": 325,
    "input": "Moliya bozoridagi foiz stavkalari va ularning ta'siri qanday?",
    "output": "Yuqori foiz stavkalari sarmoya qilishni qiyinlashtiradi, ammo joriy foizlardan daromad olish imkoniyatini oshiradi."
  },
  {
    "id": 326,
    "input": "Ko'chmas mulk investitsiyalarining asosiy afzalliklari qanday?",
    "output": "Barqaror daromad, inflyatsiyaga qarshi himoya va aktivning qiymatining oshishi."
  },
  {
    "id": 327,
    "input": "Kriptovalyutalarga investitsiya qilishda risklarni qanday boshqarish mumkin?",
    "output": "Diversifikatsiya, xavfsiz saqlash va doimiy bozor kuzatuvi orqali."
  },
  {
    "id": 328,
    "input": "O'zgaruvchan bozor sharoitida investitsiyalarni qanday optimallashtirish mumkin?",
    "output": "Xavfni minimallashtirish, likvidlikni saqlash va qisqa muddatli investitsiya strategiyalarini qo'llash."
  },
  {
    "id": 329,
    "input": "Sarmoya qilishda qanday iqtisodiy ko'rsatkichlar muhim?",
    "output": "Ishsizlik darajasi, inflyatsiya, o'sish sur'atlari va xususiy sektorga bo'lgan talab."
  },
  {
    "id": 330,
    "input": "Sarmoya kiritishda \"value investing\" va \"growth investing\" farqlari qanday?",
    "output": "\"Value investing\" kompaniyalarni ular arzondan sotilayotgan vaqtida sotib olishga, \"growth investing\" esa o'sish imkoniyatlariga e'tibor qaratadi."
  },
  {
    "id": 331,
    "input": "Xalqaro sarmoya kiritishda qanday valyutalar bilan ishlash xavflidir?",
    "output": "Barqaror bo'lmagan valyutalar, siyosiy muammolarga duch kelayotgan mamlakatlarning valyutalari xavf tug'diradi."
  },
  {
    "id": 332,
    "input": "Investitsiya portfelini boshqarishda risklarni qanday taqsimlash mumkin?",
    "output": "Aktivlar turiga, bozorlarga va geografik joylashuvga qarab diversifikatsiya qilish."
  },
  {
    "id": 333,
    "input": "Moliya bozorida \"buyuk bozor\" va \"kichik bozor\" turlari qanday farq qiladi?",
    "output": "\"Buyuk bozor\"da ko'plab ishtirokchilar va yuqori likvidlik mavjud, \"kichik bozor\"da esa ko'proq risklar va kamroq likvidlik."
  },
  {
    "id": 334,
    "input": "Xalqaro moliyaviy bozorlar bilan tanishishning qanday afzalliklari bor?",
    "output": "Kengroq diversifikatsiya imkoniyatlari, yuqori rentabellik va yangi bozorlarni o'rganish."
  },
  {
    "id": 335,
    "input": "O'zbekiston moliya bozorida davlat obligatsiyalariga investitsiya qilishning afzalliklari qanday?",
    "output": "Davlat tomonidan kafolatlangan xavfsizlik, past risk va doimiy daromad olish imkoniyati."
  },
  {
    "id": 336,
    "input": "\"Hedging\" strategiyasi nima va qanday ishlaydi?",
    "output": "Hedging - bu riskni kamaytirish uchun aktivlarni qarama-qarshi pozitsiyalar bilan himoya qilish."
  },
  {
    "id": 337,
    "input": "Aktsiyalarni sotib olishda bozorni qanday tahlil qilish kerak?",
    "output": "Narx va hajmni tahlil qilish, kompaniyaning moliyaviy holatini baholash va bozor trendlarini aniqlash."
  },
  {
    "id": 338,
    "input": "Sarmoya kiritishning uzoq muddatli strategiyalaridan qanday foydalanish mumkin?",
    "output": "Kompaniyalar va bozorlar o'zgarishini prognoz qilish, o'sish imkoniyatlarini topish va diversifikatsiya qilish."
  },
  {
    "id": 339,
    "input": "Moliya bozorida \"bull market\" nima va qanday strategiyalarni qo'llash mumkin?",
    "output": "\"Bull market\"da bozor narxlari o'sadi, bu vaqtda o'sishga qaratilgan investitsiya strategiyalarini qo'llash mumkin."
  },
  {
    "id": 340,
    "input": "Raqamli moliya (fintech) imkoniyatlari qanday o'smoqda?",
    "output": "Mobil ilovalar, onlayn kreditlash, va raqamli to'lov tizimlari sarmoya kiritish imkoniyatlarini kengaytiradi."
  },
  {
    "id": 341,
    "input": "Kriptovalyutalar bo'yicha regulyatsiya qanday amalga oshiriladi?",
    "output": "Hukumatlar va xalqaro moliyaviy tashkilotlar tomonidan blockchain texnologiyasini boshqarish va ruxsatnomalar yaratish."
  },
  {
    "id": 342,
    "input": "O'zgaruvchan bozor sharoitida qimmatli qog'ozlar bozorini qanday boshqarish mumkin?",
    "output": "Xavfni tahlil qilish, diversifikatsiya va bozor o'zgarishlariga tezda moslashish."
  },
  {
    "id": 343,
    "input": "Investitsiyalarning asosiy maqsadi qanday bo'lishi kerak?",
    "output": "Moliyaviy maqsadlarni amalga oshirish, passiv daromad olish va kapitalni oshirish."
  },
  {
    "id": 344,
    "input": "Sarmoya kiritish jarayonida qanday ijtimoiy va siyosiy faktorlarni hisobga olish kerak?",
    "output": "Iqtisodiy siyosat, hukumatning fiskal siyosati, bozor regulyatsiyasi va siyosiy barqarorlik."
  },
  {
    "id": 345,
    "input": "Aktsiyalarni sotib olishda bozor bo'shliqidan qanday foydalanish mumkin?",
    "output": "Bozorning kamchiliklaridan foydalanib, undervalued (qiymati past) aktsiyalarni sotib olish."
  },
  {
    "id": 346,
    "input": "\"Crowdfunding\" investitsiya modelining afzalliklari qanday?",
    "output": "Kam xavf bilan yangi bizneslarni moliyalashtirish imkoniyatlari, lekin likvidlik kamligi."
  },
  {
    "id": 347,
    "input": "Portfelni boshqarishda qanday texnologiyalar yordam beradi?",
    "output": "Avtomatik tizimlar, dasturiy tahlil va algoritmik savdolar orqali samarali boshqaruv amalga oshiriladi."
  },
  {
    "id": 348,
    "input": "O'zgaruvchan iqtisodiy sharoitda moliyaviy planni qanday yangilash kerak?",
    "output": "Iqtisodiy o'zgarishlarga qarab, xarajatlarni qisqartirish, aktivlarni diversifikatsiyalash va investitsiyalarni qayta taqsimlash."
  },
  {
    "id": 349,
    "input": "Sarmoya kiritishda \"momentum investing\" qanday ishlaydi?",
    "output": "\"Momentum investing\" strategiyasi bozorning o'sib borayotgan tendentsiyalaridan foydalanishni o'z ichiga oladi."
  },
  {
    "id": 350,
    "input": "Moliya bozorida foiz stavkalarining oshishi qanday ta'sir qiladi?",
    "output": "Yuqori foiz stavkalari kredit olishni qiyinlashtiradi va investitsiyalarni qisqartiradi."
  },
  {
    "id": 351,
    "input": "\"Value investing\" va \"growth investing\"ning farqlari qanday?",
    "output": "\"Value investing\" narxining past bo'lgan kompaniyalarga sarmoya kiritish, \"growth investing\" esa yuqori o'sish potentsiali bo'lgan kompaniyalarni tanlashdir."
  },
  {
    "id": 352,
    "input": "Investitsiya qilishda muvaffaqiyatli portfelni qanday tuzish kerak?",
    "output": "Diversifikatsiya, rentabellikni oshirish va risklarni boshqarish orqali muvaffaqiyatli portfel tuziladi."
  },
  {
    "id": 353,
    "input": "Investitsiya jarayonida jamoaning roli qanday?",
    "output": "Jamoaning bilimlari, tajribasi va strategik yondoshuvi investitsiyalarni muvaffaqiyatli boshqarishda muhimdir."
  },
  {
    "id": 354,
    "input": "Sarmoya kiritishdan oldin kompaniyaning moliyaviy holatini qanday tahlil qilish kerak?",
    "output": "Daromadlar, qarzlar, likvidlik va rentabellik ko'rsatkichlarini baholash orqali kompaniyaning kuchli va zaif tomonlarini aniqlash mumkin."
  },
  {
    "id": 355,
    "input": "Kriptovalyutalarda tahlil qilishning qanday usullari mavjud?",
    "output": "Texnik tahlil, fundamental tahlil va on-chain tahlil orqali kriptovalyutalar bozorini o'rganish mumkin."
  },
  {
    "id": 356,
    "input": "Moliya bozorida \"market sentiment\"ni qanday tahlil qilish mumkin?",
    "output": "Investorlarning psixologiyasi va umumiy kayfiyati bozorning yo'nalishini belgilashda muhimdir."
  },
  {
    "id": 357,
    "input": "Investitsiya qilishda passiv va aktiv boshqaruvning farqlari qanday?",
    "output": "Passiv boshqaruvda bozorda o'zgarishlar kuzatiladi, aktiv boshqaruvda esa qattiq qarorlar qabul qilinadi va o'zgarishlarga tezkor javob beriladi."
  },
  {
    "id": 358,
    "input": "Aktsiyalar bozorida qanday tahlil metodlari qo'llaniladi?",
    "output": "Fundamental tahlil, texnik tahlil va kvantitativ tahlil kabi metodlar aktsiyalarni tahlil qilishda qo'llaniladi."
  },
  {
    "id": 359,
    "input": "O'zbekiston bozorida investitsiya qilishda qanday strategiyalarni tanlash mumkin?",
    "output": "Mahalliy iqtisodiyotga mos keladigan risklarni boshqarish, diversifikatsiya va investor uchun mos strategiyalarni ishlab chiqish."
  },
  {
    "id": 360,
    "input": "Davlat obligatsiyalariga investitsiya qilishning xususiyatlari qanday?",
    "output": "Xavfsizlik, past risk va barqaror daromad olish, lekin rentabellik boshqa aktivlar bilan taqqoslaganda past bo'lishi mumkin."
  },
  {
    "id": 361,
    "input": "Investitsiya qilishda tahlil qilish uchun qanday makroiqtisodiy ko'rsatkichlar muhim?",
    "output": "Inflyatsiya, foiz stavkalari, iqtisodiy o'sish sur'atlari va ishsizlik darajasi kabi ko'rsatkichlar muhimdir."
  },
  {
    "id": 362,
    "input": "O'zgaruvchan bozor sharoitida sarmoya kiritishning eng yaxshi usuli qanday?",
    "output": "Diversifikatsiya, xavfni boshqarish va uzoq muddatli strategiyalarni tanlash orqali o'zgaruvchan bozor sharoitida samarali sarmoya qilish mumkin."
  },
  {
    "id": 363,
    "input": "Ko'chmas mulk investitsiyasining risklarini qanday boshqarish kerak?",
    "output": "Bozor tahlili, joylashuvni tanlash va yaxshi boshqaruv strategiyalari orqali ko'chmas mulk risklarini boshqarish mumkin."
  },
  {
    "id": 364,
    "input": "Aktsiyalarni sotib olishda qanday kompaniyalarni tanlash kerak?",
    "output": "O'sish sur'atlari yuqori va mustahkam moliyaviy holatga ega kompaniyalarni tanlash tavsiya etiladi."
  },
  {
    "id": 365,
    "input": "Investitsiyalarni qanday qilib turli sektorlar bo'yicha diversifikatsiya qilish mumkin?",
    "output": "Turli sanoat tarmoqlariga sarmoya kiritish orqali risklarni taqsimlash va balansni yaratish."
  },
  {
    "id": 366,
    "input": "Forex bozorida qanday xavf va foydalarni baholash mumkin?",
    "output": "Forex bozorining yuqori likvidligi va tezkor savdo imkoniyatlari mavjud, lekin o'zgaruvchanlik xavfi mavjud."
  },
  {
    "id": 367,
    "input": "Kriptovalyutalar bozorida investitsiyalarni qanday boshqarish kerak?",
    "output": "Diversifikatsiya, xavfsiz saqlash vositalarini tanlash va o'zgaruvchanlikni kuzatish kerak."
  },
  {
    "id": 368,
    "input": "Sarmoya kiritishda foiz stavkalarining qanday o'zgarishlari ta'sir qiladi?",
    "output": "Yuksalgan foiz stavkalari kredit xarajatlarini oshiradi, past foiz stavkalari esa sarmoya qilishni jozibador qiladi."
  },
  {
    "id": 369,
    "input": "Davlat tomonidan taqdim etilgan moliyaviy rag'batlar qanday sarmoya qilishni rag'batlantiradi?",
    "output": "Davlat imtiyozlari, subsidiyalar, past soliq stavkalari va boshqa rag'batlar sarmoya qilishni jozibador qiladi."
  },
  {
    "id": 370,
    "input": "\"Risk-return trade-off\" qanday ishlaydi?",
    "output": "Yuqori risklar ko'proq rentabellik imkoniyatlarini yaratadi, lekin bu bilan xavf ham oshadi."
  },
  {
    "id": 371,
    "input": "Kriptovalyutalarning kelajagi haqida qanday prognozlar mavjud?",
    "output": "Texnologiyaning rivojlanishi, regulyatsiya va xalqaro talabga qarab, kriptovalyutalarning roli o'zgarishi mumkin."
  },
  {
    "id": 372,
    "input": "Forex bozorida \"leverage\"ni qanday boshqarish kerak?",
    "output": "\"Leverage\" orqali savdolarni kengaytirish mumkin, ammo yuqori leverage risklarni ham oshiradi, shuning uchun ehtiyotkorlik kerak."
  },
  {
    "id": 373,
    "input": "Aktsiyalar bozorida \"market timing\" strategiyasining afzalliklari va kamchiliklari qanday?",
    "output": "\"Market timing\" bozor o'zgarishlarini oldindan sezishga asoslangan, ammo bu juda murakkab va xavfli bo'lishi mumkin."
  },
  {
    "id": 374,
    "input": "Moliya bozorida \"short selling\" qanday ishlaydi?",
    "output": "\"Short selling\" - bu aktivlarni qarzga olib sotish va narxlar tushganida sotib olib, farqni olish."
  },
  {
    "id": 375,
    "input": "Sarmoya kiritishda o'zgaruvchan bozorlar va barqaror bozorlar orasidagi farq qanday?",
    "output": "O'zgaruvchan bozorlar yuqori risk va likvidlikni taqdim etadi, barqaror bozorlar esa past risk va barqaror daromadlarni taklif etadi."
  },
  {
    "id": 376,
    "input": "Ko'chmas mulk bozorida investitsiya qilishning eng yaxshi joylari qanday aniqlanadi?",
    "output": "Yaxshi joylashuv, infratuzilma rivoji va bozor talabining tahlili asosida eng yaxshi joylar aniqlanadi."
  },
  {
    "id": 377,
    "input": "Investitsiya portfelingizni boshqarishda yangi texnologiyalar qanday yordam beradi?",
    "output": "Avtomatlashtirilgan tizimlar, raqamli platformalar va tahlil dasturlari orqali samarali portfel boshqarish."
  },
  {
    "id": 378,
    "input": "O'zbekiston moliya bozorida sarmoya kiritish uchun qanday qonuniy talablar mavjud?",
    "output": "Ro'yxatga olish, davlat regulyatsiyalari va soliq majburiyatlari, xususan, kapital bozorlarida qatnashish uchun talablar mavjud."
  },
  {
    "id": 379,
    "input": "Sarmoya kiritishda \"dividend growth investing\" strategiyasi qanday ishlaydi?",
    "output": "\"Dividend growth investing\" kompaniyalardan o'sib borayotgan dividendlarni olishga asoslangan strategiyadir."
  },
  {
    "id": 380,
    "input": "Moliya bozorida \"ETF\" va \"mutual funds\" o'rtasidagi farqlar qanday?",
    "output": "ETFlar bozor narxida sotiladi va passiv boshqaruvni taklif qiladi, mutual fondlar esa faqat fond birjalari orqali sotiladi."
  },
  {
    "id": 381,
    "input": "Aktsiyalarning narxi qanday omillarga asoslanadi?",
    "output": "Kompaniyaning moliyaviy holati, bozorning umumiy holati, kompaniyaning o'sish potentsiali, va iqtisodiy ko'rsatkichlar."
  },
  {
    "id": 382,
    "input": "Investitsiya portfelini boshqarishda avtomatlashtirilgan tizimlarning afzalliklari qanday?",
    "output": "Ular vaqtni tejash, tahlilni yanada samarali amalga oshirish va o'zgaruvchan bozor sharoitida tezkor qarorlar qabul qilish imkonini beradi."
  },
  {
    "id": 383,
    "input": "Kriptovalyutalarda sarmoya kiritishda qanday xavflar mavjud?",
    "output": "Xavfsizlik, bozor o'zgaruvchanligi, regulyatorlarning qarorlari va texnologik xatoliklar."
  },
  {
    "id": 384,
    "input": "Moliya bozorida \"arbitrage\" qanday ishlaydi?",
    "output": "Arbitrage - bu bir xil aktivlarning turli bozorlaridagi narxlar farqidan foyda olish strategiyasidir."
  },
  {
    "id": 385,
    "input": "Ko'chmas mulk investitsiyalarini qanday baholash mumkin?",
    "output": "Rentabellik, bozordagi talab, joylashuv va mulkning holatini tahlil qilish orqali baholash mumkin."
  },
  {
    "id": 386,
    "input": "Forex bozorida \"currency pairs\" qanday ishlaydi?",
    "output": "\"Currency pairs\" bir nechta milliy valyutalarning bir-biriga nisbatan qiymatini ko'rsatadi, masalan, EUR/USD."
  },
  {
    "id": 387,
    "input": "Davlat obligatsiyalariga sarmoya kiritishda qanday xavflar mavjud?",
    "output": "Inflyatsiya risklari, foiz stavkalarining o'zgarishi va davlatning kredit qobiliyati."
  },
  {
    "id": 388,
    "input": "Aktsiyalarni sotib olishda qanday tahlil metodlari eng samarali?",
    "output": "Fundamental tahlil (kompaniyaning moliyaviy ko'rsatkichlari) va texnik tahlil (grafikalar va trendlar)."
  },
  {
    "id": 389,
    "input": "Investitsiya qilishda \"growth stocks\" va \"value stocks\"ni qanday tanlash kerak?",
    "output": "O'sish kompaniyalariga yuqori rentabellik, qiymat kompaniyalariga esa past narxlar va stabil daromadlar asosida qaror qabul qilinadi."
  },
  {
    "id": 390,
    "input": "Ko'chmas mulkda kirim olishning eng samarali usullari qanday?",
    "output": "Ijaraga berish, qiymatning oshishi va mulkni sotish orqali kirim olish mumkin."
  },
  {
    "id": 391,
    "input": "Sarmoya kiritishda yuqori risklarni qanday boshqarish kerak?",
    "output": "Diversifikatsiya, hedging va risklarni tahlil qilish orqali yuqori risklarni boshqarish mumkin."
  },
  {
    "id": 392,
    "input": "Investitsiyalarni boshqarishda makroiqtisodiy tahlil qanday yordam beradi?",
    "output": "Iqtisodiy o'zgarishlar, siyosiy holatlar va global tendensiyalarni tahlil qilish orqali risklar va imkoniyatlarni aniqlash."
  },
  {
    "id": 393,
    "input": "Kriptovalyutalar bozoridagi xavflarni qanday kamaytirish mumkin?",
    "output": "Xavfsiz saqlash usullaridan foydalanish, diversifikatsiya va o'zgaruvchanlikni kuzatish orqali xavfni kamaytirish mumkin."
  },
  {
    "id": 394,
    "input": "Forex bozorida \"scalping\" strategiyasi qanday ishlaydi?",
    "output": "Scalping - bu qisqa muddatli savdolarni amalga oshirish va bozorning kichik narx o'zgarishlaridan foyda olishdir."
  },
  {
    "id": 395,
    "input": "Investitsiya portfelini qayta balanslash qanday amalga oshiriladi?",
    "output": "Aktivlar o'rtasida tenglikni saqlash va bozorning o'zgarishiga qarab investitsiya portfelini optimallashtirish."
  },
  {
    "id": 396,
    "input": "Ko'chmas mulk investitsiyalarida \"cap rate\" nima?",
    "output": "\"Cap rate\" - bu ko'chmas mulkning yillik daromadining qiymatiga nisbati, sarmoyaning rentabelligini ko'rsatadi."
  },
  {
    "id": 397,
    "input": "Forex bozorida \"carry trade\" qanday ishlaydi?",
    "output": "\"Carry trade\" - bu past foiz stavkalariga ega bo'lgan valyutani sotib olib, yuqori foiz stavkalariga ega bo'lgan valyutani sotish orqali foyda olish."
  },
  {
    "id": 398,
    "input": "Kriptovalyutalarga investitsiya qilishda qanday huquqiy muammolar mavjud?",
    "output": "Kriptovalyutalarning regulyatsiya qilinmasligi va xavfsizlikning pastligi kabi huquqiy muammolar mavjud."
  },
  {
    "id": 399,
    "input": "Aktsiyalarni sotish va sotib olishda \"stop-loss\" buyurtmasi qanday ishlaydi?",
    "output": "\"Stop-loss\" buyurtmasi aktivning narxi ma'lum bir darajaga tushganida avtomatik ravishda sotishni amalga oshiradi."
  },
  {
    "id": 400,
    "input": "Investitsiya qilishda \"capital gains tax\" qanday ishlaydi?",
    "output": "\"Capital gains tax\" - bu sarmoya qiymatining o'sishi orqali olinadigan daromadlarga solinadigan soliq."
  },
  {
    "id": 401,
    "input": "Kriptovalyutalar bozorida \"mining\" qanday ishlaydi?",
    "output": "\"Mining\" - bu kriptovalyutalarni tasdiqlash va yangi bloklarni yaratish orqali yangi valyutalar olish jarayonidir."
  },
  {
    "id": 402,
    "input": "Forex bozorida \"trend following\" strategiyasi qanday ishlaydi?",
    "output": "\"Trend following\" strategiyasida bozorning mavjud trendiga amal qilinadi, o'sish yoki pasayish yo'nalishida savdo qilish."
  },
  {
    "id": 403,
    "input": "O'zbekistonning moliya bozorida qanday investitsiya imkoniyatlari mavjud?",
    "output": "Aksiyalar, obligatsiyalar, ko'chmas mulk va boshqa lokal investitsiya vositalari mavjud."
  },
  {
    "id": 404,
    "input": "Investitsiya portfelini diversifikatsiya qilishda qanday asboblar foydalidir?",
    "output": "ETFlar, aksiyalar, obligatsiyalar va boshqa turli aktivlar orqali portfel diversifikatsiya qilinadi."
  },
  {
    "id": 405,
    "input": "Moliya bozorida \"high-yield bonds\" nima?",
    "output": "\"High-yield bonds\" yuqori daromad (foiz) taklif qiladigan, lekin yuqori riskga ega bo'lgan obligatsiyalardir."
  },
  {
    "id": 406,
    "input": "Ko'chmas mulkda \"REIT\" (Real Estate Investment Trust) qanday ishlaydi?",
    "output": "REIT - bu ko'chmas mulk bozorida sarmoya kiritish imkoniyatini beruvchi kompaniya, u daromadlarni aksiyadorlarga taqsimlaydi."
  },
  {
    "id": 407,
    "input": "Investitsiya qilishda \"economic moat\" nima?",
    "output": "\"Economic moat\" - kompaniyaning raqobatchilariga nisbatan ustunlik yoki raqobatbardoshligi, bu uning uzoq muddatli rentabelligini ta'minlaydi."
  },
  {
    "id": 408,
    "input": "Aktsiyalarga investitsiya qilishda qanday risklarni hisobga olish kerak?",
    "output": "Bozorning o'zgaruvchanligi, kompaniya moliyaviy holati, sektordagi o'zgarishlar va siyosiy risklar."
  },
  {
    "id": 409,
    "input": "O'zgaruvchan bozor sharoitida investitsiya qilishning eng yaxshi strategiyasi qanday?",
    "output": "Bozorni kuzatib borish, vaqtni to'g'ri tanlash, diversifikatsiya qilish va xavfni boshqarish."
  },
  {
    "id": 410,
    "input": "Investitsiyalarni boshqarish uchun qanday moliyaviy platformalar foydalidir?",
    "output": "Onlayn brokerlar, robo-kengashchilar va boshqa raqamli platformalar orqali sarmoyani boshqarish mumkin."
  },
  {
    "id": 411,
    "input": "\"Passive income\" nima va uni qanday yaratish mumkin?",
    "output": "\"Passive income\" - bu faol ishlamasdan daromad olish usuli, masalan, ko'chmas mulk yoki dividendlar orqali."
  },
  {
    "id": 412,
    "input": "Moliya bozorida \"interest rate risk\" nima?",
    "output": "\"Interest rate risk\" - bu foiz stavkalarining o'zgarishi natijasida investitsiyalarning qiymatining o'zgarishi xavfi."
  },
  {
    "id": 413,
    "input": "Aktsiyalar bozorida \"bull market\" va \"bear market\" o'rtasidagi farqlar qanday?",
    "output": "\"Bull market\" - bozor o'sish davomida, \"bear market\" esa bozor pasayishida bo'ladi."
  },
  {
    "id": 414,
    "input": "Investitsiya qilishda \"short-term\" va \"long-term\" strategiyalarni qanday tanlash kerak?",
    "output": "\"Short-term\" strategiyalar tezkor foyda olishga, \"long-term\" strategiyalar esa uzoq muddatli o'sishga qaratilgan."
  },
  {
    "id": 415,
    "input": "Ko'chmas mulk investitsiyalarida \"location, location, location\" degan gapning ma'nosi qanday?",
    "output": "Ko'chmas mulkning joylashuvi uning qiymatiga va rentabelligiga katta ta'sir ko'rsatadi."
  },
  {
    "id": 416,
    "input": "Investitsiya qilishda \"systematic risk\" va \"unsystematic risk\" o'rtasidagi farq qanday?",
    "output": "\"Systematic risk\" bozorning umumiy xavfi, \"unsystematic risk\" esa kompaniyaga xos xavflar."
  },
  {
    "id": 417,
    "input": "\"Value investing\" strategiyasida qanday kompaniyalar tanlanadi?",
    "output": "Past baholangan va barqaror daromad olishga qodir kompaniyalar tanlanadi."
  },
  {
    "id": 418,
    "input": "Forex bozorida \"pip\" nima?",
    "output": "\"Pip\" - bu valyuta juftliklaridagi eng kichik narx o'zgarishi birlikdir."
  },
  {
    "id": 419,
    "input": "Kriptovalyutalar bozorida \"blockchain\" texnologiyasi qanday ishlaydi?",
    "output": "\"Blockchain\" - bu xavfsiz va shaffof tranzaksiyalarni ta'minlash uchun markazlashmagan tizimdir."
  },
  {
    "id": 420,
    "input": "Aktsiyalarni sotishdan oldin qanday tahlil qilish kerak?",
    "output": "Kompaniyaning moliyaviy holati, bozor tendensiyalari, kompaniyaning raqobatbardoshligi va rentabellik ko'rsatkichlari."
  },
  {
    "id": 421,
    "input": "Investitsiya qilishda \"diversification\" ning roli qanday?",
    "output": "Diversifikatsiya sarmoyaning turli aktivlar o'rtasida taqsimlanishini ta'minlab, risklarni kamaytiradi."
  },
  {
    "id": 422,
    "input": "Ko'chmas mulkda \"equity\" nima?",
    "output": "\"Equity\" - bu mulkning bozor qiymati va unga qo'yilgan qarzlar orasidagi farqni anglatadi."
  },
  {
    "id": 423,
    "input": "Forex bozorida \"spread\" nima?",
    "output": "\"Spread\" - bu bir valyuta juftligi bo'yicha sotish va sotib olish narxi orasidagi farqdir."
  },
  {
    "id": 424,
    "input": "Sarmoya kiritishda qanday soliq siyosatlarini hisobga olish kerak?",
    "output": "Kapital daromadlari, dividendlar va boshqa moliyaviy faoliyatlar bo'yicha soliq majburiyatlarini hisobga olish zarur."
  },
  {
    "id": 425,
    "input": "Moliya bozorida \"liquidity\" nima?",
    "output": "\"Liquidity\" - bu aktivning tezda va qiyinchiliksiz naqd pulga aylanish qobiliyatidir."
  },
  {
    "id": 426,
    "input": "Kriptovalyutalar bozorida \"stablecoin\" nima?",
    "output": "\"Stablecoin\" - bu qiymati stabil bo'lib, odatda valyutalarga yoki boshqa aktivlarga bog'langan kriptovalyutadir."
  },
  {
    "id": 427,
    "input": "Aktsiyalar bozorida \"blue-chip stocks\" nima?",
    "output": "\"Blue-chip stocks\" - bu yuqori rentabellikka ega va mustahkam moliyaviy holatga ega bo'lgan kompaniyalar aksiyalaridir."
  },
  {
    "id": 428,
    "input": "Investitsiya qilishda \"compounding\" (foizning foizga yig'ilishi) qanday ishlaydi?",
    "output": "Foizlar asosida hisoblangan daromadlarni yana sarmoya kiritish orqali qo'shimcha daromad olish imkonini beradi."
  },
  {
    "id": 429,
    "input": "Ko'chmas mulk bozorida \"capital appreciation\" nima?",
    "output": "\"Capital appreciation\" - bu ko'chmas mulk qiymatining vaqt o'tishi bilan oshishini anglatadi."
  },
  {
    "id": 430,
    "input": "Moliya bozorida \"portfolio optimization\" nima?",
    "output": "\"Portfolio optimization\" - bu investitsiyalarning risk va daromadni samarali taqsimlash jarayonidir."
  },
  {
    "id": 431,
    "input": "Investitsiya portfelini boshqarishda \"rebalancing\" nima?",
    "output": "\"Rebalancing\" - bu portfelnig turli aktivlar bo'yicha taqsimlanishini muntazam ravishda tekshirish va moslashtirish jarayonidir."
  },
  {
    "id": 432,
    "input": "Forex bozorida \"lot size\" nima?",
    "output": "\"Lot size\" - bu bir savdo pozitsiyasidagi aktivlarning miqdorini ifodalaydi."
  },
  {
    "id": 433,
    "input": "Kriptovalyutalarda \"wallet\" nima?",
    "output": "\"Wallet\" - bu kriptovalyutalarni saqlash va ularga kirish imkoniyatini beruvchi raqamli hisobdir."
  },
  {
    "id": 434,
    "input": "Aktsiyalarni sotib olishda \"market order\" va \"limit order\" o'rtasidagi farq qanday?",
    "output": "\"Market order\" bozor narxida sotib olishni anglatadi, \"limit order\" esa belgilangan narxda savdo qilishni nazarda tutadi."
  },
  {
    "id": 435,
    "input": "Investitsiya qilishda \"market volatility\"ning ta'siri qanday?",
    "output": "Bozorning o'zgaruvchanligi sarmoya kiritishning xavfini oshiradi, ammo yuqori rentabellik imkoniyatlarini ham yaratadi."
  },
  {
    "id": 436,
    "input": "\"Futures\" va \"options\" o'rtasidagi farq nima?",
    "output": "\"Futures\" - bu kelajakda ma'lum bir narx bo'yicha aktivni sotib olish yoki sotish majburiyatini bildiradi, \"options\" esa faqat huquqni beradi, majburiyat emas."
  },
  {
    "id": 437,
    "input": "Kriptovalyutalarda \"staking\" nima?",
    "output": "\"Staking\" - bu kriptovalyutalar tarmog'ida ishtirok etish va tarmoqni qo'llab-quvvatlash orqali daromad olish usulidir."
  },
  {
    "id": 438,
    "input": "Forex bozorida \"fundamental analysis\" qanday ishlaydi?",
    "output": "\"Fundamental analysis\" - bu iqtisodiy ko'rsatkichlar, siyosiy voqealar va boshqa omillarni tahlil qilish orqali bozorning kelajagini bashorat qilishdir."
  },
  {
    "id": 439,
    "input": "Ko'chmas mulk bozorida \"gross rental yield\" nima?",
    "output": "\"Gross rental yield\" - bu ko'chmas mulkdan olinadigan yillik ijaraning bozor qiymatiga nisbatan foizini ko'rsatadi."
  },
  {
    "id": 440,
    "input": "Kriptovalyutalarda \"mining pool\" nima?",
    "output": "\"Mining pool\" - bu bir guruh minerlarning birgalikda ishlashlari va yangi bloklarni tasdiqlash orqali daromad olishlari."
  },
  {
    "id": 441,
    "input": "Sarmoya kiritishda \"asset allocation\" qanday ishlaydi?",
    "output": "\"Asset allocation\" - bu turli aktivlarga sarmoya kiritishni taqsimlash orqali riskni boshqarish va rentabellikni oshirish."
  },
  {
    "id": 442,
    "input": "Aktsiyalar bozorida \"IPO\" nima?",
    "output": "\"IPO\" (Initial Public Offering) - bu kompaniyaning birinchi marta ommaga aktsiyalarini taklif qilish jarayonidir."
  },
  {
    "id": 443,
    "input": "Investitsiya qilishda \"emerging markets\" haqida qanday fikrda bo'lish kerak?",
    "output": "\"Emerging markets\" - bu rivojlanayotgan mamlakatlardagi bozorlar, yuqori o'sish imkoniyatlari bilan, ammo yuqori risklar bilan ham tavsiflanadi."
  },
  {
    "id": 444,
    "input": "Moliya bozorida \"volatility index\" (VIX) nima?",
    "output": "\"VIX\" bozorning o'zgaruvchanligini o'lchovchi indeks bo'lib, investorlarning xavfga qarshi reaktsiyasini ko'rsatadi."
  },
  {
    "id": 445,
    "input": "Investitsiya qilishda \"S&P 500\" indeksi qanday ishlaydi?",
    "output": "\"S&P 500\" indeksi AQShning eng yirik 500 kompaniyasining aksiyalarini o'z ichiga oladi va bozorning umumiy holatini ko'rsatadi."
  },
  {
    "id": 446,
    "input": "Aktsiyalarga investitsiya qilishda \"technical analysis\" qanday ishlaydi?",
    "output": "\"Technical analysis\" bozor harakatlari va grafikalar asosida narxlarni bashorat qilishni nazarda tutadi."
  },
  {
    "id": 447,
    "input": "Ko'chmas mulk investitsiyalarida \"gross rental income\" nima?",
    "output": "\"Gross rental income\" - bu ko'chmas mulkni ijaraga berishdan olingan umumiy daromadni anglatadi."
  },
  {
    "id": 448,
    "input": "Moliya bozorida \"asset bubble\" nima?",
    "output": "\"Asset bubble\" - bu aktivlarning narxlarining sun'iy ravishda oshishi va oxir-oqibat portlashidir."
  },
  {
    "id": 449,
    "input": "Kriptovalyutalar bozorida \"decentralized finance (DeFi)\" nima?",
    "output": "\"DeFi\" - bu markazlashmagan va moliyaviy xizmatlarni blockchain texnologiyasi orqali taqdim etuvchi tizimdir."
  },
  {
    "id": 450,
    "input": "Sarmoya kiritishda \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu aktivni bozorga chiqarishda naqd pulga aylantirishda yuzaga keladigan qiyinchiliklarni anglatadi."
  },
  {
    "id": 451,
    "input": "Forex bozorida \"carry trade\" qanday ishlaydi?",
    "output": "\"Carry trade\" - bu past foiz stavkalariga ega bo'lgan valyutani sotib olib, yuqori foiz stavkalariga ega bo'lgan valyutani sotish orqali foyda olish strategiyasidir."
  },
  {
    "id": 452,
    "input": "Aktsiyalar bozorida \"dividend yield\" qanday hisoblanadi?",
    "output": "\"Dividend yield\" - bu kompaniyaning yillik dividendlari va uning aksiyasining narxi o'rtasidagi nisbati."
  },
  {
    "id": 453,
    "input": "Moliya bozorida \"bullish\" va \"bearish\" tahlil qanday farq qiladi?",
    "output": "\"Bullish\" - bu bozorning o'sishini bashorat qilish, \"bearish\" esa bozorning pasayishini bashorat qilishdir."
  },
  {
    "id": 454,
    "input": "Ko'chmas mulkda \"REITs\" (Real Estate Investment Trust) qanday ishlaydi?",
    "output": "\"REITs\" - bu ko'chmas mulkni sotish va ijaraga berish orqali daromad olishni osonlashtiradigan kompaniyalar."
  },
  {
    "id": 455,
    "input": "Forex bozorida \"margin trading\" nima?",
    "output": "\"Margin trading\" - bu savdolarni amalga oshirishda qarz olish va savdo hajmini oshirish orqali foyda olish imkoniyatidir."
  },
  {
    "id": 456,
    "input": "Aktsiyalarni sotib olishda \"buy and hold\" strategiyasi qanday ishlaydi?",
    "output": "\"Buy and hold\" - bu uzoq muddatli investitsiya strategiyasidir, unda investor aktsiyalarni uzoq vaqt davomida saqlaydi."
  },
  {
    "id": 457,
    "input": "Kriptovalyutalarda \"hard fork\" va \"soft fork\" farqi nima?",
    "output": "\"Hard fork\" - blockchain tarmog'ida jiddiy o'zgarishlarni, \"soft fork\" esa kichik o'zgarishlarni bildiradi."
  },
  {
    "id": 458,
    "input": "Ko'chmas mulk investitsiyalarida \"appreciation\" nima?",
    "output": "\"Appreciation\" - bu ko'chmas mulkning qiymatining vaqt o'tishi bilan oshishini anglatadi."
  },
  {
    "id": 459,
    "input": "Moliya bozorida \"asset allocation\" qanday ishlaydi?",
    "output": "\"Asset allocation\" - bu turli xil aktivlarga sarmoya kiritishni taqsimlash orqali risklarni boshqarish va daromad olishdir."
  },
  {
    "id": 460,
    "input": "Kriptovalyutalar bozorida \"fork\" nima?",
    "output": "\"Fork\" - bu blockchain tarmog'ida yangi versiyaning yuzaga kelishi, tarmoqni ikkiga bo'lishi yoki yangi tizimni yaratishidir."
  },
  {
    "id": 461,
    "input": "Investitsiya qilishda \"inflation risk\" nima?",
    "output": "\"Inflation risk\" - bu inflyatsiyaning oshishi natijasida investitsiyalarning qiymatining kamayishi xavfi."
  },
  {
    "id": 462,
    "input": "Aktsiyalarni sotib olishda \"value investing\" strategiyasida nimalar ko'rib chiqiladi?",
    "output": "Past baholangan, ammo mustahkam moliyaviy ko'rsatkichlarga ega kompaniyalar tanlanadi."
  },
  {
    "id": 463,
    "input": "Moliya bozorida \"portfolio diversification\" nima?",
    "output": "\"Portfolio diversification\" - bu risklarni kamaytirish va rentabellikni oshirish uchun aktivlar turli kategoriyalariga sarmoya kiritishdir."
  },
  {
    "id": 464,
    "input": "Ko'chmas mulkda \"net operating income\" (NOI) nima?",
    "output": "\"NOI\" - bu ko'chmas mulkning ijaradan olinadigan daromaddan uning harajatlarini (masalan, ta'mirlash va soliqlar) chiqarib tashlash orqali olinadigan sof daromaddir."
  },
  {
    "id": 465,
    "input": "Kriptovalyutalar bozorida \"decentralized exchange\" nima?",
    "output": "\"Decentralized exchange\" - bu markazlashmagan platformalarda kriptovalyutalarni sotish va sotib olish imkonini beradi."
  },
  {
    "id": 466,
    "input": "Aktsiyalar bozorida \"momentum investing\" nima?",
    "output": "\"Momentum investing\" - bu bozorning o'sish yoki pasayish yo'nalishini kuzatib, ushbu yo'nalishda sarmoya kiritish strategiyasidir."
  },
  {
    "id": 467,
    "input": "Ko'chmas mulkda \"capital gains tax\" nima?",
    "output": "\"Capital gains tax\" - bu ko'chmas mulkning sotilishidan olingan foyda ustidan to'lanadigan soliqdir."
  },
  {
    "id": 468,
    "input": "Kriptovalyutalarda \"whale\" nima?",
    "output": "\"Whale\" - bu katta miqdorda kriptovalyutaga ega bo'lgan va bozorda katta ta'sir ko'rsatuvchi investorni anglatadi."
  },
  {
    "id": 469,
    "input": "Forex bozorida \"spread betting\" nima?",
    "output": "\"Spread betting\" - bu valyutalar yoki boshqa aktivlar narxining oshishini yoki pasayishini bashorat qilish orqali foyda olish strategiyasidir."
  },
  {
    "id": 470,
    "input": "Aktsiyalarga investitsiya qilishda \"growth investing\" strategiyasi qanday ishlaydi?",
    "output": "\"Growth investing\" - bu yuqori o'sish potentsialiga ega bo'lgan kompaniyalarni tanlashni nazarda tutadi."
  },
  {
    "id": 471,
    "input": "Ko'chmas mulkda \"leasehold\" va \"freehold\" o'rtasidagi farq nima?",
    "output": "\"Leasehold\" - bu mulkni cheklangan muddatga ijaraga olishni anglatadi, \"freehold\" esa mulkni to'liq egallashni bildiradi."
  },
  {
    "id": 472,
    "input": "Kriptovalyutalarda \"halving\" nima?",
    "output": "\"Halving\" - bu blokni tasdiqlash uchun minerlarga beriladigan mukofot miqdorining yarimga kamayishi jarayonidir."
  },
  {
    "id": 473,
    "input": "Moliya bozorida \"counterparty risk\" nima?",
    "output": "\"Counterparty risk\" - bu savdo qilinayotgan tomonning o'z majburiyatlarini bajarish imkoniyatining yo'qligi xavfi."
  },
  {
    "id": 474,
    "input": "Aktsiyalarga investitsiya qilishda \"index funds\" qanday ishlaydi?",
    "output": "\"Index funds\" - bu bozorning umumiy holatini aks ettiruvchi, passiv boshqaruv orqali sarmoya kiritadigan investitsiya fondlaridir."
  },
  {
    "id": 475,
    "input": "Ko'chmas mulkda \"capital structure\" nima?",
    "output": "\"Capital structure\" - bu ko'chmas mulk kompaniyasining qarzlar va kapitalning qanday taqsimlanganini anglatadi."
  },
  {
    "id": 476,
    "input": "Kriptovalyutalarda \"liquidity mining\" nima?",
    "output": "\"Liquidity mining\" - bu likvidlik ta'minlash orqali foyda olishning bir shaklidir, kriptovalyutalarda savdo hajmini oshirish uchun ishlatiladi."
  },
  {
    "id": 477,
    "input": "Moliya bozorida \"market efficiency\" nima?",
    "output": "\"Market efficiency\" - bu bozorning barcha mavjud axborotlarni tezda aks ettirish qobiliyatidir."
  },
  {
    "id": 478,
    "input": "Kriptovalyutalarda \"smart contract\" nima?",
    "output": "\"Smart contract\" - bu blokcheyn texnologiyasida avtomatik ravishda bajariladigan shartnoma."
  },
  {
    "id": 479,
    "input": "Aktsiyalar bozorida \"day trading\" nima?",
    "output": "\"Day trading\" - bu bir kun ichida savdolarni amalga oshirib, qisqa muddatli narx o'zgarishlaridan foyda olish strategiyasidir."
  },
  {
    "id": 480,
    "input": "Forex bozorida \"liquidity provider\" nima?",
    "output": "\"Liquidity provider\" - bu bozorda aktivlarni tezda sotib olish va sotish uchun likvidlik ta'minlaydigan shaxs yoki tashkilotdir."
  },
  {
    "id": 481,
    "input": "Ko'chmas mulkda \"rental yield\" qanday hisoblanadi?",
    "output": "\"Rental yield\" - bu ko'chmas mulkni ijaraga berishdan olingan yillik daromadning mulkning bozor qiymatiga nisbati."
  },
  {
    "id": 482,
    "input": "Sarmoya qilishda \"risk-adjusted return\" nima?",
    "output": "\"Risk-adjusted return\" - bu sarmoya qilishdan olingan daromadni risk bilan solishtirish orqali o'lchash."
  },
  {
    "id": 483,
    "input": "Kriptovalyutalar bozorida \"altcoins\" nima?",
    "output": "\"Altcoins\" - bu Bitcoin'dan boshqa barcha kriptovalyutalar, masalan, Ethereum, Ripple va boshqa alternativ kriptovalyutalar."
  },
  {
    "id": 484,
    "input": "Aktsiyalar bozorida \"short selling\" qanday ishlaydi?",
    "output": "\"Short selling\" - bu aktivning narxi pasayishi kutilyotganida, uni qarzga olib, keyinchalik arzon narxda sotib olish strategiyasidir."
  },
  {
    "id": 485,
    "input": "Ko'chmas mulkda \"cash flow\" nima?",
    "output": "\"Cash flow\" - bu ko'chmas mulkdan olingan sof naqd pul oqimi, ya'ni ijaraga berishdan olingan daromad va harajatlar farqi."
  },
  {
    "id": 486,
    "input": "Forex bozorida \"leverage\" nima?",
    "output": "\"Leverage\" - bu investorlar tomonidan bozorga kirishda kichik kapital bilan katta pozitsiyalarni ochishga imkon beradigan vositadir."
  },
  {
    "id": 487,
    "input": "Aktsiyalarga investitsiya qilishda \"diversified portfolio\" qanday ishlaydi?",
    "output": "\"Diversified portfolio\" - bu turli xil aktivlar, masalan, aktsiyalar, obligatsiyalar va ko'chmas mulkni birlashtirgan investitsiya portfeli."
  },
  {
    "id": 488,
    "input": "Ko'chmas mulkda \"capital improvement\" nima?",
    "output": "\"Capital improvement\" - bu ko'chmas mulkni yaxshilash yoki yangilash uchun amalga oshiriladigan sarmoya."
  },
  {
    "id": 489,
    "input": "Moliya bozorida \"yield curve\" nima?",
    "output": "\"Yield curve\" - bu turli muddatlarga ega bo'lgan obligatsiyalarning rentabellik darajalarini ko'rsatadigan grafigidir."
  },
  {
    "id": 490,
    "input": "Kriptovalyutalarda \"proof of work\" va \"proof of stake\" o'rtasidagi farq nima?",
    "output": "\"Proof of work\" - bu bloklar tasdiqlash uchun yechish kerak bo'lgan matematik muammolarni o'z ichiga oladi, \"proof of stake\" esa foydalanuvchilarning kriptovalyutaga sarmoya kiritishiga asoslanadi."
  },
  {
    "id": 491,
    "input": "Aktsiyalar bozorida \"market order\" va \"limit order\" farqi qanday?",
    "output": "\"Market order\" - bu hozirgi bozor narxida savdo qilishni anglatadi, \"limit order\" esa faqat belgilangan narxda savdo qilishni anglatadi."
  },
  {
    "id": 492,
    "input": "Ko'chmas mulkda \"vacancy rate\" nima?",
    "output": "\"Vacancy rate\" - bu bo'sh ko'chmas mulkning umumiy ko'chmas mulkdan foizdagi ulushini bildiradi."
  },
  {
    "id": 493,
    "input": "Moliya bozorida \"hedging\" nima?",
    "output": "\"Hedging\" - bu investitsiya riskini kamaytirish uchun qarama-qarshi pozitsiyalarni ochish orqali xavfdan himoya qilishdir."
  },
  {
    "id": 494,
    "input": "Kriptovalyutalarda \"tokenomics\" nima?",
    "output": "\"Tokenomics\" - bu kriptovalyutalarning iqtisodiy tizimini, tokenlarning ishlab chiqilishi va taqsimlanishini o'rganadigan soha."
  },
  {
    "id": 495,
    "input": "Aktsiyalarga investitsiya qilishda \"momentum investing\" strategiyasi qanday ishlaydi?",
    "output": "\"Momentum investing\" - bu narxlar o'sib borayotgan aksiyalarni sotib olish va pasayib borayotganlarni sotish strategiyasidir."
  },
  {
    "id": 496,
    "input": "Forex bozorida \"currency pair\" nima?",
    "output": "\"Currency pair\" - bu ikkita valyutani birgalikda ko'rsatadigan va bir valyutaning qiymati boshqasiga nisbatan o'lchanadigan juftlikdir."
  },
  {
    "id": 497,
    "input": "Ko'chmas mulkda \"equity release\" nima?",
    "output": "\"Equity release\" - bu ko'chmas mulkning mavjud qiymatidan naqd pul olish usuli, odatda qarzdorlikni kamaytirish yoki pensiya uchun ishlatiladi."
  },
  {
    "id": 498,
    "input": "Moliya bozorida \"asset-backed securities\" nima?",
    "output": "\"Asset-backed securities\" - bu ma'lum aktivlarga, masalan, ipoteka kreditlariga, asoslangan qiymatli qog'ozlardir."
  },
  {
    "id": 499,
    "input": "Kriptovalyutalar bozorida \"hash rate\" nima?",
    "output": "\"Hash rate\" - bu blokchainni yaratish jarayonida bajariladigan hisoblashlar sonini bildiradi."
  },
  {
    "id": 500,
    "input": "Aktsiyalarda \"growth investing\" va \"value investing\" o'rtasidagi farq nima?",
    "output": "\"Growth investing\" - bu yuqori o'sish potentsialiga ega kompaniyalarga sarmoya kiritish, \"value investing\" esa past baholangan kompaniyalarni tanlashni anglatadi."
  },
  {
    "id": 501,
    "input": "Ko'chmas mulkda \"buy-to-let\" strategiyasi qanday ishlaydi?",
    "output": "\"Buy-to-let\" - bu ko'chmas mulkni sotib olib, uni ijaraga berish orqali daromad olish strategiyasidir."
  },
  {
    "id": 502,
    "input": "Forex bozorida \"stop-loss order\" nima?",
    "output": "\"Stop-loss order\" - bu zararlarni kamaytirish uchun aktivning qiymati belgilangan narxga tushganda savdo pozitsiyasini yopishni buyuradigan buyruqdir."
  },
  {
    "id": 503,
    "input": "Moliya bozorida \"financial derivatives\" nima?",
    "output": "\"Financial derivatives\" - bu moliyaviy aktivlar qiymatining boshqa aktivlarga nisbatan o'zgarishini kuzatib boradigan vositalardir (masalan, optsionlar va futures)."
  },
  {
    "id": 504,
    "input": "Kriptovalyutalarda \"airdrops\" nima?",
    "output": "\"Airdrops\" - bu kriptovalyutalar yoki tokenlarning bepul tarqatilishi, odatda yangi loyihalar tomonidan amalga oshiriladi."
  },
  {
    "id": 505,
    "input": "Aktsiyalar bozorida \"IPO\" (Initial Public Offering) nima?",
    "output": "\"IPO\" - bu kompaniyaning birinchi marta ommaga aktsiyalarini chiqarish jarayonidir."
  },
  {
    "id": 506,
    "input": "Ko'chmas mulkda \"landlord\" va \"tenant\" o'rtasidagi farq nima?",
    "output": "\"Landlord\" - ko'chmas mulkni ijaraga beruvchi shaxs, \"tenant\" esa uni ijaraga oluvchi shaxsdir."
  },
  {
    "id": 507,
    "input": "Moliya bozorida \"index funds\" nima?",
    "output": "\"Index funds\" - bu bozorning umumiy holatini aks ettiruvchi, passiv boshqaruv orqali sarmoya kiritadigan investitsiya fondlaridir."
  },
  {
    "id": 508,
    "input": "Kriptovalyutalar bozorida \"cold wallet\" va \"hot wallet\" o'rtasidagi farq nima?",
    "output": "\"Cold wallet\" - bu internetga ulanishsiz saqlanadigan kriptovalyuta hamyonidir, \"hot wallet\" esa internetga ulanishi orqali ishlaydi."
  },
  {
    "id": 509,
    "input": "Aktsiyalarga investitsiya qilishda \"fundamental analysis\" nima?",
    "output": "\"Fundamental analysis\" - bu kompaniyaning moliyaviy holatini, boshqaruvini va bozor sharoitlarini o'rganib, investitsiya qarorlarini qabul qilish usulidir."
  },
  {
    "id": 510,
    "input": "Kriptovalyutalarda \"staking\" nima?",
    "output": "\"Staking\" - bu kriptovalyutalar bilan tranzaksiyalarni tasdiqlashda ishtirok etish va mukofot olish uchun tokenlarni blokcheyn tarmog'ida saqlash jarayonidir."
  },
  {
    "id": 511,
    "input": "Forex bozorida \"pip\" nima?",
    "output": "\"Pip\" - bu valyutalar juftligidagi qiymat o'zgarishining eng kichik o'lchov birligidir."
  },
  {
    "id": 512,
    "input": "Ko'chmas mulkda \"mortgage\" nima?",
    "output": "\"Mortgage\" - bu ko'chmas mulkni sotib olish uchun olingan qarz bo'lib, odatda mulkni garovga qo'yish orqali beriladi."
  },
  {
    "id": 513,
    "input": "Aktsiyalar bozorida \"blue-chip stocks\" nima?",
    "output": "\"Blue-chip stocks\" - bu yirik, ishonchli va barqaror daromad keltiradigan kompaniyalarning aksiyalari."
  },
  {
    "id": 514,
    "input": "Moliya bozorida \"systemic risk\" nima?",
    "output": "\"Systemic risk\" - bu butun moliya tizimining barqarorligiga tahdid soladigan xavfdir."
  },
  {
    "id": 515,
    "input": "Kriptovalyutalar bozorida \"whitelist\" nima?",
    "output": "\"Whitelist\" - bu maxsus ro'yxatga kiritilgan, xavfsiz va ishonchli bo'lgan kriptovalyuta yoki tokenlarni anglatadi."
  },
  {
    "id": 516,
    "input": "Ko'chmas mulkda \"refinancing\" nima?",
    "output": "\"Refinancing\" - bu mavjud qarzni yangi shartlar bilan qayta moliyalashtirish jarayonidir."
  },
  {
    "id": 517,
    "input": "Aktsiyalarda \"earnings per share\" (EPS) nima?",
    "output": "\"EPS\" - bu kompaniyaning sof foydasini uning chiqarilgan aksiyalar soniga bo'lish orqali hisoblangan ko'rsatkichdir."
  },
  {
    "id": 518,
    "input": "Forex bozorida \"currency peg\" nima?",
    "output": "\"Currency peg\" - bu valyutaning boshqa bir valyutaga nisbatan doimiy kursda saqlanishi."
  },
  {
    "id": 519,
    "input": "Moliya bozorida \"risk premium\" nima?",
    "output": "\"Risk premium\" - bu investorlar yuqori xavfli investitsiyalardan qo'shimcha daromad olishni kutishadi."
  },
  {
    "id": 520,
    "input": "Kriptovalyutalarda \"airdrop\" qanday ishlaydi?",
    "output": "\"Airdrop\" - bu yangi kriptovalyutalarni bepul tarqatish usuli bo'lib, odatda foydalanuvchilarga tokenlar beriladi."
  },
  {
    "id": 521,
    "input": "Aktsiyalarga investitsiya qilishda \"sector rotation\" nima?",
    "output": "\"Sector rotation\" - bu investitsiyalarni iqtisodiy siklga qarab turli sektorlar o'rtasida taqsimlash strategiyasidir."
  },
  {
    "id": 522,
    "input": "Ko'chmas mulkda \"property management\" nima?",
    "output": "\"Property management\" - bu ko'chmas mulkni ijaraga berish, uni saqlash va ishlashni boshqarish jarayonidir."
  },
  {
    "id": 523,
    "input": "Forex bozorida \"spread\" nima?",
    "output": "\"Spread\" - bu sotish va sotib olish narxlari o'rtasidagi farqdir."
  },
  {
    "id": 524,
    "input": "Moliya bozorida \"capital gain tax\" nima?",
    "output": "\"Capital gain tax\" - bu aktivni sotish orqali olingan foyda ustidan to'lanadigan soliqqa aytiladi."
  },
  {
    "id": 525,
    "input": "Kriptovalyutalarda \"gas fee\" nima?",
    "output": "\"Gas fee\" - bu tranzaktsiyani amalga oshirish uchun kriptovalyuta tarmog'iga to'lanadigan haqdir."
  },
  {
    "id": 526,
    "input": "Aktsiyalarga investitsiya qilishda \"dividend reinvestment plan\" (DRIP) nima?",
    "output": "\"DRIP\" - bu dividendlarni avtomatik ravishda yangi aksiyalarga aylantirish orqali daromad olish tizimidir."
  },
  {
    "id": 527,
    "input": "Ko'chmas mulkda \"title deed\" nima?",
    "output": "\"Title deed\" - bu mulkning qonuniy egasini ko'rsatadigan hujjatdir."
  },
  {
    "id": 528,
    "input": "Forex bozorida \"currency swap\" nima?",
    "output": "\"Currency swap\" - bu ikki tomon o'rtasida valyutalar almashinuvi orqali foiz to'lovlarini taqsimlashdir."
  },
  {
    "id": 529,
    "input": "Moliya bozorida \"alpha\" nima?",
    "output": "\"Alpha\" - bu investitsiyaning bozor rentabelligidan oshgan daromadidir."
  },
  {
    "id": 530,
    "input": "Kriptovalyutalarda \"mining\" nima?",
    "output": "\"Mining\" - bu kriptovalyutalarni ishlab chiqish va tranzaksiyalarni blokcheyn tarmog'ida tasdiqlash jarayonidir."
  },
  {
    "id": 531,
    "input": "Aktsiyalarda \"capital appreciation\" nima?",
    "output": "\"Capital appreciation\" - bu aktivning narxining vaqt o'tishi bilan oshishini anglatadi."
  },
  {
    "id": 532,
    "input": "Ko'chmas mulkda \"zoning\" nima?",
    "output": "\"Zoning\" - bu hududlarning maqsadi va foydalanishiga qarab qonuniy cheklovlarni belgilash tizimidir."
  },
  {
    "id": 533,
    "input": "Forex bozorida \"interest rate differential\" nima?",
    "output": "\"Interest rate differential\" - bu ikki valyuta o'rtasidagi foiz stavkalari farqidir."
  },
  {
    "id": 534,
    "input": "Moliya bozorida \"portfolio rebalancing\" nima?",
    "output": "\"Portfolio rebalancing\" - bu aktivlar bo'yicha taqsimotni qayta ko'rib chiqish va risklarni boshqarish uchun amalga oshiriladi."
  },
  {
    "id": 535,
    "input": "Kriptovalyutalarda \"liquidity pool\" nima?",
    "output": "\"Liquidity pool\" - bu bir nechta investorlarning kriptovalyutalarni saqlash orqali bozorda likvidlikni ta'minlash uchun birlashtirgan fondidir."
  },
  {
    "id": 536,
    "input": "Aktsiyalar bozorida \"stock split\" nima?",
    "output": "\"Stock split\" - bu kompaniyaning mavjud aksiyalarini ko'paytirish, ammo har bir aksiyaning qiymatini kamaytirish jarayonidir."
  },
  {
    "id": 537,
    "input": "Ko'chmas mulkda \"escrow account\" nima?",
    "output": "\"Escrow account\" - bu sotuvchi va xaridor o'rtasida amalga oshiriladigan tranzaksiyalarda uchinchi tomon tomonidan saqlanadigan hisobdir."
  },
  {
    "id": 538,
    "input": "Forex bozorida \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu pozitsiyani yopish yoki aktivni sotish uchun yetarli likvidlikning yo'qligi xavfi."
  },
  {
    "id": 539,
    "input": "Moliya bozorida \"volatility\" nima?",
    "output": "\"Volatility\" - bu bozor narxlarining o'zgaruvchanligini, ya'ni narxlarining yuqori darajada siljishiga asoslangan riskni anglatadi."
  },
  {
    "id": 540,
    "input": "Kriptovalyutalarda \"fork\" nima?",
    "output": "\"Fork\" - bu blokcheynning yangi versiyasini yaratish yoki mavjud tarmoqni ikkiga bo'lish jarayonidir."
  },
  {
    "id": 541,
    "input": "Aktsiyalarga investitsiya qilishda \"market capitalization\" nima?",
    "output": "\"Market capitalization\" - bu kompaniyaning umumiy bozor qiymatini ifodalaydi, ya'ni aksiyalarining soni va ularning bozor narxining ko'paytmasi."
  },
  {
    "id": 542,
    "input": "Kriptovalyutalarda \"token burn\" nima?",
    "output": "\"Token burn\" - bu kriptovalyutalarning ma'lum bir qismini yo'qotish yoki yoqib yuborish jarayonidir, bu orqali mavjud tokenlarning qiymatini oshirish maqsad qilingan."
  },
  {
    "id": 543,
    "input": "Forex bozorida \"market maker\" nima?",
    "output": "\"Market maker\" - bu valyuta bozorida likvidlikni ta'minlash va narxlarni o'rnatish uchun doimiy ravishda sotuv va sotib olish buyurtmalarini beradigan bank yoki kompaniyadir."
  },
  {
    "id": 544,
    "input": "Ko'chmas mulkda \"appreciation\" nima?",
    "output": "\"Appreciation\" - bu ko'chmas mulkning qiymatining vaqt o'tishi bilan oshishini anglatadi."
  },
  {
    "id": 545,
    "input": "Aktsiyalar bozorida \"market order\" va \"limit order\" o'rtasidagi farq nima?",
    "output": "\"Market order\" - bu hozirgi bozor narxida savdo qilishni anglatadi, \"limit order\" esa belgilangan narxga erishilganda savdo qilishni talab qiladi."
  },
  {
    "id": 546,
    "input": "Moliya bozorida \"correlation\" nima?",
    "output": "\"Correlation\" - bu ikki yoki undan ortiq aktivlar o'rtasidagi bog'lanish yoki o'zaro ta'sirni ko'rsatuvchi o'lchovdir."
  },
  {
    "id": 547,
    "input": "Kriptovalyutalarda \"hard fork\" va \"soft fork\" farqi nima?",
    "output": "\"Hard fork\" - bu tarmoqning yangi versiyasiga o'tish, eski versiyalarni qo'llab-quvvatlamaydi, \"soft fork\" esa eski versiyalar bilan mos keladigan tarmoq yangilanishidir."
  },
  {
    "id": 548,
    "input": "Aktsiyalarda \"dividend yield\" qanday hisoblanadi?",
    "output": "\"Dividend yield\" - bu kompaniyaning yillik dividend to'lovining uning aksiyalari narxiga nisbati sifatida hisoblanadi."
  },
  {
    "id": 549,
    "input": "Ko'chmas mulkda \"capital gains\" nima?",
    "output": "\"Capital gains\" - bu ko'chmas mulkni sotishdan olingan foyda, sotish narxi va sotib olish narxi orasidagi farqdir."
  },
  {
    "id": 550,
    "input": "Forex bozorida \"pipette\" nima?",
    "output": "\"Pipette\" - bu valyutalar narxidagi o'zgarishning yanada kichikroq o'lchov birligidir, odatda birinchi raqamli \"pip\"ning to'liq decimal qiymati hisoblanadi."
  },
  {
    "id": 551,
    "input": "Moliya bozorida \"beta\" nima?",
    "output": "\"Beta\" - bu aktivning bozorning umumiy o'zgarishiga nisbatan sezgirlik darajasini ko'rsatadi."
  },
  {
    "id": 552,
    "input": "Kriptovalyutalarda \"initial coin offering\" (ICO) nima?",
    "output": "\"ICO\" - bu yangi kriptovalyutalar yoki tokenlar chiqarilishi va ular orqali sarmoya yig'ish jarayonidir."
  },
  {
    "id": 553,
    "input": "Aktsiyalarda \"value investing\" strategiyasi qanday ishlaydi?",
    "output": "\"Value investing\" - bu past baholangan, ammo barqaror daromad keltirishi mumkin bo'lgan kompaniyalarni tanlash usulidir."
  },
  {
    "id": 554,
    "input": "Ko'chmas mulkda \"real estate investment trust\" (REIT) nima?",
    "output": "\"REIT\" - bu ko'chmas mulkka investitsiya qilishda ishtirok etuvchi, aksiyalarni sotib olish orqali sarmoya qilish imkonini beruvchi tashkilotdir."
  },
  {
    "id": 555,
    "input": "Forex bozorida \"spread betting\" nima?",
    "output": "\"Spread betting\" - bu valyuta juftliklarining qiymatidagi o'zgarishlarga pul tikish orqali foyda olish usulidir."
  },
  {
    "id": 556,
    "input": "Moliya bozorida \"short-term capital gains\" nima?",
    "output": "\"Short-term capital gains\" - bu qisqa muddatli, ya'ni bir yil ichida sotilgan aktivlardan olingan foyda ustidan to'lanadigan soliqqa aytiladi."
  },
  {
    "id": 557,
    "input": "Kriptovalyutalarda \"decentralized exchange\" (DEX) nima?",
    "output": "\"DEX\" - bu markazlashmagan kriptovalyuta almashuv platformasi bo'lib, foydalanuvchilar to'g'ridan-to'g'ri bir-birlariga savdo qilish imkonini beradi."
  },
  {
    "id": 558,
    "input": "Aktsiyalarda \"sector analysis\" nima?",
    "output": "\"Sector analysis\" - bu iqtisodiy sektorlarga, kompaniyalarga va ularning o'zaro bog'lanishlariga e'tibor qaratish orqali investitsiya strategiyasini shakllantirish jarayonidir."
  },
  {
    "id": 559,
    "input": "Ko'chmas mulkda \"leverage\" nima?",
    "output": "\"Leverage\" - bu ko'chmas mulkni sotib olish uchun kreditdan foydalanish orqali kapitalni oshirish usulidir."
  },
  {
    "id": 560,
    "input": "Forex bozorida \"carry trade\" nima?",
    "output": "\"Carry trade\" - bu yuqori foiz stavkasi bo'lgan valyutaga qarshi past foiz stavkasi bo'lgan valyutani sotib olish orqali foyda olish strategiyasidir."
  },
  {
    "id": 561,
    "input": "Moliya bozorida \"arbitrage\" nima?",
    "output": "\"Arbitrage\" - bu bir xil aktivning turli bozorlarida narx farqidan foydalangan holda daromad olish jarayonidir."
  },
  {
    "id": 562,
    "input": "Kriptovalyutalarda \"proof of authority\" nima?",
    "output": "\"Proof of authority\" - bu blokcheyn tarmog'ida tranzaksiyalarni tasdiqlash uchun muayyan ishonchli shaxslar yoki nodlar tomonidan ishlatiladigan tizimdir."
  },
  {
    "id": 563,
    "input": "Aktsiyalarda \"technical analysis\" nima?",
    "output": "\"Technical analysis\" - bu tarixiy narx harakatlari va hajmlarini tahlil qilib, kelajakdagi narx harakatlarini bashorat qilish usulidir."
  },
  {
    "id": 564,
    "input": "Ko'chmas mulkda \"real estate bubble\" nima?",
    "output": "\"Real estate bubble\" - bu ko'chmas mulk narxlarining sun'iy ravishda ko'tarilishi va keyinchalik ularning keskin pasayishi holatini anglatadi."
  },
  {
    "id": 565,
    "input": "Forex bozorida \"synthetic currency pair\" nima?",
    "output": "\"Synthetic currency pair\" - bu ikki valyutaning birgalikda ishlatilishi orqali yaratilgan maxsus valyuta juftligi."
  },
  {
    "id": 566,
    "input": "Moliya bozorida \"capital preservation\" nima?",
    "output": "\"Capital preservation\" - bu investitsiyalarning asosiy kapitallarini saqlab qolish, risklarni minimallashtirishni anglatadi."
  },
  {
    "id": 567,
    "input": "Kriptovalyutalarda \"layer 2 solutions\" nima?",
    "output": "\"Layer 2 solutions\" - bu blokcheynning asosiy tarmog'ini yaxshilash va unga qo'shimcha funktsiyalarni kiritish uchun ishlab chiqilgan texnologiyalardir."
  },
  {
    "id": 568,
    "input": "Aktsiyalarda \"market sentiment\" nima?",
    "output": "\"Market sentiment\" - bu bozor ishtirokchilarining umumiy kayfiyati yoki hissiy holatini, ya'ni optimizm yoki pessimizmni bildiradi."
  },
  {
    "id": 569,
    "input": "Ko'chmas mulkda \"fixed-rate mortgage\" nima?",
    "output": "\"Fixed-rate mortgage\" - bu ipoteka krediti turidir, bunda foiz stavkasi butun qarz muddati davomida o'zgarmaydi."
  },
  {
    "id": 570,
    "input": "Forex bozorida \"currency correlation\" nima?",
    "output": "\"Currency correlation\" - bu ikki valyuta juftligining bir-biriga nisbatan o'zgarishini ko'rsatadigan o'lchovdir."
  },
  {
    "id": 571,
    "input": "Moliya bozorida \"portfolio diversification\" nima?",
    "output": "\"Portfolio diversification\" - bu sarmoyalarni turli xil aktivlarga taqsimlash orqali xavfni kamaytirish strategiyasidir."
  },
  {
    "id": 572,
    "input": "Kriptovalyutalarda \"zero-knowledge proof\" nima?",
    "output": "\"Zero-knowledge proof\" - bu kriptovalyutalarda biror narsaning haqiqatan ham to'g'ri ekanligini isbotlash uchun hech qanday ma'lumotni oshkor qilmasdan amalga oshiriladigan matematik isbotdir."
  },
  {
    "id": 573,
    "input": "Aktsiyalarga investitsiya qilishda \"dividend aristocrats\" nima?",
    "output": "\"Dividend aristocrats\" - bu yillik dividend to'lovlarini uzluksiz oshirib boradigan kompaniyalardir."
  },
  {
    "id": 574,
    "input": "Kriptovalyutalarda \"liquidity mining\" nima?",
    "output": "\"Liquidity mining\" - bu kriptovalyuta almashuvlarida likvidlikni ta'minlash uchun likvidlik havzalariga tokenlar qo'shish va mukofot olish jarayonidir."
  },
  {
    "id": 575,
    "input": "Forex bozorida \"bullish\" va \"bearish\" nima?",
    "output": "\"Bullish\" - bu narxlarning oshishini kutish holati, \"bearish\" esa narxlarning pasayishini kutish holatidir."
  },
  {
    "id": 576,
    "input": "Ko'chmas mulkda \"due diligence\" nima?",
    "output": "\"Due diligence\" - bu investitsiya qilinadigan ko'chmas mulkni yaxshilab tekshirish va uning qiymati, holati, huquqlari haqida ma'lumot yig'ish jarayonidir."
  },
  {
    "id": 577,
    "input": "Aktsiyalarda \"growth investing\" strategiyasi qanday ishlaydi?",
    "output": "\"Growth investing\" - bu tez o'sish potentsialiga ega kompaniyalar aksiyalarini tanlash orqali daromad olish strategiyasidir."
  },
  {
    "id": 578,
    "input": "Moliya bozorida \"leverage ratio\" nima?",
    "output": "\"Leverage ratio\" - bu qarzning kapitalga nisbatan miqdorini ko'rsatadigan moliyaviy ko'rsatkichdir."
  },
  {
    "id": 579,
    "input": "Kriptovalyutalarda \"staking reward\" nima?",
    "output": "\"Staking reward\" - bu kriptovalyutalarni tarmoqda saqlash orqali olingan mukofot yoki foizdir."
  },
  {
    "id": 580,
    "input": "Aktsiyalarda \"market depth\" nima?",
    "output": "\"Market depth\" - bu bozorning sotuv va sotib olish buyurtmalarining hajmini va narxlarini ko'rsatadigan ko'rsatkichdir."
  },
  {
    "id": 581,
    "input": "Ko'chmas mulkda \"gross rental yield\" nima?",
    "output": "\"Gross rental yield\" - bu ko'chmas mulkni ijaraga berishdan olinadigan yillik daromadning uning qiymatiga nisbati."
  },
  {
    "id": 582,
    "input": "Forex bozorida \"trading volume\" nima?",
    "output": "\"Trading volume\" - bu ma'lum bir vaqt davomida amalga oshirilgan savdolar sonini yoki miqdorini anglatadi."
  },
  {
    "id": 583,
    "input": "Moliya bozorida \"beta coefficient\" nima?",
    "output": "\"Beta coefficient\" - bu aktivning bozor o'zgarishlariga nisbatan sezgirlik darajasini o'lchaydigan ko'rsatkichdir."
  },
  {
    "id": 584,
    "input": "Kriptovalyutalarda \"yield farming\" nima?",
    "output": "\"Yield farming\" - bu kriptovalyutalarni likvidlik havzalariga qo'shish va undan mukofot olish jarayonidir."
  },
  {
    "id": 585,
    "input": "Aktsiyalarda \"price-to-earnings ratio\" (P/E ratio) nima?",
    "output": "\"P/E ratio\" - bu kompaniyaning aksiyalari narxining uning bir yil ichida olingan sof foydasiga nisbati."
  },
  {
    "id": 586,
    "input": "Ko'chmas mulkda \"leasehold\" va \"freehold\" o'rtasidagi farq nima?",
    "output": "\"Leasehold\" - bu mulkni ijaraga olish, \"freehold\" esa mulkning to'liq va doimiy egaligidir."
  },
  {
    "id": 587,
    "input": "Forex bozorida \"price action\" nima?",
    "output": "\"Price action\" - bu narxlar harakatlari va ularning shaklini tahlil qilish orqali savdo qarorlari qabul qilish usulidir."
  },
  {
    "id": 588,
    "input": "Moliya bozorida \"index fund\" nima?",
    "output": "\"Index fund\" - bu bozorning ma'lum bir indeksini kuzatib boradigan, turli kompaniyalarning aksiyalarini o'z ichiga olgan investitsiya fondidir."
  },
  {
    "id": 589,
    "input": "Kriptovalyutalarda \"cold wallet\" va \"hot wallet\" farqi nima?",
    "output": "\"Cold wallet\" - bu internetdan aloqasi bo'lmagan kriptovalyuta saqlash joyi, \"hot wallet\" esa onlayn saqlash joyidir."
  },
  {
    "id": 590,
    "input": "Aktsiyalarda \"insider trading\" nima?",
    "output": "\"Insider trading\" - bu kompaniyaning ichki ma'lumotlarini ishlatib, uning aksiyalariga investitsiya qilishdir."
  },
  {
    "id": 591,
    "input": "Ko'chmas mulkda \"appraisal\" nima?",
    "output": "\"Appraisal\" - bu mulkning bozor qiymatini baholash jarayonidir."
  },
  {
    "id": 592,
    "input": "Forex bozorida \"stop-loss order\" nima?",
    "output": "\"Stop-loss order\" - bu yo'qotishlarni cheklash uchun belgilangan narxga yetganda avtomatik ravishda sotib olish yoki sotish buyurtmasidir."
  },
  {
    "id": 593,
    "input": "Moliya bozorida \"price-to-book ratio\" (P/B ratio) nima?",
    "output": "\"P/B ratio\" - bu kompaniyaning bozor narxining uning aktivlariga bo'lgan nisbati."
  },
  {
    "id": 594,
    "input": "Kriptovalyutalarda \"proof of stake\" (PoS) nima?",
    "output": "\"PoS\" - bu blokcheyn tarmog'ida tranzaksiyalarni tasdiqlash uchun foydalanuvchilar tomonidan saqlanadigan tokenlar miqdori asosida ishlovchi konsensus mexanizmidir."
  },
  {
    "id": 595,
    "input": "Aktsiyalarda \"earnings report\" nima?",
    "output": "\"Earnings report\" - bu kompaniyaning moliyaviy holati va natijalari haqida rasmiy bayonotdir."
  },
  {
    "id": 596,
    "input": "Ko'chmas mulkda \"mortgage-backed security\" (MBS) nima?",
    "output": "\"MBS\" - bu ipoteka krediti asosida chiqarilgan qimmatli qog'ozlar bo'lib, ularni sotish orqali kapital yig'ish maqsad qilingan."
  },
  {
    "id": 597,
    "input": "Forex bozorida \"leverage\" nima?",
    "output": "\"Leverage\" - bu kichik sarmoya bilan katta savdo hajmiga erishish imkoniyatini beruvchi vositadir."
  },
  {
    "id": 598,
    "input": "Moliya bozorida \"mutual fund\" nima?",
    "output": "\"Mutual fund\" - bu bir nechta investorlardan sarmoya jalb qiluvchi va o'zgaruvchan aktivlar portfelini boshqaradigan investitsiya fondidir."
  },
  {
    "id": 599,
    "input": "Kriptovalyutalarda \"tokenomics\" nima?",
    "output": "\"Tokenomics\" - bu tokenlarning iqtisodiyoti, ya'ni ular qanday ishlaydi, taqsimlanadi va qanchalik foydali bo'lishi haqida o'ylash jarayonidir."
  },
  {
    "id": 600,
    "input": "Aktsiyalarda \"churning\" nima?",
    "output": "\"Churning\" - bu mijozning hisobidagi mablag'larni doimiy ravishda savdoga qo'yish, ko'pincha mijozning manfaatlariga zarar yetkazadi."
  },
  {
    "id": 601,
    "input": "Ko'chmas mulkda \"capital expenditure\" (CapEx) nima?",
    "output": "\"CapEx\" - bu ko'chmas mulkni ta'mirlash, yangilash yoki yaxshilash uchun sarflanadigan kapital xarajatlardir."
  },
  {
    "id": 602,
    "input": "Forex bozorida \"carry trade\" qanday ishlaydi?",
    "output": "\"Carry trade\" - bu yuqori foiz stavkasi bo'lgan valyutalarni sotib olish va past foiz stavkasi bo'lgan valyutalarda qarz olish orqali foyda olish strategiyasidir."
  },
  {
    "id": 603,
    "input": "Moliya bozorida \"market efficiency\" nima?",
    "output": "\"Market efficiency\" - bu bozor narxlari mavjud bozor ma'lumotlarini to'liq aks ettirishi tamoyilidir."
  },
  {
    "id": 604,
    "input": "Kriptovalyutalarda \"hot wallet\" nima?",
    "output": "\"Hot wallet\" - bu kriptovalyutalarni saqlash uchun internetga ulanishi bo'lgan, ammo xavfsizlik jihatidan kamroq ishonchli bo'lgan onlayn hamyon."
  },
  {
    "id": 605,
    "input": "Aktsiyalarda \"capital structure\" nima?",
    "output": "\"Capital structure\" - bu kompaniyaning moliyaviy resurslarining tarkibi, ya'ni qarz va kapitalning nisbati."
  },
  {
    "id": 606,
    "input": "Kriptovalyutalarda \"public key\" va \"private key\" farqi nima?",
    "output": "\"Public key\" - bu kriptovalyutalar bilan tranzaksiyalarni qabul qilish uchun ishlatiladigan ochiq kalit, \"private key\" esa tranzaksiyalarni imzolash uchun maxfiy kalitdir."
  },
  {
    "id": 607,
    "input": "Forex bozorida \"margin call\" nima?",
    "output": "\"Margin call\" - bu investorning hisobida yetarli mablag' bo'lmasa, brokerning qo'shimcha mablag' kiritish talabidir."
  },
  {
    "id": 608,
    "input": "Ko'chmas mulkda \"capital gains tax\" nima?",
    "output": "\"Capital gains tax\" - bu ko'chmas mulkni sotib, sotishdan olingan foyda ustidan to'lanadigan soliqdir."
  },
  {
    "id": 609,
    "input": "Aktsiyalarda \"dividend payout ratio\" qanday hisoblanadi?",
    "output": "\"Dividend payout ratio\" - bu kompaniyaning sof daromadining qancha qismi dividend sifatida tarqatilganini ko'rsatadi."
  },
  {
    "id": 610,
    "input": "Moliya bozorida \"discount rate\" nima?",
    "output": "\"Discount rate\" - bu pulning vaqtga nisbatan qiymatini hisoblashda ishlatiladigan stavkadir."
  },
  {
    "id": 611,
    "input": "Kriptovalyutalarda \"miner\" nima?",
    "output": "\"Miner\" - bu blokcheyn tarmog'ida tranzaksiyalarni tasdiqlash va yangi bloklarni yaratish uchun kriptovalyutani hisoblash orqali mukofot oladigan foydalanuvchidir."
  },
  {
    "id": 612,
    "input": "Aktsiyalarda \"blue-chip stocks\" nima?",
    "output": "\"Blue-chip stocks\" - bu uzoq muddatli barqaror daromadni ta'minlaydigan va bozorning yetakchi kompaniyalariga tegishli aksiyalardir."
  },
  {
    "id": 613,
    "input": "Ko'chmas mulkda \"real estate agent\" va \"real estate broker\" farqi nima?",
    "output": "\"Real estate agent\" - bu ko'chmas mulkni sotish yoki sotib olishda mijozlarga yordam beruvchi shaxs, \"real estate broker\" esa agentlarni boshqaradigan va ko'chmas mulk bitimlarini rasmiylashtiradigan shaxsdir."
  },
  {
    "id": 614,
    "input": "Forex bozorida \"pip\" nima?",
    "output": "\"Pip\" - bu valyuta juftligining narxidagi eng kichik o'zgarishdir, odatda to'rtinchi raqamdagi o'zgarishni anglatadi."
  },
  {
    "id": 615,
    "input": "Moliya bozorida \"debt-to-equity ratio\" nima?",
    "output": "\"Debt-to-equity ratio\" - bu kompaniyaning qarzlari va o'z kapitali o'rtasidagi nisbati."
  },
  {
    "id": 616,
    "input": "Kriptovalyutalarda \"smart contract\" nima?",
    "output": "\"Smart contract\" - bu shartnoma shartlarini avtomatik ravishda bajaradigan, blokcheyn asosida ishlaydigan dasturiy koddir."
  },
  {
    "id": 617,
    "input": "Aktsiyalarda \"index investing\" nima?",
    "output": "\"Index investing\" - bu ma'lum bir bozor indeksiga mos ravishda aktivlarni tanlash va ularga investitsiya qilish strategiyasidir."
  },
  {
    "id": 618,
    "input": "Ko'chmas mulkda \"vacancy rate\" nima?",
    "output": "\"Vacancy rate\" - bu ko'chmas mulkning bo'sh qolgan qismlarining umumiy mulkka nisbati."
  },
  {
    "id": 619,
    "input": "Forex bozorida \"currency peg\" nima?",
    "output": "\"Currency peg\" - bu bir valyutaning boshqa valyutaga yoki tovarga nisbatan o'rnatilgan kursidir."
  },
  {
    "id": 620,
    "input": "Moliya bozorida \"securitization\" nima?",
    "output": "\"Securitization\" - bu aktivlarni qimmatli qog'ozlarga aylantirish jarayonidir, masalan, ipoteka kreditlari."
  },
  {
    "id": 621,
    "input": "Kriptovalyutalarda \"fork\" nima?",
    "output": "\"Fork\" - bu blokcheyn tarmog'ining yangi versiyasiga o'tishni anglatadi, ya'ni tizimning yangi qoidalari yoki protokollari ishlab chiqiladi."
  },
  {
    "id": 622,
    "input": "Aktsiyalarda \"short selling\" nima?",
    "output": "\"Short selling\" - bu aktivning qiymati pasayishini kutib, uni qarzga olish va sotish orqali daromad olish usulidir."
  },
  {
    "id": 623,
    "input": "Ko'chmas mulkda \"depreciation\" nima?",
    "output": "\"Depreciation\" - bu ko'chmas mulkning vaqt o'tishi bilan qiymatining pasayishidir."
  },
  {
    "id": 624,
    "input": "Forex bozorida \"trend following\" nima?",
    "output": "\"Trend following\" - bu bozorning umumiy yo'nalishiga qarab savdo qilish strategiyasidir."
  },
  {
    "id": 625,
    "input": "Moliya bozorida \"liquidity\" nima?",
    "output": "\"Liquidity\" - bu aktivning naqd pulga tezda va zarar ko'rmasdan aylanish qobiliyatidir."
  },
  {
    "id": 626,
    "input": "Kriptovalyutalarda \"blockchain explorer\" nima?",
    "output": "\"Blockchain explorer\" - bu blokcheyn tarmog'idagi tranzaksiyalarni va bloklarni kuzatish uchun ishlatiladigan onlayn vositadir."
  },
  {
    "id": 627,
    "input": "Aktsiyalarda \"fundamental analysis\" nima?",
    "output": "\"Fundamental analysis\" - bu kompaniyaning moliyaviy holati, daromadlari va o'sish potentsialini tahlil qilish orqali investitsiya qarorlarini qabul qilish usulidir."
  },
  {
    "id": 628,
    "input": "Ko'chmas mulkda \"rent-to-price ratio\" nima?",
    "output": "\"Rent-to-price ratio\" - bu ko'chmas mulkni ijaraga berishdan olinadigan yillik daromadning uning bozor qiymatiga nisbati."
  },
  {
    "id": 629,
    "input": "Forex bozorida \"carry trade\" qanday ishlaydi?",
    "output": "\"Carry trade\" - bu yuqori foiz stavkasi bo'lgan valyutani sotib olish va past foiz stavkasi bo'lgan valyutada qarz olish orqali foyda olish usulidir."
  },
  {
    "id": 630,
    "input": "Moliya bozorida \"financial leverage\" nima?",
    "output": "\"Financial leverage\" - bu kompaniyaning o'z kapitalidan tashqari qarz mablag'laridan foydalanishi orqali yuqori daromad olishga urinishidir."
  },
  {
    "id": 631,
    "input": "Kriptovalyutalarda \"node\" nima?",
    "output": "\"Node\" - bu blokcheyn tarmog'ida ma'lumotni saqlovchi va uni tarqatadigan kompyuter yoki qurilmadir."
  },
  {
    "id": 632,
    "input": "Aktsiyalarda \"dividend reinvestment plan\" (DRIP) nima?",
    "output": "\"DRIP\" - bu kompaniyaning dividendlarini qayta investitsiya qilish orqali aksiyalarni yana sotib olish rejasidir."
  },
  {
    "id": 633,
    "input": "Ko'chmas mulkda \"underwriting\" nima?",
    "output": "\"Underwriting\" - bu ko'chmas mulkni sotish uchun ma'lum bir xavfni baholash va unga tegishli siyosatni ishlab chiqish jarayonidir."
  },
  {
    "id": 634,
    "input": "Forex bozorida \"stop-limit order\" nima?",
    "output": "\"Stop-limit order\" - bu narx ma'lum bir nuqtaga yetganda avtomatik ravishda buyurtma berish, lekin belgilangan limitga o'tish kerak."
  },
  {
    "id": 635,
    "input": "Aktsiyalarda \"market capitalization\" nima?",
    "output": "\"Market capitalization\" - bu kompaniyaning bozor qiymatini, ya'ni uning aksiyalarining umumiy qiymatini ifodalaydi."
  },
  {
    "id": 636,
    "input": "Kriptovalyutalarda \"proof of work\" (PoW) nima?",
    "output": "\"PoW\" - bu blokcheyn tarmog'ida tranzaksiyalarni tasdiqlash uchun resurslarni sarflaydigan konsensus mexanizmidir."
  },
  {
    "id": 637,
    "input": "Forex bozorida \"spread\" nima?",
    "output": "\"Spread\" - bu valyuta juftligining sotib olish va sotish narxlari orasidagi farqdir."
  },
  {
    "id": 638,
    "input": "Ko'chmas mulkda \"cash-on-cash return\" nima?",
    "output": "\"Cash-on-cash return\" - bu ko'chmas mulkni ijaraga berishdan olingan yillik daromadning sarmoya qiymatiga nisbati."
  },
  {
    "id": 639,
    "input": "Aktsiyalarda \"value investing\" qanday ishlaydi?",
    "output": "\"Value investing\" - bu bozor narxidan past baholangan va barqaror o'sishga ega kompaniyalarga sarmoya kiritish usulidir."
  },
  {
    "id": 640,
    "input": "Moliya bozorida \"tangible assets\" nima?",
    "output": "\"Tangible assets\" - bu jismoniy mavjud bo'lgan va sotilishi yoki tasvirlanishi mumkin bo'lgan aktivlardir (masalan, yer, binolar)."
  },
  {
    "id": 641,
    "input": "Kriptovalyutalarda \"exchange\" nima?",
    "output": "\"Exchange\" - bu kriptovalyutalarni bir-biriga almashtirish va sotish uchun ishlatiladigan onlayn platformadir."
  },
  {
    "id": 642,
    "input": "Aktsiyalarda \"dividend yield\" qanday hisoblanadi?",
    "output": "\"Dividend yield\" - bu kompaniyaning aksiyalariga to'lanadigan dividendlarning ulushining, aksiyaning bozor narxiga nisbati."
  },
  {
    "id": 643,
    "input": "Ko'chmas mulkda \"zoning\" nima?",
    "output": "\"Zoning\" - bu yerning foydalanish maqsadlari bo'yicha hududga qo'yilgan rasmiy cheklovlardir (masalan, tijorat yoki yashash uchun)."
  },
  {
    "id": 644,
    "input": "Forex bozorida \"risk management\" qanday amalga oshiriladi?",
    "output": "\"Risk management\" - bu o'zgaruvchan bozor sharoitida yo'qotishlarni kamaytirish va foydani maksimal darajaga keltirish uchun turli vositalardan foydalanishdir."
  },
  {
    "id": 645,
    "input": "Moliya bozorida \"mutual fund performance\" qanday o'lchanadi?",
    "output": "\"Mutual fund performance\" - bu fondning investitsiyalarining umumiy daromadi va ularning bozordagi o'rtacha rentabellik bilan solishtirilishidir."
  },
  {
    "id": 646,
    "input": "Kriptovalyutalarda \"gas fee\" nima?",
    "output": "\"Gas fee\" - bu blokcheyn tarmog'ida tranzaksiyani amalga oshirish uchun to'lanadigan to'lovdir."
  },
  {
    "id": 647,
    "input": "Aktsiyalarda \"buyback\" nima?",
    "output": "\"Buyback\" - bu kompaniyaning o'z aksiyalarini bozor narxidan qayta sotib olish jarayonidir."
  },
  {
    "id": 648,
    "input": "Ko'chmas mulkda \"earnings before interest and taxes\" (EBIT) nima?",
    "output": "\"EBIT\" - bu foizlar va soliqdan oldingi daromadni ifodalaydi, ya'ni kompaniyaning asosiy faoliyatidan olinadigan daromadni ko'rsatadi."
  },
  {
    "id": 649,
    "input": "Forex bozorida \"scalping\" nima?",
    "output": "\"Scalping\" - bu qisqa muddatli savdolar orqali kichik narx o'zgarishlaridan foyda olish strategiyasidir."
  },
  {
    "id": 650,
    "input": "Moliya bozorida \"correlation\" nima?",
    "output": "\"Correlation\" - bu ikkita aktivning narxlari o'rtasidagi bog'liqlikni ifodalaydi."
  },
  {
    "id": 651,
    "input": "Kriptovalyutalarda \"hot wallet\" va \"cold wallet\" farqi nima?",
    "output": "\"Hot wallet\" - onlayn saqlanadigan va tez-tez ishlatiladigan kriptovalyuta hamyonidir, \"cold wallet\" esa internetga ulanishi bo'lmagan xavfsiz saqlash usulidir."
  },
  {
    "id": 652,
    "input": "Aktsiyalarda \"momentum investing\" nima?",
    "output": "\"Momentum investing\" - bu aktivning narxi ko'tarilganidan keyin uning trendini davom ettirishga asoslangan investitsiya strategiyasidir."
  },
  {
    "id": 653,
    "input": "Ko'chmas mulkda \"property management\" nima?",
    "output": "\"Property management\" - bu ko'chmas mulkni boshqarish, ijaraga berish va uning texnik holatini saqlash bilan bog'liq xizmatlar majmuasidir."
  },
  {
    "id": 654,
    "input": "Forex bozorida \"hedging\" nima?",
    "output": "\"Hedging\" - bu valyutalardagi potentsial yo'qotishlarni kamaytirish uchun qarama-qarshi pozitsiyalarni ochishdir."
  },
  {
    "id": 655,
    "input": "Moliya bozorida \"asset allocation\" nima?",
    "output": "\"Asset allocation\" - bu investitsiya portfelidagi aktivlarni (aksiyalar, obligatsiyalar, ko'chmas mulk va boshqalar) turli kategoriyalarga taqsimlash jarayonidir."
  },
  {
    "id": 656,
    "input": "Kriptovalyutalarda \"ICO\" nima?",
    "output": "\"ICO\" - bu yangi kriptovalyuta yoki tokenni sarmoyadorlarga sotish orqali kapital jalb qilish jarayonidir (Initial Coin Offering)."
  },
  {
    "id": 657,
    "input": "Aktsiyalarda \"capital gain\" nima?",
    "output": "\"Capital gain\" - bu aktivning sotilishi natijasida olingan foydani anglatadi."
  },
  {
    "id": 658,
    "input": "Ko'chmas mulkda \"debt service coverage ratio\" (DSCR) nima?",
    "output": "\"DSCR\" - bu mulkdan olinadigan daromadning qarz majburiyatlarini qoplashga yetarliligini ko'rsatadigan moliyaviy ko'rsatkichdir."
  },
  {
    "id": 659,
    "input": "Forex bozorida \"order types\" qaysilar?",
    "output": "\"Order types\" - bu savdoni amalga oshirishning turli usullari, masalan, \"market order\", \"limit order\" va \"stop order\"."
  },
  {
    "id": 660,
    "input": "Moliya bozorida \"systematic risk\" nima?",
    "output": "\"Systematic risk\" - bu bozorning umumiy o'zgarishlari, ya'ni iqtisodiy shoklar yoki global inqirozlardan kelib chiqqan riskdir."
  },
  {
    "id": 661,
    "input": "Kriptovalyutalarda \"token\" nima?",
    "output": "\"Token\" - bu blokcheyn tarmog'ida qiymatni ifodalovchi va alohida xizmat yoki resursni anglatadigan raqamli aktivdir."
  },
  {
    "id": 662,
    "input": "Aktsiyalarda \"volatility\" nima?",
    "output": "\"Volatility\" - bu aktivning narxining vaqt o'tishi bilan o'zgarish darajasini ko'rsatadigan ko'rsatkichdir."
  },
  {
    "id": 663,
    "input": "Ko'chmas mulkda \"real estate investment trust\" (REIT) nima?",
    "output": "\"REIT\" - bu ko'chmas mulkka sarmoya kiritishga imkon beradigan, aksiyalarini sotish orqali kapitallarini jalb qiladigan kompaniya yoki fondir."
  },
  {
    "id": 664,
    "input": "Forex bozorida \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu savdolarni amalga oshirishda bozor likvidligining yetishmasligi va yuqori o'zgarishlarni yaratish xavfi."
  },
  {
    "id": 665,
    "input": "Moliya bozorida \"beta\" nima?",
    "output": "\"Beta\" - bu aktivning bozorning umumiy o'zgarishlariga nisbatan sezgirligini ko'rsatuvchi moliyaviy ko'rsatkichdir."
  },
  {
    "id": 666,
    "input": "Aktsiyalarda \"capital structure\" qanday ta'sir qiladi?",
    "output": "\"Capital structure\" kompaniyaning qarz va aksiyalarni qanday taqsimlaganini ko'rsatadi va uning rentabelligiga ta'sir qiladi."
  },
  {
    "id": 667,
    "input": "Kriptovalyutalarda \"hard fork\" va \"soft fork\" farqi nima?",
    "output": "\"Hard fork\" - blokcheynning eski versiyasi bilan mos kelmaslikka olib keladigan yangilanish, \"soft fork\" esa eski versiya bilan ham ishlay oladigan yangilanishdir."
  },
  {
    "id": 668,
    "input": "Forex bozorida \"liquidity provider\" nima?",
    "output": "\"Liquidity provider\" - bu bozorni likvid qilish uchun doimiy ravishda narxlar taklif etadigan va savdolarni amalga oshiradigan tashkilot yoki shaxsdir."
  },
  {
    "id": 669,
    "input": "Ko'chmas mulkda \"capitalization rate\" (cap rate) nima?",
    "output": "\"Cap rate\" - bu ko'chmas mulkdan olinadigan yillik daromadning mulkning bozor qiymatiga nisbati."
  },
  {
    "id": 670,
    "input": "Aktsiyalarda \"beta coefficient\" nima?",
    "output": "\"Beta coefficient\" - bu kompaniyaning aksiyalarining bozor o'zgarishlariga nisbatan sezgirligini ifodalaydigan ko'rsatkichdir."
  },
  {
    "id": 671,
    "input": "Moliya bozorida \"arbitrage\" nima?",
    "output": "\"Arbitrage\" - bu bir bozor va boshqa bozorlar orasidagi narx farqlaridan foyda olish uchun bir vaqtning o'zida sotish va sotib olish jarayonidir."
  },
  {
    "id": 672,
    "input": "Kriptovalyutalarda \"staking\" nima?",
    "output": "\"Staking\" - bu kriptovalyutani blokcheyn tarmog'ida xavfsizlikni ta'minlash uchun ushlab turish va mukofot olish jarayonidir."
  },
  {
    "id": 673,
    "input": "Aktsiyalarda \"risk-adjusted return\" qanday hisoblanadi?",
    "output": "\"Risk-adjusted return\" - bu investitsiyaning qaytishini olingan xavf bilan solishtirib baholashdir."
  },
  {
    "id": 674,
    "input": "Ko'chmas mulkda \"gross rental yield\" nima?",
    "output": "\"Gross rental yield\" - bu ko'chmas mulkning ijaradan olingan daromadning uning bozor qiymatiga nisbati."
  },
  {
    "id": 675,
    "input": "Forex bozorida \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu bozorning likvidligining yetarli bo'lmasligi sababli aktivni tezda sotish yoki sotib olishdagi qiyinchilikdir."
  },
  {
    "id": 676,
    "input": "Moliya bozorida \"interest rate risk\" nima?",
    "output": "\"Interest rate risk\" - bu foiz stavkalarining o'zgarishi natijasida aktivlarning qiymatining o'zgarishi xavfidir."
  },
  {
    "id": 677,
    "input": "Kriptovalyutalarda \"private key\" va \"public key\" farqi nima?",
    "output": "\"Private key\" - bu kriptovalyutani yuborish va boshqarish uchun maxfiy kalit, \"public key\" esa uning qabul qilinishini ta'minlaydigan ochiq kalitdir."
  },
  {
    "id": 678,
    "input": "Aktsiyalarda \"growth investing\" nima?",
    "output": "\"Growth investing\" - bu kompaniyalarining o'sish potentsialiga asoslanib sarmoya kiritish strategiyasidir."
  },
  {
    "id": 679,
    "input": "Ko'chmas mulkda \"cash flow\" nima?",
    "output": "\"Cash flow\" - bu ko'chmas mulkdan olingan daromadlarning, xarajatlar va soliqlardan keyin qolgan qismi."
  },
  {
    "id": 680,
    "input": "Forex bozorida \"position trading\" nima?",
    "output": "\"Position trading\" - bu uzoq muddatli investitsiya strategiyasi bo'lib, bozorning umumiy yo'nalishiga qarab savdo qilishni anglatadi."
  },
  {
    "id": 681,
    "input": "Moliya bozorida \"yield curve\" nima?",
    "output": "\"Yield curve\" - bu turli muddatli obligatsiyalar uchun daromadlar orasidagi bog'liqlikni ko'rsatadigan grafikdir."
  },
  {
    "id": 682,
    "input": "Kriptovalyutalarda \"airdrops\" nima?",
    "output": "\"Airdrops\" - bu yangi kriptovalyutalarni yoki tokenlarni foydalanuvchilarga bepul tarqatish jarayonidir."
  },
  {
    "id": 683,
    "input": "Aktsiyalarda \"technical analysis\" nima?",
    "output": "\"Technical analysis\" - bu aksiyalar narxining o'zgarishlarini va bozordagi tendensiyalarni o'rganish asosida qarorlar qabul qilish usulidir."
  },
  {
    "id": 684,
    "input": "Ko'chmas mulkda \"operating expense ratio\" nima?",
    "output": "\"Operating expense ratio\" - bu ko'chmas mulkni boshqarish va saqlashga sarflangan xarajatlarning uning daromadiga nisbati."
  },
  {
    "id": 685,
    "input": "Forex bozorida \"currency pair\" nima?",
    "output": "\"Currency pair\" - bu ikki valyutaning almashuv kursini ifodalovchi bozor juftligidir."
  },
  {
    "id": 686,
    "input": "Moliya bozorida \"inflation risk\" nima?",
    "output": "\"Inflation risk\" - bu inflyatsiya darajasi oshishi natijasida aktivlarning haqiqiy qiymatining pasayish xavfidir."
  },
  {
    "id": 687,
    "input": "Kriptovalyutalarda \"decetralized finance\" (DeFi) nima?",
    "output": "\"DeFi\" - bu markazlashtirilmagan moliyaviy xizmatlar tarmog'i bo'lib, an'anaviy moliyaviy institutlarga ehtiyojni kamaytiradi."
  },
  {
    "id": 688,
    "input": "Aktsiyalarda \"market order\" va \"limit order\" farqi nima?",
    "output": "\"Market order\" - bu hozirgi bozor narxida aktivni sotib olish yoki sotish buyurtmasi, \"limit order\" esa belgilangan narxga yetganda buyurtmani amalga oshirishdir."
  },
  {
    "id": 689,
    "input": "Ko'chmas mulkda \"real estate cycle\" nima?",
    "output": "\"Real estate cycle\" - bu ko'chmas mulk bozorining turli bosqichlarini, ya'ni inqiroz, tiklanish, o'sish va sovish jarayonlarini ifodalaydi."
  },
  {
    "id": 690,
    "input": "Forex bozorida \"carry trade\" nima?",
    "output": "\"Carry trade\" - bu yuqori foiz stavkali valyutani sotib olish va past foiz stavkali valyutani sotish orqali daromad olish usulidir."
  },
  {
    "id": 691,
    "input": "Moliya bozorida \"duration\" nima?",
    "output": "\"Duration\" - bu obligatsiya narxining foiz stavkalariga nisbatan sezgirligini ko'rsatuvchi ko'rsatkichdir."
  },
  {
    "id": 692,
    "input": "Kriptovalyutalarda \"mining pool\" nima?",
    "output": "\"Mining pool\" - bu bir nechta kriptovalyuta minerlarining o'z resurslarini birlashtirib, mukofotni taqsimlash orqali samarali ishlashini anglatadi."
  },
  {
    "id": 693,
    "input": "Aktsiyalarda \"sector rotation\" nima?",
    "output": "\"Sector rotation\" - bu bozorning o'sish va pasayish davrlarida turli sektorlar orasida sarmoyalarni taqsimlash strategiyasidir."
  },
  {
    "id": 694,
    "input": "Ko'chmas mulkda \"exit strategy\" nima?",
    "output": "\"Exit strategy\" - bu ko'chmas mulkni sarmoya kiritishdan chiqqan vaqt, sotish yoki boshqa variantlarni aniqlashni anglatadi."
  },
  {
    "id": 695,
    "input": "Forex bozorida \"slippage\" nima?",
    "output": "\"Slippage\" - bu buyurtma berilgan narx va haqiqiy amalga oshirilgan narx o'rtasidagi farqdir."
  },
  {
    "id": 696,
    "input": "Moliya bozorida \"cost of equity\" qanday hisoblanadi?",
    "output": "\"Cost of equity\" - bu kompaniyaning aksiyalari uchun investorlar kutgan daromadning minimal miqdori."
  },
  {
    "id": 697,
    "input": "Kriptovalyutalarda \"ERC-20 token\" nima?",
    "output": "\"ERC-20 token\" - bu Ethereum blokcheyn tarmog'ida yaratilgan va umumiy standartga ega bo'lgan tokenlardir."
  },
  {
    "id": 698,
    "input": "Aktsiyalarda \"portfolio diversification\" nima?",
    "output": "\"Portfolio diversification\" - bu sarmoyalarni bir nechta aktivlarga taqsimlash orqali risklarni kamaytirish usulidir."
  },
  {
    "id": 699,
    "input": "Aktsiyalarda \"market order\" nima?",
    "output": "\"Market order\" - bu hozirgi bozor narxida aktivni sotib olish yoki sotish buyurtmasidir."
  },
  {
    "id": 700,
    "input": "Kriptovalyutalarda \"hash rate\" nima?",
    "output": "\"Hash rate\" - bu kriptovalyutalarni qazib olish tezligini ifodalovchi o'lchovdir."
  },
  {
    "id": 701,
    "input": "Forex bozorida \"spread betting\" nima?",
    "output": "\"Spread betting\" - bu aktiv narxlarining o'zgarishidan foyda olish uchun ishlatiladigan savdo usulidir, valyuta yoki boshqa aktivlar bo'yicha."
  },
  {
    "id": 702,
    "input": "Ko'chmas mulkda \"property appraisal\" nima?",
    "output": "\"Property appraisal\" - bu ko'chmas mulkning bozor qiymatini aniqlash uchun bajariladigan baholash jarayonidir."
  },
  {
    "id": 703,
    "input": "Aktsiyalarda \"short selling\" nima?",
    "output": "\"Short selling\" - bu aktivning narxi pasayishi kutilyotganida uni qarzga olish va sotish, so'ngra pastroq narxda sotib olish orqali foyda olish usulidir."
  },
  {
    "id": 704,
    "input": "Moliya bozorida \"commodity\" nima?",
    "output": "\"Commodity\" - bu savdosi va iste'mol qilinishi mumkin bo'lgan tabiiy resurslar yoki qishloq xo'jaligi mahsulotlaridir (masalan, oltin, neft, bug'doy)."
  },
  {
    "id": 705,
    "input": "Kriptovalyutalarda \"blockchain explorer\" nima?",
    "output": "\"Blockchain explorer\" - bu blokcheyn tarmog'ida tranzaksiyalarni va bloklarni kuzatish uchun ishlatiladigan onlayn vositadir."
  },
  {
    "id": 706,
    "input": "Aktsiyalarda \"diversification\" nima?",
    "output": "\"Diversification\" - bu sarmoyalarni turli aktivlar va bozor segmentlariga taqsimlash orqali riskni kamaytirish usulidir."
  },
  {
    "id": 707,
    "input": "Ko'chmas mulkda \"real estate syndication\" nima?",
    "output": "\"Real estate syndication\" - bu bir nechta investorlar birgalikda ko'chmas mulkka sarmoya kiritish orqali foyda olishni anglatadi."
  },
  {
    "id": 708,
    "input": "Forex bozorida \"forex signals\" nima?",
    "output": "\"Forex signals\" - bu bozor tahlili asosida savdolarni amalga oshirish uchun beriladigan tavsiyalar va signallarni ifodalaydi."
  },
  {
    "id": 709,
    "input": "Moliya bozorida \"fixed income\" nima?",
    "output": "\"Fixed income\" - bu doimiy foiz to'lovlari keltiruvchi aktivlar (masalan, obligatsiyalar) bo'lib, ularning qiymati o'zgarmaydi."
  },
  {
    "id": 710,
    "input": "Kriptovalyutalarda \"security token\" nima?",
    "output": "\"Security token\" - bu investitsiyalarga asoslangan, aksiyalarni yoki obligatsiyalarni ifodalovchi kriptovalyuta tokenidir."
  },
  {
    "id": 711,
    "input": "Aktsiyalarda \"buy and hold\" strategiyasi qanday ishlaydi?",
    "output": "\"Buy and hold\" - bu uzoq muddat davomida aktivni saqlash va uning qiymati o'sishini kutish strategiyasidir."
  },
  {
    "id": 712,
    "input": "Ko'chmas mulkda \"landlord\" nima?",
    "output": "\"Landlord\" - bu ko'chmas mulkni ijaraga beruvchi shaxs yoki tashkilotdir."
  },
  {
    "id": 713,
    "input": "Forex bozorida \"margin call\" nima?",
    "output": "\"Margin call\" - bu savdolarni davom ettirish uchun kerakli margin (garov) miqdori yetishmasligini bildiruvchi xabarnomadir."
  },
  {
    "id": 714,
    "input": "Moliya bozorida \"credit risk\" nima?",
    "output": "\"Credit risk\" - bu qarz oluvchining to'lovni amalga oshirmaslik xavfini anglatadi."
  },
  {
    "id": 715,
    "input": "Kriptovalyutalarda \"DAO\" nima?",
    "output": "\"DAO\" - bu markazlashtirilmagan boshqaruv tizimiga ega bo'lgan tashkilotdir (Decentralized Autonomous Organization)."
  },
  {
    "id": 716,
    "input": "Aktsiyalarda \"technical indicators\" nima?",
    "output": "\"Technical indicators\" - bu bozordagi narx harakatlarini tahlil qilishda ishlatiladigan statistik vositalardir (masalan, RSI, MACD)."
  },
  {
    "id": 717,
    "input": "Ko'chmas mulkda \"tenant screening\" nima?",
    "output": "\"Tenant screening\" - bu ijarachini tanlash va uning kredit tarixini, ish faoliyatini va boshqa jihatlarni tekshirish jarayonidir."
  },
  {
    "id": 718,
    "input": "Forex bozorida \"over-the-counter\" (OTC) savdolar nima?",
    "output": "\"OTC\" savdolar - bu birja orqali emas, balki bevosita ikki tomon o'rtasida amalga oshiriladigan savdolarni anglatadi."
  },
  {
    "id": 719,
    "input": "Moliya bozorida \"capital gain tax\" nima?",
    "output": "\"Capital gain tax\" - bu aktivni sotish orqali olinadigan foyda ustidan to'lanadigan soliqlardir."
  },
  {
    "id": 720,
    "input": "Kriptovalyutalarda \"cold storage\" nima?",
    "output": "\"Cold storage\" - bu kriptovalyutalarni internetga ulanmagan, xavfsiz joylarda saqlash usulidir."
  },
  {
    "id": 721,
    "input": "Aktsiyalarda \"price-to-earnings ratio\" (P/E ratio) nima?",
    "output": "\"P/E ratio\" - bu kompaniyaning aktsiyalarining bozor narxining uning yillik foydasiga nisbati."
  },
  {
    "id": 722,
    "input": "Ko'chmas mulkda \"depreciation\" nima?",
    "output": "\"Depreciation\" - bu ko'chmas mulkning vaqt o'tishi bilan qiymatining kamayishini ifodalaydigan iqtisodiy tushuncha."
  },
  {
    "id": 723,
    "input": "Forex bozorida \"lot size\" nima?",
    "output": "\"Lot size\" - bu savdolarni amalga oshirishda bir valyuta juftligi bo'yicha savdolarni amalga oshirish hajmidir."
  },
  {
    "id": 724,
    "input": "Moliya bozorida \"beta risk\" nima?",
    "output": "\"Beta risk\" - bu biron bir aktivning bozorning umumiy o'zgarishlariga nisbatan o'zgarish darajasini ifodalovchi riskdir."
  },
  {
    "id": 725,
    "input": "Kriptovalyutalarda \"mining\" nima?",
    "output": "\"Mining\" - bu yangi bloklar va tranzaksiyalarni tasdiqlash orqali kriptovalyutalarni ishlab chiqarish jarayonidir."
  },
  {
    "id": 726,
    "input": "Aktsiyalarda \"IPO\" nima?",
    "output": "\"IPO\" - bu kompaniyaning birinchi marta ommaviy savdoga chiqarilishi (Initial Public Offering)."
  },
  {
    "id": 727,
    "input": "Ko'chmas mulkda \"property management fee\" nima?",
    "output": "\"Property management fee\" - bu ko'chmas mulkni boshqarish xizmatlari uchun to'lanadigan haqdir."
  },
  {
    "id": 728,
    "input": "Forex bozorida \"swap\" nima?",
    "output": "\"Swap\" - bu valyutalar bo'yicha foiz farqlari asosida amalga oshiriladigan shartnomadir."
  },
  {
    "id": 729,
    "input": "Moliya bozorida \"portfolio management\" nima?",
    "output": "\"Portfolio management\" - bu turli aktivlarni boshqarish va ulardan maksimal daromad olish strategiyasidir."
  },
  {
    "id": 730,
    "input": "Kriptovalyutalarda \"decentralized exchange\" (DEX) nima?",
    "output": "\"DEX\" - bu markazlashtirilmagan birja bo'lib, foydalanuvchilar o'zaro to'g'ridan-to'g'ri almashishadi."
  },
  {
    "id": 731,
    "input": "Aktsiyalarda \"market capitalization\" nima?",
    "output": "\"Market capitalization\" - bu kompaniyaning bozor qiymatini ifodalaydigan ko'rsatkich bo'lib, uning aksiyalarining umumiy soni va narxi asosida hisoblanadi."
  },
  {
    "id": 732,
    "input": "Kriptovalyutalarda \"hard fork\" nima?",
    "output": "\"Hard fork\" - bu blokcheyn tarmog'ining muhim yangilanishi bo'lib, eski versiya bilan mos kelmasligi sababli yangi bloklar tarmog'ini yaratadi."
  },
  {
    "id": 733,
    "input": "Forex bozorida \"liquidity\" nima?",
    "output": "\"Liquidity\" - bu bozorning aktivni tez va samarali sotish yoki sotib olish imkoniyatidir."
  },
  {
    "id": 734,
    "input": "Ko'chmas mulkda \"capital gains tax\" nima?",
    "output": "\"Capital gains tax\" - bu ko'chmas mulkni sotish orqali olinadigan foyda ustidan to'lanadigan soliqdir."
  },
  {
    "id": 735,
    "input": "Aktsiyalarda \"dividend yield\" qanday hisoblanadi?",
    "output": "\"Dividend yield\" - bu kompaniyaning aksiyalariga to'lanadigan dividendning narxiga nisbati."
  },
  {
    "id": 736,
    "input": "Moliya bozorida \"hedging\" nima?",
    "output": "\"Hedging\" - bu bozor o'zgarishlariga qarshi xavfni kamaytirish uchun qo'llaniladigan strategiyadir."
  },
  {
    "id": 737,
    "input": "Kriptovalyutalarda \"cold wallet\" nima?",
    "output": "\"Cold wallet\" - bu internetga ulanmagan, xavfsiz saqlash joylarida kriptovalyutalarni saqlash vositasidir."
  },
  {
    "id": 738,
    "input": "Aktsiyalarda \"price-to-book ratio\" (P/B ratio) nima?",
    "output": "\"P/B ratio\" - bu kompaniyaning bozor qiymatini uning moliyaviy hisobotida aks ettirilgan balans qiymatiga nisbati."
  },
  {
    "id": 739,
    "input": "Ko'chmas mulkda \"gross income multiplier\" nima?",
    "output": "\"Gross income multiplier\" - bu ko'chmas mulkni baholashda foydalaniladigan ko'rsatkich bo'lib, ijaradan olinadigan daromadni mulkning qiymatiga nisbati hisoblanadi."
  },
  {
    "id": 740,
    "input": "Forex bozorida \"spread\" nima?",
    "output": "\"Spread\" - bu valyuta juftligi uchun sotish va sotib olish narxi orasidagi farqdir."
  },
  {
    "id": 741,
    "input": "Moliya bozorida \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu aktivni sotish yoki sotib olishda kerakli narxga erishish uchun bozorning yetarli likvidligi yo'qligi xavfidir."
  },
  {
    "id": 742,
    "input": "Kriptovalyutalarda \"mining pool\" nima?",
    "output": "\"Mining pool\" - bu kriptovalyutalarni qazib olishda bir nechta minerlarning resurslarini birlashtirgan guruhdir."
  },
  {
    "id": 743,
    "input": "Aktsiyalarda \"bull market\" va \"bear market\" farqi nima?",
    "output": "\"Bull market\" - bu bozorda narxlarning o'sishi, \"bear market\" esa narxlarning tushishi holatidir."
  },
  {
    "id": 744,
    "input": "Ko'chmas mulkda \"tenant improvement\" nima?",
    "output": "\"Tenant improvement\" - bu ijarachiga ko'chmas mulkda qilinadigan o'zgartirishlar va yangilanishlardir."
  },
  {
    "id": 745,
    "input": "Forex bozorida \"overbought\" va \"oversold\" nima?",
    "output": "\"Overbought\" - bu aktivning narxi haddan tashqari yuqori bo'lgan, \"oversold\" esa juda past bo'lgan holatni anglatadi."
  },
  {
    "id": 746,
    "input": "Moliya bozorida \"dividend reinvestment\" nima?",
    "output": "\"Dividend reinvestment\" - bu dividendlarni aksiyalarga qayta sarmoya kiritish usulidir."
  },
  {
    "id": 747,
    "input": "Kriptovalyutalarda \"staking rewards\" nima?",
    "output": "\"Staking rewards\" - bu kriptovalyutani tarmoqni xavfsiz qilish uchun ushlab turish orqali olinadigan mukofotlardir."
  },
  {
    "id": 748,
    "input": "Aktsiyalarda \"growth stock\" nima?",
    "output": "\"Growth stock\" - bu tez o'sishi kutilayotgan va rentabellikni oshirish potentsialiga ega bo'lgan kompaniyalar aksiyalaridir."
  },
  {
    "id": 749,
    "input": "Ko'chmas mulkda \"debt-to-income ratio\" nima?",
    "output": "\"Debt-to-income ratio\" - bu qarzlar va oylik daromadlar o'rtasidagi nisbati, ijarachilarning moliyaviy holatini o'lchash uchun ishlatiladi."
  },
  {
    "id": 750,
    "input": "Forex bozorida \"currency risk\" nima?",
    "output": "\"Currency risk\" - bu valyutalar orasidagi kurs o'zgarishlaridan kelib chiqadigan riskdir."
  },
  {
    "id": 751,
    "input": "Moliya bozorida \"interest rate risk\" nima?",
    "output": "\"Interest rate risk\" - bu foiz stavkalarining o'zgarishlari natijasida aktivlarning qiymatining pasayish xavfidir."
  },
  {
    "id": 752,
    "input": "Kriptovalyutalarda \"peer-to-peer\" (P2P) ticarat nima?",
    "output": "\"P2P\" - bu foydalanuvchilar orasida to'g'ridan-to'g'ri savdolarni amalga oshirishni anglatadi."
  },
  {
    "id": 753,
    "input": "Aktsiyalarda \"technical analysis\" nima?",
    "output": "\"Technical analysis\" - bu narx harakatlarini tahlil qilish orqali bozorni prognoz qilish usulidir."
  },
  {
    "id": 754,
    "input": "Ko'chmas mulkda \"loan-to-value ratio\" (LTV) nima?",
    "output": "\"LTV ratio\" - bu qarz miqdori va mulkning qiymati o'rtasidagi nisbati, banklar uchun riskni aniqlashda ishlatiladi."
  },
  {
    "id": 755,
    "input": "Forex bozorida \"lot\" nima?",
    "output": "\"Lot\" - bu savdo hajmini ifodalovchi o'lchovdir, odatda 100,000 birlikka teng bo'ladi."
  },
  {
    "id": 756,
    "input": "Moliya bozorida \"capital structure\" nima?",
    "output": "\"Capital structure\" - bu kompaniyaning kapitalini qanday taqsimlashini ko'rsatadi, ya'ni qarz va aksiyalarni qanday uyg'unlashtirishini."
  },
  {
    "id": 757,
    "input": "Kriptovalyutalarda \"hard wallet\" nima?",
    "output": "\"Hard wallet\" - bu fiziki qurilma bo'lib, kriptovalyutalarni xavfsiz saqlash uchun ishlatiladi."
  },
  {
    "id": 758,
    "input": "Aktsiyalarda \"price-to-sales ratio\" (P/S ratio) nima?",
    "output": "\"P/S ratio\" - bu kompaniyaning bozor qiymatini uning yillik daromadiga nisbati."
  },
  {
    "id": 759,
    "input": "Ko'chmas mulkda \"real estate investment trust\" (REIT) nima?",
    "output": "\"REIT\" - bu ko'chmas mulkni investitsiya qilish uchun mo'ljallangan kompaniyadir, odatda aksiyalari ommaviy savdoga chiqariladi."
  },
  {
    "id": 760,
    "input": "Forex bozorida \"position sizing\" nima?",
    "output": "\"Position sizing\" - bu savdolarni amalga oshirishda riskni boshqarish uchun pozitsiya hajmini tanlash jarayonidir."
  },
  {
    "id": 761,
    "input": "Moliya bozorida \"asset allocation\" nima?",
    "output": "\"Asset allocation\" - bu sarmoyalarni turli xil aktivlar o'rtasida taqsimlash strategiyasidir."
  },
  {
    "id": 762,
    "input": "Kriptovalyutalarda \"tokenomics\" nima?",
    "output": "\"Tokenomics\" - bu kriptovalyuta yoki tokenning iqtisodiy tizimi va uning bozordagi taqsimoti haqida ilmiy soha."
  },
  {
    "id": 763,
    "input": "Aktsiyalarda \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu aktivning tezda va samarali sotilishi mumkin emasligini bildiradi, bu narxning pasayishiga olib kelishi mumkin."
  },
  {
    "id": 764,
    "input": "Aktsiyalarda \"market order\" bilan \"limit order\"ning farqi nima?",
    "output": "\"Market order\" - bu hozirgi bozor narxida savdo qilish, \"limit order\" esa ma'lum narxga erishilganda savdo qilish buyurtmasidir."
  },
  {
    "id": 765,
    "input": "Kriptovalyutalarda \"smart contract\" nima?",
    "output": "\"Smart contract\" - bu blokcheyn tarmog'ida shartnoma shartlari avtomatik ravishda bajariladigan dasturiy koddir."
  },
  {
    "id": 766,
    "input": "Forex bozorida \"carry trade\" nima?",
    "output": "\"Carry trade\" - bu yuqori foizli valyutalar sotib olib, past foizli valyutalar sotish orqali foyda olish strategiyasidir."
  },
  {
    "id": 767,
    "input": "Ko'chmas mulkda \"cap rate\" nima?",
    "output": "\"Cap rate\" - bu ko'chmas mulkdan olinadigan yillik daromadning uning bozor qiymatiga nisbati."
  },
  {
    "id": 768,
    "input": "Aktsiyalarda \"momentum strategy\" nima?",
    "output": "\"Momentum strategy\" - bu tez o'sayotgan aktsiyalarni sotib olish va pasayib borayotgan aktsiyalarni sotish strategiyasidir."
  },
  {
    "id": 769,
    "input": "Moliya bozorida \"cash flow\" nima?",
    "output": "\"Cash flow\" - bu kompaniyaning yoki investitsiya aktivining naqd pul kirimi va chiqimlarining o'zgarishlarini ifodalaydi."
  },
  {
    "id": 770,
    "input": "Kriptovalyutalarda \"token\" va \"coin\"ning farqi nima?",
    "output": "\"Token\" - bu boshqa platformalarda ishlatiladigan kriptovalyuta, \"coin\" esa o'zining blokcheyniga ega kriptovalyutadir."
  },
  {
    "id": 771,
    "input": "Aktsiyalarda \"beta coefficient\" nima?",
    "output": "\"Beta coefficient\" - bu aktivning bozor bilan bog'liqligini va uning o'zgarishlariga nisbatan sezgirligini ko'rsatadi."
  },
  {
    "id": 772,
    "input": "Ko'chmas mulkda \"amortization\" nima?",
    "output": "\"Amortization\" - bu ko'chmas mulkni sotib olish uchun olingan qarzning vaqt o'tishi bilan bo'lib-bo'lib to'lanishi jarayonidir."
  },
  {
    "id": 773,
    "input": "Forex bozorida \"slippage\" nima?",
    "output": "\"Slippage\" - bu buyurtma berilgan narxdan farqli ravishda aktivni sotib olish yoki sotish narxining o'zgarishi."
  },
  {
    "id": 774,
    "input": "Moliya bozorida \"dividend\" nima?",
    "output": "\"Dividend\" - bu kompaniyaning foydasidan aksiyadorlarga to'lanadigan ulushdir."
  },
  {
    "id": 775,
    "input": "Kriptovalyutalarda \"proof of work\" va \"proof of stake\"ning farqi nima?",
    "output": "\"Proof of work\" - bu minerlar tomonidan yechimlar topish orqali bloklarni tasdiqlash, \"proof of stake\" esa tarmoqdagi tokenlarni ushlab turish orqali bloklarni tasdiqlash usulidir."
  },
  {
    "id": 776,
    "input": "Aktsiyalarda \"value stock\" nima?",
    "output": "\"Value stock\" - bu narxi arzon bo'lgan va tezda o'sishi kutilayotgan aksiyalardir."
  },
  {
    "id": 777,
    "input": "Ko'chmas mulkda \"vacancy rate\" nima?",
    "output": "\"Vacancy rate\" - bu ko'chmas mulkning bo'sh turgan yoki ijaraga berilmagan qismlarining foizidir."
  },
  {
    "id": 778,
    "input": "Forex bozorida \"pip\" nima?",
    "output": "\"Pip\" - bu valyuta juftligining eng kichik narx o'zgarishi birligidir."
  },
  {
    "id": 779,
    "input": "Moliya bozorida \"return on investment\" (ROI) nima?",
    "output": "\"ROI\" - bu sarmoyaning foydasini o'lchash uchun ishlatiladigan ko'rsatkich bo'lib, daromadning sarmoyaga nisbati hisoblanadi."
  },
  {
    "id": 780,
    "input": "Kriptovalyutalarda \"gas fee\" nima?",
    "output": "\"Gas fee\" - bu blokcheyn tarmog'ida tranzaksiyalarni amalga oshirish uchun to'lanadigan komissiya haqidir."
  },
  {
    "id": 781,
    "input": "Aktsiyalarda \"circuit breaker\" nima?",
    "output": "\"Circuit breaker\" - bu bozor o'zgarishlari juda katta bo'lsa, savdolarni to'xtatish uchun qo'llaniladigan mexanizmdir."
  },
  {
    "id": 782,
    "input": "Ko'chmas mulkda \"equity\" nima?",
    "output": "\"Equity\" - bu mulkning bozor qiymati va uning ustidagi qarz miqdori orasidagi farqdir."
  },
  {
    "id": 783,
    "input": "Forex bozorida \"stop loss\" nima?",
    "output": "\"Stop loss\" - bu yo'qotishlarni cheklash uchun aktivning belgilangan narxga yetganda avtomatik ravishda sotilishi buyurtmasidir."
  },
  {
    "id": 784,
    "input": "Moliya bozorida \"beta\" nima?",
    "output": "\"Beta\" - bu kompaniya yoki aktivning bozor o'zgarishlariga nisbatan sezgirlik darajasini o'lchovchi ko'rsatkichdir."
  },
  {
    "id": 785,
    "input": "Kriptovalyutalarda \"hash\" nima?",
    "output": "\"Hash\" - bu kriptovalyutalarda ma'lumotlarni blokcheyn tarmog'ida xavfsiz saqlash uchun ishlatiladigan matematik algoritmdir."
  },
  {
    "id": 786,
    "input": "Aktsiyalarda \"earnings per share\" (EPS) nima?",
    "output": "\"EPS\" - bu kompaniyaning foydasini aksiyalar soniga bo'lib hisoblangan ko'rsatkichdir."
  },
  {
    "id": 787,
    "input": "Ko'chmas mulkda \"refinancing\" nima?",
    "output": "\"Refinancing\" - bu ko'chmas mulk uchun yangi kredit olish orqali eski qarzni to'lash jarayonidir."
  },
  {
    "id": 788,
    "input": "Forex bozorida \"scalping\" nima?",
    "output": "\"Scalping\" - bu qisqa muddatli savdolar orqali kichik foydalar olish strategiyasidir."
  },
  {
    "id": 789,
    "input": "Moliya bozorida \"correlation\" nima?",
    "output": "\"Correlation\" - bu ikkita aktivning bir-biriga nisbatan harakat qilish darajasini o'lchovchi ko'rsatkichdir."
  },
  {
    "id": 790,
    "input": "Kriptovalyutalarda \"decentralized finance\" (DeFi) nima?",
    "output": "\"DeFi\" - bu markazlashtirilmagan moliyaviy xizmatlar tarmog'idir, kriptovalyutalar va blokcheyn texnologiyalariga asoslanadi."
  },
  {
    "id": 791,
    "input": "Aktsiyalarda \"market sentiment\" nima?",
    "output": "\"Market sentiment\" - bu investorlarning bozor haqidagi umumiy fikrini yoki kayfiyatini ifodalaydi."
  },
  {
    "id": 792,
    "input": "Ko'chmas mulkda \"zoning\" nima?",
    "output": "\"Zoning\" - bu yer maydonini turli maqsadlar uchun belgilash, masalan, tijorat yoki yashash joylari uchun ajratish."
  },
  {
    "id": 793,
    "input": "Forex bozorida \"volatility\" nima?",
    "output": "\"Volatility\" - bu aktivning narxi o'zgarishining o'lchovidir, yuqori volatillik narxlar tez-tez o'zgarishini bildiradi."
  },
  {
    "id": 794,
    "input": "Aktsiyalarda \"bullish\" va \"bearish\" nima?",
    "output": "\"Bullish\" - bu bozorning o'sishiga ishora qiladi, \"bearish\" esa pasayishiga ishora qiladi."
  },
  {
    "id": 795,
    "input": "Kriptovalyutalarda \"ledger\" nima?",
    "output": "\"Ledger\" - bu barcha tranzaksiyalarni saqlovchi tizim bo'lib, blokcheyn asosida ishlaydi."
  },
  {
    "id": 796,
    "input": "Forex bozorida \"long position\" va \"short position\" nima?",
    "output": "\"Long position\" - bu aktivni sotib olish, \"short position\" - bu aktivni qarzga olish va sotishdir."
  },
  {
    "id": 797,
    "input": "Ko'chmas mulkda \"capital gains\" nima?",
    "output": "\"Capital gains\" - bu ko'chmas mulkni sotishdan olingan foydadir, uning bozor qiymatidan oshishi."
  },
  {
    "id": 798,
    "input": "Aktsiyalarda \"initial public offering\" (IPO) nima?",
    "output": "\"IPO\" - bu kompaniyaning birinchi marta ommaga aksiyalarini sotishi jarayonidir."
  },
  {
    "id": 799,
    "input": "Moliya bozorida \"fixed income\" nima?",
    "output": "\"Fixed income\" - bu ma'lum bir foiz stavkasi bilan qaytadigan investitsiya turlaridir."
  },
  {
    "id": 800,
    "input": "Kriptovalyutalarda \"fork\" nima?",
    "output": "\"Fork\" - bu blokcheyn tarmog'ining yangi versiyasini yaratish jarayonidir."
  },
  {
    "id": 801,
    "input": "Aktsiyalarda \"margin trading\" nima?",
    "output": "\"Margin trading\" - bu sarmoyadorning qarzga olingan pul bilan savdo qilish jarayonidir."
  },
  {
    "id": 802,
    "input": "Ko'chmas mulkda \"refinancing\" va \"home equity loan\"ning farqi nima?",
    "output": "\"Refinancing\" - bu eski qarzni yangi kredit bilan almashtirish, \"home equity loan\" esa uy mulkini garovga qo'yish orqali qarz olishdir."
  },
  {
    "id": 803,
    "input": "Forex bozorida \"trend line\" nima?",
    "output": "\"Trend line\" - bu bozorning o'sish yoki pasayish yo'nalishini ko'rsatadigan chiziqdir."
  },
  {
    "id": 804,
    "input": "Moliya bozorida \"asset bubble\" nima?",
    "output": "\"Asset bubble\" - bu aktivlarning bozor narxining sun'iy ravishda o'sishi va keyinchalik to'kilishi holatidir."
  },
  {
    "id": 805,
    "input": "Kriptovalyutalarda \"cold storage\" nima?",
    "output": "\"Cold storage\" - bu internetga ulanmagan saqlash tizimi bo'lib, kriptovalyutalarni xavfsiz saqlash uchun ishlatiladi."
  },
  {
    "id": 806,
    "input": "Aktsiyalarda \"short selling\" nima?",
    "output": "\"Short selling\" - bu aktivni sotib olishdan avval sotish va uning narxi tushganda qayta sotib olish strategiyasidir."
  },
  {
    "id": 807,
    "input": "Ko'chmas mulkda \"property management\" nima?",
    "output": "\"Property management\" - bu ko'chmas mulkni ijaraga berish va uning texnik, moliyaviy va boshqaruv ishlarini amalga oshirish jarayonidir."
  },
  {
    "id": 808,
    "input": "Forex bozorida \"leverage\" nima?",
    "output": "\"Leverage\" - bu investorning qarz olish orqali o'z sarmoyasini oshirish imkoniyatidir."
  },
  {
    "id": 809,
    "input": "Moliya bozorida \"dividend yield\" nima?",
    "output": "\"Dividend yield\" - bu aksiyaga to'lanadigan dividendning narxiga nisbati hisoblanadi."
  },
  {
    "id": 810,
    "input": "Kriptovalyutalarda \"block explorer\" nima?",
    "output": "\"Block explorer\" - bu blokcheynning barcha tranzaksiyalarini va bloklarini ko'rish uchun ishlatiladigan vositadir."
  },
  {
    "id": 811,
    "input": "Aktsiyalarda \"buy and hold\" strategiyasi nima?",
    "output": "\"Buy and hold\" - bu uzoq muddatli investitsiya strategiyasi bo'lib, aktivni sotib olib saqlashni anglatadi."
  },
  {
    "id": 812,
    "input": "Ko'chmas mulkda \"real estate investment trust\" (REIT) nima?",
    "output": "\"REIT\" - bu ko'chmas mulkni sarmoya kiritishning ommaviy usulidir, aksiyalar orqali sotiladi."
  },
  {
    "id": 813,
    "input": "Forex bozorida \"spread betting\" nima?",
    "output": "\"Spread betting\" - bu aktivning narxining qanday o'zgarishini taxmin qilish orqali pul ishlash strategiyasidir."
  },
  {
    "id": 814,
    "input": "Moliya bozorida \"inflation risk\" nima?",
    "output": "\"Inflation risk\" - bu inflyatsiya darajasining ortishi natijasida aktivlar qiymatining pasayishi xavfidir."
  },
  {
    "id": 815,
    "input": "Kriptovalyutalarda \"tokenomics\" nima?",
    "output": "\"Tokenomics\" - bu tokenning iqtisodiy tizimi va uning ekotizimdagi roli haqida ilmiy soha."
  },
  {
    "id": 816,
    "input": "Aktsiyalarda \"technical indicators\" nima?",
    "output": "\"Technical indicators\" - bu aksiyalar yoki aktivlarning narx harakatlarini tahlil qilishda ishlatiladigan matematik formulalardir."
  },
  {
    "id": 817,
    "input": "Ko'chmas mulkda \"leasehold\" va \"freehold\"ning farqi nima?",
    "output": "\"Leasehold\" - bu mulkni ijaraga olish huquqi, \"freehold\" esa mulkning to'liq egasi bo'lishni bildiradi."
  },
  {
    "id": 818,
    "input": "Forex bozorida \"currency pair\" nima?",
    "output": "\"Currency pair\" - bu ikki valyutani bir-biriga nisbatan savdo qilishda ishlatiladigan juftlikdir."
  },
  {
    "id": 819,
    "input": "Moliya bozorida \"volatility index\" nima?",
    "output": "\"Volatility index\" - bu bozordagi o'zgaruvchanlik darajasini o'lchovchi ko'rsatkichdir."
  },
  {
    "id": 820,
    "input": "Kriptovalyutalarda \"private key\" va \"public key\"ning farqi nima?",
    "output": "\"Private key\" - bu kriptovalyutalarga kirish uchun maxfiy kod, \"public key\" esa uning ommaviy versiyasidir."
  },
  {
    "id": 821,
    "input": "Aktsiyalarda \"income stock\" nima?",
    "output": "\"Income stock\" - bu dividendlar orqali doimiy daromad olish imkonini beruvchi aksiyalardir."
  },
  {
    "id": 822,
    "input": "Ko'chmas mulkda \"capital expenditure\" nima?",
    "output": "\"Capital expenditure\" - bu ko'chmas mulkni yaxshilash va o'zgartirish uchun sarflanadigan mablag'lar."
  },
  {
    "id": 823,
    "input": "Forex bozorida \"scalping\" nima?",
    "output": "\"Scalping\" - bu qisqa muddatli savdolar orqali kichik foydalar olish strategiyasidir."
  },
  {
    "id": 824,
    "input": "Moliya bozorida \"current ratio\" nima?",
    "output": "\"Current ratio\" - bu kompaniyaning qisqa muddatli majburiyatlarini qoplash qobiliyatini o'lchash uchun ishlatiladigan ko'rsatkichdir."
  },
  {
    "id": 825,
    "input": "Kriptovalyutalarda \"minting\" nima?",
    "output": "\"Minting\" - bu yangi token yoki kriptovalyutalarni yaratish jarayonidir."
  },
  {
    "id": 826,
    "input": "Aktsiyalarda \"relative strength index\" (RSI) nima?",
    "output": "\"RSI\" - bu aktivning narx harakatlarini o'rganib, uning haddan tashqari sotilgan yoki sotib olinganligini aniqlash uchun ishlatiladigan ko'rsatkichdir."
  },
  {
    "id": 827,
    "input": "Aktsiyalarda \"bull market\" nima?",
    "output": "\"Bull market\" - bu bozorning o'sayotgan va ijobiy hissiyotlar bilan to'ldirilgan holatidir."
  },
  {
    "id": 828,
    "input": "Kriptovalyutalarda \"staking\" nima?",
    "output": "\"Staking\" - bu kriptovalyutalarni tarmoqda ishlatish uchun ushlab turish va shu orqali daromad olish jarayonidir."
  },
  {
    "id": 829,
    "input": "Forex bozorida \"pips\" nima?",
    "output": "\"Pips\" - bu valyutalar juftligidagi eng kichik narx o'zgarishidir."
  },
  {
    "id": 830,
    "input": "Ko'chmas mulkda \"appraisal\" nima?",
    "output": "\"Appraisal\" - bu ko'chmas mulkning bozor qiymatini baholash jarayonidir."
  },
  {
    "id": 831,
    "input": "Aktsiyalarda \"blue chip stocks\" nima?",
    "output": "\"Blue chip stocks\" - bu uzoq muddatli, barqaror va yuqori daromad keltiradigan kompaniyalarning aksiyalaridir."
  },
  {
    "id": 832,
    "input": "Moliya bozorida \"alpha\" nima?",
    "output": "\"Alpha\" - bu portfelning bozor o'rtacha daromadidan yuqori bo'lgan qo'shimcha daromadidir."
  },
  {
    "id": 833,
    "input": "Kriptovalyutalarda \"decentralized exchange\" (DEX) nima?",
    "output": "\"DEX\" - bu markazlashtirilmagan kriptovalyutalar savdosi uchun platformadir, unda vositachilar yo'q."
  },
  {
    "id": 834,
    "input": "Aktsiyalarda \"market capitalization\" (market cap) nima?",
    "output": "\"Market cap\" - bu kompaniyaning bozor qiymati, ya'ni aksiyalarining umumiy soni va narxining ko'paytmasidir."
  },
  {
    "id": 835,
    "input": "Ko'chmas mulkda \"due diligence\" nima?",
    "output": "\"Due diligence\" - bu ko'chmas mulkni sotib olishdan oldin uning huquqiy va moliyaviy holatini tekshirish jarayonidir."
  },
  {
    "id": 836,
    "input": "Forex bozorida \"trend reversal\" nima?",
    "output": "\"Trend reversal\" - bu bozorning o'sish yoki pasayish yo'nalishining o'zgarishidir."
  },
  {
    "id": 837,
    "input": "Moliya bozorida \"beta coefficient\" nima?",
    "output": "\"Beta coefficient\" - bu kompaniya yoki aktivning bozor bilan bog'liqligini va uning o'zgarishlariga sezgirligini ko'rsatadi."
  },
  {
    "id": 838,
    "input": "Kriptovalyutalarda \"miner\" nima?",
    "output": "\"Miner\" - bu blokcheyn tarmog'ida yangi bloklarni yaratish va tasdiqlash orqali tranzaksiyalarni bajaradigan shaxs yoki qurilma."
  },
  {
    "id": 839,
    "input": "Aktsiyalarda \"exchange-traded fund\" (ETF) nima?",
    "output": "\"ETF\" - bu bir yoki bir nechta aktivlardan iborat bo'lgan, birja orqali sotiladigan investitsiya fondidir."
  },
  {
    "id": 840,
    "input": "Ko'chmas mulkda \"property tax\" nima?",
    "output": "\"Property tax\" - bu ko'chmas mulkning egasiga solinadigan soliqlardir."
  },
  {
    "id": 841,
    "input": "Forex bozorida \"carry trade\" nima?",
    "output": "\"Carry trade\" - bu yuqori foizli valyutalar sotib olib, past foizli valyutalar sotish orqali foyda olish strategiyasidir."
  },
  {
    "id": 842,
    "input": "Moliya bozorida \"liquidity\" nima?",
    "output": "\"Liquidity\" - bu aktivning bozorida osonlik bilan naqd pulga aylanishi imkoniyatidir."
  },
  {
    "id": 843,
    "input": "Kriptovalyutalarda \"token burn\" nima?",
    "output": "\"Token burn\" - bu tokenlarni yo'qotish jarayonidir, bu ular muomalada kamayishi uchun amalga oshiriladi."
  },
  {
    "id": 844,
    "input": "Aktsiyalarda \"growth stock\" nima?",
    "output": "\"Growth stock\" - bu o'sishi kutilayotgan va yuqori o'sish potensialiga ega bo'lgan aksiyalardir."
  },
  {
    "id": 845,
    "input": "Ko'chmas mulkda \"gross rental yield\" nima?",
    "output": "\"Gross rental yield\" - bu ko'chmas mulkdan olingan daromadning uning bozor qiymatiga nisbati hisoblanadi."
  },
  {
    "id": 846,
    "input": "Forex bozorida \"hedging\" nima?",
    "output": "\"Hedging\" - bu valyutalardagi narx o'zgarishlaridan himoyalanish uchun strategiya yoki vosita."
  },
  {
    "id": 847,
    "input": "Moliya bozorida \"diversification\" nima?",
    "output": "\"Diversification\" - bu sarmoya portfelini turli xil aktivlar bilan boyitish orqali risklarni kamaytirish strategiyasidir."
  },
  {
    "id": 848,
    "input": "Kriptovalyutalarda \"airdrop\" nima?",
    "output": "\"Airdrop\" - bu kriptovalyuta yoki tokenlarni foydalanuvchilarga bepul taqsimlash jarayonidir."
  },
  {
    "id": 849,
    "input": "Aktsiyalarda \"earnings per share\" (EPS) nima?",
    "output": "\"EPS\" - bu kompaniyaning foydasining aksiyalar soniga bo'linishi bilan hisoblanadigan ko'rsatkichdir."
  },
  {
    "id": 850,
    "input": "Ko'chmas mulkda \"tenant\" nima?",
    "output": "\"Tenant\" - bu ko'chmas mulkni ijaraga olgan shaxs yoki tashkilotdir."
  },
  {
    "id": 851,
    "input": "Forex bozorida \"lot size\" nima?",
    "output": "\"Lot size\" - bu savdo qilinadigan aktivning minimal miqdori yoki hajmi."
  },
  {
    "id": 852,
    "input": "Moliya bozorida \"interest rate\" nima?",
    "output": "\"Interest rate\" - bu qarzning foiz stavkasi, ya'ni qarzning qiymatiga qo'shiladigan ortiqcha miqdordir."
  },
  {
    "id": 853,
    "input": "Kriptovalyutalarda \"NFT\" nima?",
    "output": "\"NFT\" - bu noyob raqamli tovarlarni ifodalovchi token bo'lib, uning har biri boshqa narsalardan farq qiladi."
  },
  {
    "id": 854,
    "input": "Aktsiyalarda \"dividend reinvestment plan\" (DRIP) nima?",
    "output": "\"DRIP\" - bu kompaniyaning dividendlarini aksiyalar sotib olishda ishlatish imkoniyatidir."
  },
  {
    "id": 855,
    "input": "Ko'chmas mulkda \"mortgage rate\" nima?",
    "output": "\"Mortgage rate\" - bu uy-joyni moliyalashtirish uchun olingan kreditning foiz stavkasi."
  },
  {
    "id": 856,
    "input": "Forex bozorida \"stop loss order\" nima?",
    "output": "\"Stop loss order\" - bu yo'qotishlarni cheklash uchun ma'lum narxda avtomatik sotuvni amalga oshirish buyurtmasidir."
  },
  {
    "id": 857,
    "input": "Moliya bozorida \"capital gains tax\" nima?",
    "output": "\"Capital gains tax\" - bu aktivlar sotilganda olingan foyda ustidan to'lanadigan soliqdir."
  },
  {
    "id": 858,
    "input": "Aktsiyalarda \"market order\" nima?",
    "output": "\"Market order\" - bu aktivni hozirgi bozor narxida sotib olish yoki sotish buyurtmasidir."
  },
  {
    "id": 859,
    "input": "Kriptovalyutalarda \"wallet\" nima?",
    "output": "\"Wallet\" - bu kriptovalyutalarni saqlash va yuborish uchun ishlatiladigan elektron hamyon."
  },
  {
    "id": 860,
    "input": "Forex bozorida \"order types\" nima?",
    "output": "\"Order types\" - bu savdo buyurtmalarining turli shakllari, masalan, market order, limit order."
  },
  {
    "id": 861,
    "input": "Ko'chmas mulkda \"equity\" nima?",
    "output": "\"Equity\" - bu ko'chmas mulkning bozor qiymatidan qarzning miqdorini ayirgan qismi."
  },
  {
    "id": 862,
    "input": "Aktsiyalarda \"value stock\" nima?",
    "output": "\"Value stock\" - bu bozorda nisbatan arzon va past baholangan aksiyalardir."
  },
  {
    "id": 863,
    "input": "Moliya bozorida \"correlation\" nima?",
    "output": "\"Correlation\" - bu ikki aktivning bir-biriga qanday bog'lanishining o'lchovidir."
  },
  {
    "id": 864,
    "input": "Kriptovalyutalarda \"hash rate\" nima?",
    "output": "\"Hash rate\" - bu tarmoqda tranzaksiyalarni tasdiqlash tezligini o'lchashda ishlatiladigan birimdir."
  },
  {
    "id": 865,
    "input": "Aktsiyalarda \"capital structure\" nima?",
    "output": "\"Capital structure\" - bu kompaniyaning qarz va o'z kapitali aralashmasidan tashkil topgan moliyaviy tuzilmasidir."
  },
  {
    "id": 866,
    "input": "Ko'chmas mulkda \"deed\" nima?",
    "output": "\"Deed\" - bu ko'chmas mulkning qonuniy egasini tasdiqlovchi hujjatdir."
  },
  {
    "id": 867,
    "input": "Forex bozorida \"swaps\" nima?",
    "output": "\"Swaps\" - bu valyutalarning kelajakdagi narxini belgilash va ularni almashtirish uchun ishlatiladigan instrumentlardir."
  },
  {
    "id": 868,
    "input": "Moliya bozorida \"return on investment\" (ROI) nima?",
    "output": "\"ROI\" - bu sarmoyaning foyda yoki zararining investitsiya qiymatiga nisbati hisoblanadi."
  },
  {
    "id": 869,
    "input": "Kriptovalyutalarda \"proof of stake\" (PoS) nima?",
    "output": "\"PoS\" - bu blokcheyn tarmog'ida tranzaksiyalarni tasdiqlash va yangi bloklar yaratish uchun foydalanuvchilarning kriptovalyutalarini saqlash asosida ishlaydigan tizimdir."
  },
  {
    "id": 870,
    "input": "Aktsiyalarda \"liquidity ratio\" nima?",
    "output": "\"Liquidity ratio\" - bu kompaniyaning qisqa muddatli majburiyatlarini to'lash uchun zarur bo'lgan likvidlik miqdorini o'lchovchi ko'rsatkichdir."
  },
  {
    "id": 871,
    "input": "Ko'chmas mulkda \"closing costs\" nima?",
    "output": "\"Closing costs\" - bu ko'chmas mulkni sotib olish yoki sotish bilan bog'liq qo'shimcha xarajatlar, masalan, advokat to'lovlari, sug'urta va boshqalar."
  },
  {
    "id": 872,
    "input": "Forex bozorida \"market sentiment\" nima?",
    "output": "\"Market sentiment\" - bu bozor ishtirokchilarining umumiy hissiyotlari va ularning bozorning kelajagi haqidagi fikridir."
  },
  {
    "id": 873,
    "input": "Moliya bozorida \"futures contract\" nima?",
    "output": "\"Futures contract\" - bu kelajakda belgilangan narxda aktivni sotib olish yoki sotish bo'yicha kelishuvdir."
  },
  {
    "id": 874,
    "input": "Kriptovalyutalarda \"smart contract\" nima?",
    "output": "\"Smart contract\" - bu avtomatik tarzda bajariladigan va shartlarga asoslangan bitimni ifodalovchi raqamli shartnoma."
  },
  {
    "id": 875,
    "input": "Aktsiyalarda \"diversified portfolio\" nima?",
    "output": "\"Diversified portfolio\" - bu turli xil aktivlarga sarmoya kiritish orqali risklarni kamaytirish strategiyasidir."
  },
  {
    "id": 876,
    "input": "Ko'chmas mulkda \"vacancy rate\" nima?",
    "output": "\"Vacancy rate\" - bu ko'chmas mulkning bo'sh turgan va ijaraga berilmagan ulushining foizidir."
  },
  {
    "id": 877,
    "input": "Forex bozorida \"price action\" nima?",
    "output": "\"Price action\" - bu narxlarning o'zgarishi va shuning asosida amalga oshirilgan savdolarni tahlil qilish usulidir."
  },
  {
    "id": 878,
    "input": "Moliya bozorida \"inflation hedging\" nima?",
    "output": "\"Inflation hedging\" - bu inflyatsiya xavfini kamaytirish uchun qo'llaniladigan investitsiya strategiyasidir."
  },
  {
    "id": 879,
    "input": "Kriptovalyutalarda \"peer-to-peer\" (P2P) nima?",
    "output": "\"P2P\" - bu foydalanuvchilar o'rtasida to'g'ridan-to'g'ri tranzaksiyalarni amalga oshirish tizimidir."
  },
  {
    "id": 880,
    "input": "Aktsiyalarda \"underlying asset\" nima?",
    "output": "\"Underlying asset\" - bu moliyaviy instrumentning qiymatini belgilovchi asosiy aktivdir."
  },
  {
    "id": 881,
    "input": "Ko'chmas mulkda \"rental income\" nima?",
    "output": "\"Rental income\" - bu ko'chmas mulkni ijaraga berish orqali olingan daromaddir."
  },
  {
    "id": 882,
    "input": "Forex bozorida \"currency swap\" nima?",
    "output": "\"Currency swap\" - bu valyutalarning bir-biriga almashinishidir, odatda uzoq muddatli qarz shartnomasida."
  },
  {
    "id": 883,
    "input": "Moliya bozorida \"benchmark index\" nima?",
    "output": "\"Benchmark index\" - bu sarmoya portfelini baholash uchun ishlatiladigan asosiy ko'rsatkichdir."
  },
  {
    "id": 884,
    "input": "Kriptovalyutalarda \"yield farming\" nima?",
    "output": "\"Yield farming\" - bu kriptovalyutalarda sarmoya kiritish orqali daromad olish usulidir."
  },
  {
    "id": 885,
    "input": "Aktsiyalarda \"limit order\" nima?",
    "output": "\"Limit order\" - bu aktivni faqat belgilangan narxda sotib olish yoki sotish buyurtmasidir."
  },
  {
    "id": 886,
    "input": "Ko'chmas mulkda \"capital gains\" solig'i nima?",
    "output": "\"Capital gains tax\" - bu ko'chmas mulkni sotishdan olingan foyda ustidan to'lanadigan soliqdir."
  },
  {
    "id": 887,
    "input": "Forex bozorida \"pip value\" nima?",
    "output": "\"Pip value\" - bu bir pips o'zgarishining moliyaviy qiymatini o'lchashdir."
  },
  {
    "id": 888,
    "input": "Moliya bozorida \"interest rate swap\" nima?",
    "output": "\"Interest rate swap\" - bu foiz stavkalari bo'yicha ikki tomonning kelishuvidir, ularning o'zgarishi asosida pul almashiladi."
  },
  {
    "id": 889,
    "input": "Aktsiyalarda \"initial public offering\" (IPO) nima?",
    "output": "\"IPO\" - bu kompaniyaning aksiyalarini birinchi marta ommaga taklif qilishi jarayonidir."
  },
  {
    "id": 890,
    "input": "Kriptovalyutalarda \"halving\" nima?",
    "output": "\"Halving\" - bu kriptovalyutalar qazib olish mukofotining yarmiga qisqartirilishidir."
  },
  {
    "id": 891,
    "input": "Forex bozorida \"leverage\" nima?",
    "output": "\"Leverage\" - bu kichik miqdordagi kapital bilan katta hajmdagi savdolarni amalga oshirish imkoniyatidir."
  },
  {
    "id": 892,
    "input": "Ko'chmas mulkda \"zoning laws\" nima?",
    "output": "\"Zoning laws\" - bu hududlarda qanday turdagi binolar yoki faoliyatlarga ruxsat berilishini tartibga soluvchi qonunlar."
  },
  {
    "id": 893,
    "input": "Aktsiyalarda \"insider trading\" nima?",
    "output": "\"Insider trading\" - bu ichki ma'lumotlarga asoslangan holda aksiyalarni sotib olish yoki sotish jarayonidir."
  },
  {
    "id": 894,
    "input": "Moliya bozorida \"compound interest\" nima?",
    "output": "\"Compound interest\" - bu foizlarning foiz hisoblash jarayonidir, ya'ni avvalgi foizlar asosida yangi foizlar hisoblanadi."
  },
  {
    "id": 895,
    "input": "Kriptovalyutalarda \"hot wallet\" nima?",
    "output": "\"Hot wallet\" - bu internetga ulanadigan va tranzaksiyalar uchun tezkor foydalaniladigan kripto hamyondir."
  },
  {
    "id": 896,
    "input": "Aktsiyalarda \"share buyback\" nima?",
    "output": "\"Share buyback\" - bu kompaniyaning o'z aksiyalarini qayta sotib olish jarayonidir."
  },
  {
    "id": 897,
    "input": "Ko'chmas mulkda \"home equity loan\" nima?",
    "output": "\"Home equity loan\" - bu ko'chmas mulkning bozor qiymatidan qarz miqdorini chiqarib tashlab olingan qiymatga asoslangan kredit."
  },
  {
    "id": 898,
    "input": "Forex bozorida \"base currency\" nima?",
    "output": "\"Base currency\" - bu valyuta juftligidagi birinchi valyutadir, masalan, EUR/USD juftligidagi EUR."
  },
  {
    "id": 899,
    "input": "Moliya bozorida \"volatility\" nima?",
    "output": "\"Volatility\" - bu aktivning narxi qanday tezlikda va qanchalik katta o'zgarishini ifodalovchi o'lchov."
  },
  {
    "id": 900,
    "input": "Kriptovalyutalarda \"cold storage\" nima?",
    "output": "\"Cold storage\" - bu offline holda kriptovalyutalarni xavfsiz saqlash usulidir."
  },
  {
    "id": 901,
    "input": "Aktsiyalarda \"penny stock\" nima?",
    "output": "\"Penny stock\" - bu past narxdagi, odatda kichik kompaniyalarning yuqori xavfli aksiyalaridir."
  },
  {
    "id": 902,
    "input": "Ko'chmas mulkda \"escrow\" nima?",
    "output": "\"Escrow\" - bu uchinchi tomon tomonidan moliyaviy vositalarni yoki hujjatlarni vaqtinchalik saqlash jarayonidir."
  },
  {
    "id": 903,
    "input": "Forex bozorida \"bid-ask spread\" nima?",
    "output": "\"Bid-ask spread\" - bu xarid va sotuv narxlari orasidagi farqdir."
  },
  {
    "id": 904,
    "input": "Moliya bozorida \"asset allocation\" nima?",
    "output": "\"Asset allocation\" - bu investitsiyalarni turli aktivlar o'rtasida taqsimlash jarayonidir."
  },
  {
    "id": 905,
    "input": "Kriptovalyutalarda \"ICO\" nima?",
    "output": "\"ICO\" - bu kriptovalyuta yoki tokenlarni dastlabki taklif qilish orqali kapital yig'ish jarayonidir."
  },
  {
    "id": 906,
    "input": "Aktsiyalarda \"stock split\" nima?",
    "output": "\"Stock split\" - bu aksiyalarni kichikroq birliklarga bo'lish jarayoni, bu orqali narx kamayadi, lekin qiymat o'zgarmaydi."
  },
  {
    "id": 907,
    "input": "Ko'chmas mulkda \"lease agreement\" nima?",
    "output": "\"Lease agreement\" - bu mulk egasi va ijarachi o'rtasida imzolangan ijara shartnomasidir."
  },
  {
    "id": 908,
    "input": "Forex bozorida \"lot types\" nima?",
    "output": "\"Lot types\" - bu standart, mini, mikro yoki nano hajmdagi savdo lotlari turlari."
  },
  {
    "id": 909,
    "input": "Moliya bozorida \"capital preservation\" nima?",
    "output": "\"Capital preservation\" - bu investitsiyalarni xavfsiz saqlash va kapital yo'qotishning oldini olish strategiyasi."
  },
  {
    "id": 910,
    "input": "Kriptovalyutalarda \"blockchain explorer\" nima?",
    "output": "\"Blockchain explorer\" - bu blokcheyn tarmog'ida tranzaksiyalar va bloklarni kuzatishga imkon beruvchi vositadir."
  },
  {
    "id": 911,
    "input": "Aktsiyalarda \"stock ticker\" nima?",
    "output": "\"Stock ticker\" - bu kompaniyaning birjada ro'yxatdan o'tgan qisqartirilgan nomidir."
  },
  {
    "id": 912,
    "input": "Ko'chmas mulkda \"buy-to-let\" nima?",
    "output": "\"Buy-to-let\" - bu ko'chmas mulkni ijaraga berish uchun sotib olish strategiyasidir."
  },
  {
    "id": 913,
    "input": "Forex bozorida \"position sizing\" nima?",
    "output": "\"Position sizing\" - bu har bir savdoda qanchalik katta kapitaldan foydalanish qaroridir."
  },
  {
    "id": 914,
    "input": "Moliya bozorida \"fixed income\" nima?",
    "output": "\"Fixed income\" - bu daromadni oldindan belgilangan miqdorda va muddatda ta'minlovchi aktivlar, masalan, obligatsiyalar."
  },
  {
    "id": 915,
    "input": "Kriptovalyutalarda \"hard fork\" nima?",
    "output": "\"Hard fork\" - bu blokcheyn tarmog'ida kelishmovchiliklar tufayli yangi tarmoq paydo bo'lish jarayonidir."
  },
  {
    "id": 916,
    "input": "Aktsiyalarda \"short selling\" nima?",
    "output": "\"Short selling\" - bu aksiyalarni qarzga olib sotish va narx pasayganda qaytarib sotib olish strategiyasidir."
  },
  {
    "id": 917,
    "input": "Ko'chmas mulkda \"market analysis\" nima?",
    "output": "\"Market analysis\" - bu bozor sharoitlarini o'rganish va mulkning narxini aniqlash jarayoni."
  },
  {
    "id": 918,
    "input": "Forex bozorida \"economic indicators\" nima?",
    "output": "\"Economic indicators\" - bu valyutalarga ta'sir qiluvchi iqtisodiy ko'rsatkichlar, masalan, inflyatsiya yoki ish bilan bandlik."
  },
  {
    "id": 919,
    "input": "Aktsiyalarda \"earnings call\" nima?",
    "output": "\"Earnings call\" - bu kompaniya rahbariyati tomonidan investorlarga moliyaviy natijalar haqida ma'lumot berish yig'ilishi."
  },
  {
    "id": 920,
    "input": "Kriptovalyutalarda \"fork\" nima?",
    "output": "\"Fork\" - bu blokcheyn tarmog'ida dasturiy o'zgarishlar tufayli yangi tarmoq yoki qoidalar paydo bo'lishi."
  },
  {
    "id": 921,
    "input": "Forex bozorida \"central bank intervention\" nima?",
    "output": "\"Central bank intervention\" - bu markaziy bankning valyuta narxlarini barqarorlashtirish maqsadida amalga oshirgan harakati."
  },
  {
    "id": 922,
    "input": "Ko'chmas mulkda \"title insurance\" nima?",
    "output": "\"Title insurance\" - bu ko'chmas mulk bo'yicha mulk huquqining qonuniyligini himoya qiluvchi sug'urta turi."
  },
  {
    "id": 923,
    "input": "Aktsiyalarda \"moving average\" nima?",
    "output": "\"Moving average\" - bu vaqt mobaynida aksiyalar narxining o'rtacha qiymatini ko'rsatadigan indikator."
  },
  {
    "id": 924,
    "input": "Moliya bozorida \"margin\" nima?",
    "output": "\"Margin\" - bu savdolarni amalga oshirish uchun brokerga kiritilgan garov summasi."
  },
  {
    "id": 925,
    "input": "Kriptovalyutalarda \"private key\" nima?",
    "output": "\"Private key\" - bu kripto hamyondagi mablag'larga kirish va tranzaksiyalarni tasdiqlash uchun ishlatiladigan maxfiy kod."
  },
  {
    "id": 926,
    "input": "Aktsiyalarda \"circuit breaker\" nima?",
    "output": "\"Circuit breaker\" - bu bozor haddan tashqari tebranganda savdoni vaqtinchalik to'xtatish mexanizmi."
  },
  {
    "id": 927,
    "input": "Ko'chmas mulkda \"real estate investment trust\" (REIT) nima?",
    "output": "\"REIT\" - bu ko'chmas mulkka investitsiya qilish imkonini beruvchi kompaniya yoki fond."
  },
  {
    "id": 928,
    "input": "Forex bozorida \"economic calendar\" nima?",
    "output": "\"Economic calendar\" - bu valyutalarga ta'sir qiluvchi muhim iqtisodiy hodisalar jadvali."
  },
  {
    "id": 929,
    "input": "Moliya bozorida \"yield curve\" nima?",
    "output": "\"Yield curve\" - bu turli muddatdagi obligatsiyalar daromadliligini ifodalovchi grafik."
  },
  {
    "id": 930,
    "input": "Kriptovalyutalarda \"gas fee\" nima?",
    "output": "\"Gas fee\" - bu blokcheyn tarmog'ida tranzaksiyalarni amalga oshirish uchun to'lanadigan to'lov."
  },
  {
    "id": 931,
    "input": "Aktsiyalarda \"shareholder equity\" nima?",
    "output": "\"Shareholder equity\" - bu kompaniyaning aktivlaridan majburiyatlarini ayirgandan keyingi qismi."
  },
  {
    "id": 932,
    "input": "Ko'chmas mulkda \"flipping\" nima?",
    "output": "\"Flipping\" - bu ko'chmas mulkni sotib olib, tezda ta'mirlab, yuqori narxda sotish strategiyasi."
  },
  {
    "id": 933,
    "input": "Forex bozorida \"technical analysis\" nima?",
    "output": "\"Technical analysis\" - bu narx grafigi va tarixiy ma'lumotlarga asoslangan savdo qarorlarini qabul qilish usuli."
  },
  {
    "id": 934,
    "input": "Moliya bozorida \"arbitrage\" nima?",
    "output": "\"Arbitrage\" - bu bir xil aktivni turli bozorlarda narx farqidan foyda ko'rish."
  },
  {
    "id": 935,
    "input": "Kriptovalyutalarda \"consensus mechanism\" nima?",
    "output": "\"Consensus mechanism\" - bu blokcheyn tarmog'idagi tranzaksiyalarni tasdiqlash uchun ishlatiladigan algoritmlar."
  },
  {
    "id": 936,
    "input": "Aktsiyalarda \"stock dilution\" nima?",
    "output": "\"Stock dilution\" - bu yangi aksiyalar chiqarilishi natijasida mavjud aksiyalarning qiymatining pasayishi."
  },
  {
    "id": 937,
    "input": "Ko'chmas mulkda \"real estate agent\" nima?",
    "output": "\"Real estate agent\" - bu ko'chmas mulkni sotish yoki ijaraga berishda vositachilik qiluvchi shaxs."
  },
  {
    "id": 938,
    "input": "Forex bozorida \"carry trade risk\" nima?",
    "output": "\"Carry trade risk\" - bu foiz farqlaridan foyda olish jarayonidagi kurs tebranishlari xavfi."
  },
  {
    "id": 939,
    "input": "Moliya bozorida \"underwriting\" nima?",
    "output": "\"Underwriting\" - bu moliyaviy xavflarni baholash va qoplashga kafolat berish jarayoni."
  },
  {
    "id": 940,
    "input": "Kriptovalyutalarda \"initial coin offering\" (ICO) xavflari nima?",
    "output": "ICO xavflari ichiga firibgarlik, loyihaning muvaffaqiyatsizligi va huquqiy muammolar kiradi."
  },
  {
    "id": 941,
    "input": "Aktsiyalarda \"ex-dividend date\" nima?",
    "output": "\"Ex-dividend date\" - bu dividend olish huquqi tugaydigan kun."
  },
  {
    "id": 942,
    "input": "Ko'chmas mulkda \"cash flow\" nima?",
    "output": "\"Cash flow\" - bu ko'chmas mulkdan olingan sof daromad yoki zarar."
  },
  {
    "id": 943,
    "input": "Forex bozorida \"hedge fund\" nima?",
    "output": "\"Hedge fund\" - bu yuqori daromad olish uchun murakkab strategiyalarni qo'llaydigan investitsiya fondi."
  },
  {
    "id": 944,
    "input": "Moliya bozorida \"credit rating\" nima?",
    "output": "\"Credit rating\" - bu qarzdorning qarzni to'lash qobiliyatini baholovchi reyting."
  },
  {
    "id": 945,
    "input": "Kriptovalyutalarda \"staking rewards\" nima?",
    "output": "\"Staking rewards\" - bu kriptovalyutalarni blokcheynga qo'llab-quvvatlash uchun saqlash orqali olinadigan mukofot."
  },
  {
    "id": 946,
    "input": "Aktsiyalarda \"book value\" nima?",
    "output": "\"Book value\" - bu kompaniyaning sof qiymati, aktivlardan majburiyatlarni ayirgandagi qiymati."
  },
  {
    "id": 947,
    "input": "Ko'chmas mulkda \"land survey\" nima?",
    "output": "\"Land survey\" - bu yer uchastkasining chegaralarini va xususiyatlarini aniqlash jarayoni."
  },
  {
    "id": 948,
    "input": "Forex bozorida \"order execution\" nima?",
    "output": "\"Order execution\" - bu savdo buyurtmasining bozor shartlariga ko'ra bajarilishi."
  },
  {
    "id": 949,
    "input": "Aktsiyalarda \"blue-chip stocks\" nima?",
    "output": "\"Blue-chip stocks\" - bu yirik, barqaror va ishonchli kompaniyalarning aksiyalari."
  },
  {
    "id": 950,
    "input": "Kriptovalyutalarda \"mining pool\" nima?",
    "output": "\"Mining pool\" - bu qazib oluvchilar birgalikda kriptovalyutalar ishlab chiqarish uchun resurslarni birlashtiradigan guruh."
  },
  {
    "id": 951,
    "input": "Forex bozorida \"stop-loss order\" nima?",
    "output": "\"Stop-loss order\" - bu zararlarni cheklash uchun belgilangan narxda savdoni yopish buyurtmasi."
  },
  {
    "id": 952,
    "input": "Ko'chmas mulkda \"gross rental yield\" nima?",
    "output": "\"Gross rental yield\" - bu ko'chmas mulkdan yiliga olingan ijara daromadining aktiv narxiga nisbati."
  },
  {
    "id": 953,
    "input": "Aktsiyalarda \"growth stock\" nima?",
    "output": "\"Growth stock\" - bu yuqori o'sish potentsialiga ega bo'lgan kompaniya aksiyalari."
  },
  {
    "id": 954,
    "input": "Moliya bozorida \"credit default swap\" (CDS) nima?",
    "output": "\"CDS\" - bu qarz majburiyatlarini bajarilmasligidan sug'urtalash uchun ishlatiladigan moliyaviy instrument."
  },
  {
    "id": 955,
    "input": "Kriptovalyutalarda \"rug pull\" nima?",
    "output": "\"Rug pull\" - bu loyihaning ishlab chiquvchilari investorlarning mablag'larini olib, loyihani to'xtatib qo'yadigan firibgarlik turi."
  },
  {
    "id": 956,
    "input": "Aktsiyalarda \"market cap\" nima?",
    "output": "\"Market cap\" - bu kompaniyaning barcha aksiyalarining bozor qiymati (aksiyalar narxi x umumiy soni)."
  },
  {
    "id": 957,
    "input": "Ko'chmas mulkda \"depreciation\" nima?",
    "output": "\"Depreciation\" - bu vaqt o'tishi bilan mulkning qiymatining kamayishi jarayoni."
  },
  {
    "id": 958,
    "input": "Forex bozorida \"scalping\" nima?",
    "output": "\"Scalping\" - bu kichik narx o'zgarishlaridan tez-tez foyda olish strategiyasi."
  },
  {
    "id": 959,
    "input": "Moliya bozorida \"beta coefficient\" nima?",
    "output": "\"Beta coefficient\" - bu aktivning bozor bilan qanday bog'langanligini o'lchovchi indikator."
  },
  {
    "id": 960,
    "input": "Kriptovalyutalarda \"airdrops\" nima?",
    "output": "\"Airdrops\" - bu kriptovalyutalarni marketing yoki foydalanuvchilarni rag'batlantirish maqsadida bepul tarqatish."
  },
  {
    "id": 961,
    "input": "Aktsiyalarda \"stock index\" nima?",
    "output": "\"Stock index\" - bu birjada o'xshash xususiyatlarga ega kompaniyalarning aksiyalari qiymatini kuzatib boruvchi ko'rsatkich."
  },
  {
    "id": 962,
    "input": "Ko'chmas mulkda \"net operating income\" (NOI) nima?",
    "output": "\"NOI\" - bu mulkning daromadi va ekspluatatsiya xarajatlari o'rtasidagi farq."
  },
  {
    "id": 963,
    "input": "Forex bozorida \"price action trading\" nima?",
    "output": "\"Price action trading\" - bu texnik indikatorlardan ko'ra narx harakatlariga asoslangan savdo strategiyasi."
  },
  {
    "id": 964,
    "input": "Moliya bozorida \"junk bonds\" nima?",
    "output": "\"Junk bonds\" - bu yuqori xavfga ega, lekin katta daromad keltiradigan obligatsiyalar."
  },
  {
    "id": 965,
    "input": "Kriptovalyutalarda \"51% attack\" nima?",
    "output": "\"51% attack\" - bu qazib oluvchilar tarmoqdagi hisoblash kuchining 51% yoki undan ko'prog'ini egallab, blokcheynni boshqarishi."
  },
  {
    "id": 966,
    "input": "Aktsiyalarda \"buy-and-hold strategy\" nima?",
    "output": "\"Buy-and-hold strategy\" - bu aksiyalarni uzoq muddatga sotib olish va ushlab turish strategiyasi."
  },
  {
    "id": 967,
    "input": "Ko'chmas mulkda \"appraisal\" nima?",
    "output": "\"Appraisal\" - bu mulkning qiymatini baholash jarayoni, odatda kredit olish yoki sotish uchun."
  },
  {
    "id": 968,
    "input": "Forex bozorida \"trailing stop\" nima?",
    "output": "\"Trailing stop\" - bu savdo narxi oshganda stop-lossni avtomatik ravishda ko'taruvchi buyurtma."
  },
  {
    "id": 969,
    "input": "Moliya bozorida \"debt-to-equity ratio\" nima?",
    "output": "\"Debt-to-equity ratio\" - bu kompaniyaning qarz miqdorini o'z kapitaliga nisbatan ko'rsatadigan ko'rsatkich."
  },
  {
    "id": 970,
    "input": "Kriptovalyutalarda \"node\" nima?",
    "output": "\"Node\" - bu blokcheyn tarmog'ida tranzaksiyalarni saqlash va tekshirish uchun ishlatiladigan qurilma."
  },
  {
    "id": 971,
    "input": "Aktsiyalarda \"day trading\" nima?",
    "output": "\"Day trading\" - bu aksiyalarni kun ichida sotib olish va sotish orqali foyda olish strategiyasi."
  },
  {
    "id": 972,
    "input": "Ko'chmas mulkda \"investment property\" nima?",
    "output": "\"Investment property\" - bu daromad olish yoki qiymatini oshirish maqsadida sotib olingan mulk."
  },
  {
    "id": 973,
    "input": "Forex bozorida \"pip\" nima?",
    "output": "\"Pip\" - bu valyuta juftligidagi eng kichik narx o'zgarishining o'lchov birligi."
  },
  {
    "id": 974,
    "input": "Moliya bozorida \"liquidity risk\" nima?",
    "output": "\"Liquidity risk\" - bu aktivni bozor narxida tezda sotish imkoniyati yo'qligi xavfi."
  },
  {
    "id": 975,
    "input": "Kriptovalyutalarda \"tokenomics\" nima?",
    "output": "\"Tokenomics\" - bu tokenlarning iqtisodiy va funksional xususiyatlarini o'rganadigan soha."
  },
  {
    "id": 976,
    "input": "Aktsiyalarda \"free float\" nima?",
    "output": "\"Free float\" - bu bozor ishtirokchilari tomonidan erkin sotiladigan aksiyalar soni."
  },
  {
    "id": 977,
    "input": "Ko'chmas mulkda \"foreclosure\" nima?",
    "output": "\"Foreclosure\" - bu qarz to'lanmaganligi sababli ko'chmas mulkning egasi tomonidan tortib olinishi."
  },
  {
    "id": 978,
    "input": "Forex bozorida \"lot\" nima?",
    "output": "\"Lot\" - bu valyuta juftligidagi standart savdo hajmi, odatda 100,000 birlik."
  },
  {
    "id": 979,
    "input": "Aktsiyalarda \"dividend yield\" nima?",
    "output": "\"Dividend yield\" - bu aksiyalar bo'yicha yillik dividendlar miqdorining ulush narxiga nisbati."
  },
  {
    "id": 980,
    "input": "Kriptovalyutalarda \"smart contract\" nima?",
    "output": "\"Smart contract\" - bu blokcheyn tarmog'ida avtomatlashtirilgan shartnomalarni bajaruvchi dasturlar."
  },
  {
    "id": 981,
    "input": "Forex bozorida \"spread betting\" nima?",
    "output": "\"Spread betting\" - bu valyuta kurslari farqiga pul tikish orqali foyda olish usuli."
  },
  {
    "id": 982,
    "input": "Ko'chmas mulkda \"capital gains tax\" nima?",
    "output": "\"Capital gains tax\" - bu mulkni sotishdan olingan foydaga solinadigan soliq."
  },
  {
    "id": 983,
    "input": "Aktsiyalarda \"IPO lock-up period\" nima?",
    "output": "\"IPO lock-up period\" - bu yangi IPO aksiyalarini sotishdan oldin belgilangan muddat."
  },
  {
    "id": 984,
    "input": "Moliya bozorida \"derivative\" nima?",
    "output": "\"Derivative\" - bu aktiv narxiga bog'liq bo'lgan moliyaviy instrument, masalan, fyucherslar."
  },
  {
    "id": 985,
    "input": "Kriptovalyutalarda \"proof of work\" nima?",
    "output": "\"Proof of work\" - bu tranzaksiyalarni tasdiqlash uchun hisoblash kuchini ishlatadigan mexanizm."
  },
  {
    "id": 986,
    "input": "Aktsiyalarda \"equity financing\" nima?",
    "output": "\"Equity financing\" - bu kompaniya aksiyalarini sotish orqali kapital yig'ish usuli."
  },
  {
    "id": 987,
    "input": "Ko'chmas mulkda \"home inspection\" nima?",
    "output": "\"Home inspection\" - bu mulkning holatini sotishdan oldin baholash jarayoni."
  },
  {
    "id": 988,
    "input": "Forex bozorida \"reserve currency\" nima?",
    "output": "\"Reserve currency\" - bu xalqaro savdo va moliyaviy tranzaksiyalarda keng qo'llaniladigan valyuta."
  },
  {
    "id": 989,
    "input": "Moliya bozorida \"hedging\" nima?",
    "output": "\"Hedging\" - bu moliyaviy yo'qotish xavfini kamaytirish uchun ishlatiladigan strategiya."
  },
  {
    "id": 990,
    "input": "Kriptovalyutalarda \"whale\" nima?",
    "output": "\"Whale\" - bu katta miqdorda kriptovalyutaga ega bo'lgan shaxs yoki tashkilot."
  },
  {
    "id": 991,
    "input": "Aktsiyalarda \"value stock\" nima?",
    "output": "\"Value stock\" - bu bozorda past baholangan, lekin ichki qiymati yuqori bo'lgan aksiyalar."
  },
  {
    "id": 992,
    "input": "Ko'chmas mulkda \"mortgage pre-approval\" nima?",
    "output": "\"Mortgage pre-approval\" - bu qarz beruvchidan oldindan kredit olish imkoniyatini tasdiqlash."
  },
  {
    "id": 993,
    "input": "Forex bozorida \"currency correlation\" nima?",
    "output": "\"Currency correlation\" - bu ikki valyutaning narxlari bir-biriga bog'liqlik darajasidir."
  },
  {
    "id": 994,
    "input": "Moliya bozorida \"short-term liquidity\" nima?",
    "output": "\"Short-term liquidity\" - bu aktivlarni tezda naqd pulga aylantirish qobiliyati."
  },
  {
    "id": 995,
    "input": "Kriptovalyutalarda \"token burn\" nima?",
    "output": "\"Token burn\" - bu tokenlarning miqdorini kamaytirish uchun ularni yo'q qilish jarayoni."
  },
  {
    "id": 996,
    "input": "Aktsiyalarda \"stock buyback program\" nima?",
    "output": "\"Stock buyback program\" - bu kompaniyaning aksiyalarni qayta sotib olish uchun rejasi."
  },
  {
    "id": 997,
    "input": "Ko'chmas mulkda \"escrow account\" nima?",
    "output": "\"Escrow account\" - bu pul yoki hujjatlarni xavfsiz saqlash uchun foydalaniladigan hisob."
  },
  {
    "id": 998,
    "input": "Forex bozorida \"news trading\" nima?",
    "output": "\"News trading\" - bu iqtisodiy yangiliklarga asoslangan savdo strategiyasi."
  },
  {
    "id": 999,
    "input": "Moliya bozorida \"interest rate risk\" nima?",
    "output": "\"Interest rate risk\" - bu foiz stavkalarining o'zgarishi natijasida aktiv narxining pasayishi xavfi."
  },
  {
    "id": 1000,
    "input": "Kriptovalyutalarda \"block reward\" nima?",
    "output": "\"Block reward\" - bu yangi blok yaratgan qazib oluvchiga beriladigan mukofot."
  },
  {
    "id": 1001,
    "input": "Aktsiyalarda \"bear market\" nima?",
    "output": "\"Bear market\" - bu aksiyalar narxlari pasayib borayotgan bozor holati."
  },
  {
    "id": 1002,
    "input": "Ko'chmas mulkda \"tenancy agreement\" nima?",
    "output": "\"Tenancy agreement\" - bu mulk egasi va ijarachi o'rtasidagi ijara shartnomasi."
  },
  {
    "id": 1003,
    "input": "Forex bozorida \"swap rate\" nima?",
    "output": "\"Swap rate\" - bu pozitsiyani bir kunlik ushlab turish uchun to'lanadigan yoki olinadigan foiz."
  },
  {
    "id": 1004,
    "input": "Moliya bozorida \"alpha\" nima?",
    "output": "\"Alpha\" - bu investitsiyaning bozor ko'rsatkichlariga nisbatan qo'shimcha daromadi."
  },
  {
    "id": 1005,
    "input": "Kriptovalyutalarda \"hash rate\" nima?",
    "output": "\"Hash rate\" - bu tarmoqdagi qazib olish quvvatining o'lchovi."
  },
  {
    "id": 1006,
    "input": "Aktsiyalarda \"growth vs value investing\" nima?",
    "output": "\"Growth investing\" - yuqori o'sish potentsialiga ega aksiyalarga sarmoya kiritish; \"Value investing\" - bahosi past aksiyalarga sarmoya kiritish strategiyasi."
  },
  {
    "id": 1007,
    "input": "Ko'chmas mulkda \"underwater mortgage\" nima?",
    "output": "\"Underwater mortgage\" - bu qarz miqdori mulkning bozor qiymatidan yuqori bo'lgan holat."
  },
  {
    "id": 1008,
    "input": "Forex bozorida \"economic divergence\" nima?",
    "output": "\"Economic divergence\" - bu mamlakatlar iqtisodiy ko'rsatkichlaridagi farq."
  },
  {
    "id": 1009,
    "input": "Aktsiyalarda \"penny stocks\" nima?",
    "output": "\"Penny stocks\" - bu past narxda savdo qilinadigan, odatda kichik kompaniyalar aksiyalari."
  },
  {
    "id": 1010,
    "input": "Kriptovalyutalarda \"decentralized exchange\" (DEX) nima?",
    "output": "\"DEX\" - bu markaziy vositachilarsiz kriptovalyutalarni sotib olish va sotish mumkin bo'lgan platforma."
  },
  {
    "id": 1011,
    "input": "Forex bozorida \"position sizing\" nima?",
    "output": "\"Position sizing\" - bu savdo hajmini xavfga nisbatan boshqarish strategiyasi."
  },
  {
    "id": 1012,
    "input": "Ko'chmas mulkda \"zoning laws\" nima?",
    "output": "\"Zoning laws\" - bu hududlarda yer va binolarni qanday ishlatish mumkinligini belgilovchi qonunlar."
  },
  {
    "id": 1013,
    "input": "Aktsiyalarda \"market sentiment\" nima?",
    "output": "\"Market sentiment\" - bu bozor ishtirokchilarining umumiy ruhiyati yoki hissiyoti."
  },
  {
    "id": 1014,
    "input": "Moliya bozorida \"options contract\" nima?",
    "output": "\"Options contract\" - bu aktivni kelajakda belgilangan narxda sotib olish yoki sotish huquqi."
  },
  {
    "id": 1015,
    "input": "Kriptovalyutalarda \"hot wallet\" va \"cold wallet\" o'rtasidagi farq nima?",
    "output": "\"Hot wallet\" - onlayn saqlash vositasi, \"Cold wallet\" - oflayn, xavfsiz saqlash vositasi."
  },
  {
    "id": 1016,
    "input": "Aktsiyalarda \"earnings per share\" (EPS) nima?",
    "output": "\"EPS\" - bu kompaniyaning sof daromadining chiqarilgan aksiyalar soniga nisbati."
  },
  {
    "id": 1017,
    "input": "Ko'chmas mulkda \"equity\" nima?",
    "output": "\"Equity\" - bu mulkning bozor qiymatidan qolgan qarzni ayirganidagi qismi."
  }
]