 [
    {
      "id": 1,
      "input": "Qanday qilib grippdan himoyalanish mumkin?",
      "output": "Grippdan himoyalanish uchun yil davomida vaksina olish, qo'lni tez-tez yuvish va odamlar ko'p to'planadigan joylardan qochish tavsiya etiladi."
    },
    {
      "id": 2,
      "input": "Yuqori qon bosimini qanday aniqlash mumkin?",
      "output": "Qon bosimini o'lchash kerak yoki shifokor va o'z-o'zini tekshirish qurilmalari yordamida amalga oshirish mumkin."
    },
    {
      "id": 3,
      "input": "Sog'lom uyquning ahamiyati nima?",
      "output": "Stressni kamaytiradi va umumiy sog'liqni yaxshilaydi. Bolalar uchun 9-12 soat, kattalar uchun esa 7-9 soat uyqu tavsiya etiladi."
    },
    {
      "id": 4,
      "input": "Oziq-ovqatdagilardan qaysi vitaminlar bolalar uchun zarur?",
      "output": "Bolalar uchun A, C, D, va B vitaminlari juda muhimdir. "
    },
    {
      "id": 5,
      "input": " Giyohvandlik nima va qanday alomatlari bor?",
      "output": "Bu odamning giyohvand moddalarga qaramligi. Alomatlari kayfiyat o'zgarishi, xotira muammolari va ijtimoiy izolyatsiya bo'lishi mumkin."
    },
    {
      "id": 6,
      "input": "Nafas olish muammolari qanday bo'lishi mumkin?",
      "output": "Nafas olish muammolari astma, bronxit, yoki allergiya natijasida kelib chiqishi mumkin."
    },
    {
      "id": 7,
      "input": "Oziq-ovqat allergiyasi qanday aniqlanadi?",
      "output": "Oziq-ovqat allergiyasini aniqlash uchun shifokor allergiya testi yoki oziq-ovqat jurnalini olib borishni tavsiya etishi mumkin. "
    },
    {
      "id": 8,
      "input": "Qon quyish nima va qachon kerak bo'ladi?",
      "output": "Qon quyish - bu qonning yo'qotilishi natijasida organizmni tiklash uchun qon berish jarayoni. "
    },
    {
      "id": 9,
      "input": " Infektsiyalarni qanday oldini olish mumkin?",
      "output": " Infektsiyalarni oldini olish uchun qo'llarni to'g'ri yuvish, sog'lom ovqatlanish, muntazam jismoniy faoliyat va vaksinatsiya qilish muhimdir."
    },
    {
      "id": 10,
      "input": "Qaysi oziq-ovqatlar temirga boy?",
      "output": " Temirga boy oziq-ovqatlar orasida qizil go'sht, tovuq, baliq, dukkaklilar, yasmiq va qizil sabzavotlar mavjud."
    },
    {
      "id": 11,
      "input": "Oʻzingizni oʻz oilaviy qadriyatlaringizga qanchalik sodiq deb hisoblaysiz?",
      "output": "Oilaviy qadriyatlarni hurmat qilaman, lekin amal qilmayman."
    },
    {
      "id": 12,
      "input": "Oziq-ovqat allergiyasi nima?",
      "output": "Oziq-ovqat allergiyasi immun tizimining oziq-ovqat moddalari bilan reaksiyasi."
    },
    {
      "id": 13,
      "input": "Hipertoniya nima?",
      "output": "Hipertoniya qon bosimining doimiy ravishda yuqori bo'lishi holatidir."
    },
    {
      "id": 14,
      "input": "Gripp va sovuq urish orasidagi farq nima?",
      "output": "Gripp virus orqali yuqadi, sovuq urish esa asosan bakteriyalardan kelib chiqadi."
    },
    {
      "id": 15,
      "input": "Qon guruhlari qancha turga bo'linadi?",
      "output": "To'rt tur: A, B, AB, O."
    },
    {
      "id": 16,
      "input": "Qonning vazifalari qanday?",
      "output": "Oziq-ovqat va kislorodni tashish, ortiqcha moddalarni chiqarish, immun tizimining himoyasi."
    },
    {
      "id": 17,
      "input": "Astma nima?",
      "output": "Astma nafas olishda qiyinchilik, yo'tal va havo yo'llarining torayishi bilan kechadigan surunkali kasallik."
    },
    {
      "id": 18,
      "input": "Yallig'lanish nima?",
      "output": "Yallig'lanish — organizmning zararlanishga javoban rivojlanadigan himoya reaksiyasi."
    },
    {
      "id": 19,
      "input": "Pneumoniya qanday kasallik?",
      "output": "Pneumoniya o'pkada yallig'lanish bo'lib, odatda infektsiya sababli yuzaga keladi."
    },
    {
      "id": 20,
      "input": "Apenditsit nima?",
      "output": "Apenditsit iltihoblanish bo'lib, appeniks deb ataladigan ichak qismining yallig'lanishidir."
    },
    {
      "id": 21,
      "input": "Bemorga qancha suyuqlik kerak?",
      "output": "Odatda, kundalik suyuqlik miqdori 1.5-2 litr orasida bo'lishi kerak."
    },
    {
      "id": 22,
      "input": "Suyaklar qanday yordam beradi?",
      "output": "Suyaklar tanani qo'llab-quvvatlaydi, organlarni himoya qiladi va harakatni ta'minlaydi."
    },
    {
      "id": 23,
      "input": "O'pkada qanday kasalliklar ko'proq uchraydi?",
      "output": "Gripp, pnevmoniya, astma, bronxit kabi kasalliklar o'pkada ko'proq uchraydi."
    },
    {
      "id": 24,
      "input": "Altsgeymer kasalligi qanday keltirib chiqaradi?",
      "output": "Altsgeymer kasalligi miya hujayralarining yo'qolishi va miyadagi asab tizimining ishlashining buzilishi bilan bog'liq."
    },
    {
      "id": 25,
      "input": "Tibbiyotda \"bakteriya\" deganda nima tushuniladi?",
      "output": "Bakteriyalar — mikroskopik, ko'pchilik holatda kasalliklarni keltirib chiqaradigan mikroorganizmlar."
    },
    {
      "id": 26,
      "input": "Masofadan tibbiy yordam ko'rsatishning afzalliklari nimalar?",
      "output": "Masofadan tibbiy yordam tezkorlik, arzonlik va geografik cheklovlardan xalos bo'lishni ta'minlaydi."
    },
    {
      "id": 27,
      "input": "Antibiotiklarni qanday holatlarda qabul qilish kerak?",
      "output": "Antibiotiklar faqat bakterial infeksiya holatida va shifokor ko'rsatmasiga binoan qabul qilinadi."
    },
    {
      "id": 28,
      "input": "Diabetga nima sabab bo'lishi mumkin?",
      "output": "Diabet organizmning insulin ishlab chiqarish qobiliyatining pasayishi yoki insulin ishlatish qobiliyatining yo'qolishi sabab bo'ladi."
    },
    {
      "id": 29,
      "input": "Oyoq og'rig'i qanday kasalliklardan dalolat beradi?",
      "output": "Oyoq og'rig'i artrit, mushak yirtilishi, venalarning qon oqimi buzilishi kabi kasalliklardan kelib chiqishi mumkin."
    },
    {
      "id": 30,
      "input": "Bosh og'rig'i qanday turdagi kasalliklarga olib kelishi mumkin?",
      "output": "Bosh og'rig'i migren, gipertermiya, sinusit yoki bosim ortishi kabi kasalliklarning belgisi bo'lishi mumkin."
    },
    {
      "id": 31,
      "input": "Oyoqlardagi varikoz qanday kasallik?",
      "output": "Varikoz — oyoqlarda venalar kengayishi va zaiflashishi natijasida yuzaga keladigan kasallik."
    },
    {
      "id": 32,
      "input": "Yurak xuruji nima?",
      "output": "Yurak xuruji — yurak mushaklarining bir qismida qon oqimi to'xtab qolishi yoki qisqa vaqtli uzilishlar bilan yuzaga keladigan holat."
    },
    {
      "id": 33,
      "input": "Sog'lom turmush tarzi qanday bo'lishi kerak?",
      "output": "Sog'lom turmush tarzi to'g'ri ovqatlanish, jismoniy faollik, stressni boshqarish, yetarlicha uxlashni o'z ichiga oladi."
    },
    {
      "id": 34,
      "input": "Tibbiyotda \"vaksina\" nima?",
      "output": "Vaksina — organizmni ma'lum bir infektsiyaga qarshi immunizatsiya qilish uchun ishlatiladigan modda."
    },
    {
      "id": 35,
      "input": "Uzoq muddatli og'riqni qanday boshqarish mumkin?",
      "output": "Og'riqni boshqarish uchun dori-darmonlar, fizioterapiya, akupunktura va boshqa usullar qo'llaniladi."
    },
    {
      "id": 36,
      "input": "Tibbiyotda \"onkologiya\" nima?",
      "output": "Onkologiya saraton kasalliklarini o'rganadigan tibbiyot sohasidir."
    },
    {
      "id": 37,
      "input": "Ko'z kasalliklarining oldini olish uchun nima qilish kerak?",
      "output": "Ko'zlarni himoya qilish, to'g'ri ovqatlanish, UV nurlardan saqlanish va muntazam ko'z tekshiruvlari o'tkazish zarur."
    },
    {
      "id": 38,
      "input": "Yomon holatda bo'lgan yurakni qanday saqlab qolish mumkin?",
      "output": "Sog'lom ovqatlanish, muntazam mashqlar, stressni kamaytirish va kerakli dorilarni qabul qilish yordam beradi."
    },
    {
      "id": 39,
      "input": "Tashqi asoratlar nima?",
      "output": "Tashqi asoratlar organizmga ta'sir qiladigan tashqi omillar yoki shikastlanishlar natijasida yuzaga keladigan holatlar."
    },
    {
      "id": 40,
      "input": "Bachadon saratoni qanday alomatlar ko'rsatadi?",
      "output": "Bachadon saratoni qonda qon ketishi, og'riq, tana og'rig'i va boshqa ko'rinishlarda alomatlar keltirib chiqarishi mumkin."
    },
    {
      "id": 41,
      "input": "Sog'lom yurakni qanday saqlash mumkin?",
      "output": "Sog'lom yurakni saqlash uchun to'g'ri ovqatlanish, jismoniy faoliyat va stressni kamaytirish zarur."
    },
    {
      "id": 42,
      "input": "Yangi tug'ilgan chaqaloqni emizishning afzalliklari qanday?",
      "output": "Yangi tug'ilgan chaqaloqqa ona suti immunitetni mustahkamlash, oziqlanish va rivojlanish uchun foydalidir."
    },
    {
      "id": 43,
      "input": "Bolalar uchun vaksinatsiya nima?",
      "output": "Bolalar uchun vaksinatsiya ularni kasalliklardan himoya qilish va immun tizimlarini kuchaytirish uchun amalga oshiriladi."
    },
    {
      "id": 44,
      "input": "Sog'liqni saqlashda \"prevenstiv\" so'zi nima anglatadi?",
      "output": "\"Prevenstiv\" — kasalliklarning oldini olishga qaratilgan yondashuv yoki choralar."
    },
    {
      "id": 45,
      "input": "Saratonni qanday aniqlash mumkin?",
      "output": "Saratonni aniqlash uchun tahlillar, tasvirlash usullari va biopsisiz tekshiruvlar amalga oshiriladi."
    },
    {
      "id": 46,
      "input": "Miya qon aylanishini yaxshilash uchun nima qilish kerak?",
      "output": "Jismoniy faoliyat, sog'lom ovqatlanish va stressni boshqarish miya qon aylanishini yaxshilashga yordam beradi."
    },
    {
      "id": 47,
      "input": "Alergiya qanday kasalliklarni keltirib chiqarishi mumkin?",
      "output": "Alergiya astma, sinusit, dermatitis, rinit va boshqalar kabi kasalliklarni keltirib chiqarishi mumkin."
    },
    {
      "id": 48,
      "input": "Suv ichishning sog'liq uchun foydalari nimalar?",
      "output": "Suv tanadagi moddalar almashinuvini tartibga soladi, terini namlaydi va toksinlarni chiqaradi."
    },
    {
      "id": 49,
      "input": "Hipo- va giperglisemiya nima?",
      "output": "Hipo-glysemiya qonda shakar miqdorining pastligi, giperglisemiya esa yuqoriligi holatidir."
    },
    {
      "id": 50,
      "input": "Yurak xuruji paytida nima qilish kerak?",
      "output": "Yurak xuruji paytida darhol tibbiy yordamga murojaat qilish, tinchlanish va nafas olishni nazorat qilish zarur."
    },
    {
      "id": 51,
      "input": "Onkologik kasalliklar oldini olishda qanday chora-tadbirlar bor?",
      "output": "Sog'lom turmush tarzini olib borish, chekishni tark etish, muntazam tekshiruvlar va to'g'ri ovqatlanish kerak."
    },
    {
      "id": 52,
      "input": "Qarish jarayonida tanadagi qanday o'zgarishlar yuz beradi?",
      "output": "Muskullar kuchsizlanadi, suyaklar zaiflashadi, teri burishadi va metabolizm sekinlashadi."
    },
    {
      "id": 53,
      "input": "Sog'lom immun tizimi uchun nima qilish kerak?",
      "output": "Sog'lom immun tizimi uchun muntazam jismoniy faoliyat, to'g'ri ovqatlanish va yaxshi uyqu zarur."
    },
    {
      "id": 54,
      "input": "Tibbiyotda \"reabilitatsiya\" deganda nima tushuniladi?",
      "output": "Reabilitatsiya — kasallikdan yoki jarohatdan so'ng organizmni tiklash va tiklash uchun muolajalar."
    },
    {
      "id": 55,
      "input": "Muntazam uyquning ahamiyati nima?",
      "output": "Muntazam uyqu tananing tiklanishi, ruhiy holatning yaxshilanishi va immun tizimining kuchayishiga yordam beradi."
    },
    {
      "id": 56,
      "input": "Qon aylanishi uchun eng yaxshi mashqlar nimalar?",
      "output": "Yurish, yugurish, suzish va velosipedda yurish qon aylanishini yaxshilashga yordam beradi."
    },
    {
      "id": 57,
      "input": "O'tkir respirator kasalliklar nima?",
      "output": "O'tkir respirator kasalliklar yo'tal, nafas qisilishi va yuqori nafas yo'llarining yallig'lanishi bilan kechadi."
    },
    {
      "id": 58,
      "input": "Endokrin tizimi qanday ishlaydi?",
      "output": "Endokrin tizimi gormonlarni ishlab chiqarish orqali tanadagi turli funktsiyalarni boshqaradi."
    },
    {
      "id": 59,
      "input": "Stressni kamaytirish uchun qanday usullar mavjud?",
      "output": "Meditatsiya, nafas olish mashqlari, yoga, sport va muntazam dam olish stressni kamaytirishga yordam beradi."
    },
    {
      "id": 60,
      "input": "Allergiya qachon xavfli bo'lishi mumkin?",
      "output": "Agar allergik reaksiya nafas olish yo'llarini toraysa yoki anafilaksiya yuzaga kelsa, bu xavfli bo'lishi mumkin."
    },
    {
      "id": 61,
      "input": "O'tkir bosh og'rig'i qanday davolanadi?",
      "output": "O'tkir bosh og'rig'ini davolash uchun dori-darmonlar, dam olish va stressni kamaytirish kerak."
    },
    {
      "id": 62,
      "input": "Tibbiyotda \"psixologiya\" nima?",
      "output": "Psixologiya insonning ruhiy holati, his-tuyg'ulari, va xulq-atvorini o'rganadigan ilm-fan sohasidir."
    },
    {
      "id": 63,
      "input": "Sog'liqni saqlashda \"genetika\" qanday rol o'ynaydi?",
      "output": "Genetika genetik kasalliklar va predispozitsiyalarning aniqlanishida muhim rol o'ynaydi."
    },
    {
      "id": 64,
      "input": "Vaksinalarning ahamiyati nima?",
      "output": "Vaksinalar organizmni infektsiyalarga qarshi himoya qilish uchun immunitet yaratadi."
    },
    {
      "id": 65,
      "input": "D vitamini yetishmasligi qanday salbiy ta'sir ko'rsatadi?",
      "output": "D vitamini yetishmasligi suyaklar zaiflashishiga, mushaklar og'rig'iga va immun tizimining zaiflashishiga olib kelishi mumkin."
    },
    {
      "id": 66,
      "input": "Tibbiyotda \"infektsiya\" deganda nima tushuniladi?",
      "output": "Infektsiya — mikroorganizmlar (bakteriyalar, viruslar, qo'ziqorinlar) tomonidan organizmda keltirilgan zararlanish."
    },
    {
      "id": 67,
      "input": "Yara qanday tez tuzaladi?",
      "output": "Yara tezroq tuzalishi uchun toza saqlash, infektsiyalardan himoya qilish va muntazam antiseptik ishlatish zarur."
    },
    {
      "id": 68,
      "input": "Gormonal disbalans qanday alomatlar keltirishi mumkin?",
      "output": "Gormonal disbalans og'irlikni orttirish, kayfiyat o'zgarishlari, uyqusizlik va reproduktiv tizimda muammolarga olib kelishi mumkin."
    },
    {
      "id": 69,
      "input": "Ko'krak saratonidan qanday saqlanish mumkin?",
      "output": "Muntazam ko'krak tekshiruvlari, sog'lom turmush tarzini olib borish, sigaret chekishni tark etish va alkoholni cheklash kerak."
    },
    {
      "id": 70,
      "input": "Anafiliaksiya qanday holatda yuzaga keladi?",
      "output": "Anafiliaksiya — jiddiy allergik reaksiya bo'lib, tezda davolanishni talab qiladi."
    },
    {
      "id": 71,
      "input": "Qon quyish nima uchun kerak?",
      "output": "Qon quyish qon miqdorining kamayishi yoki qonning tarkibi o'zgargan holatlarda hayotni saqlab qolish uchun kerak bo'lishi mumkin."
    },
    {
      "id": 72,
      "input": "Mikrobiota nima?",
      "output": "Mikrobiota organizmda yashovchi mikroorganizmlar jamlanmasidir va u immun tizimiga ta'sir qiladi."
    },
    {
      "id": 73,
      "input": "Imunitetni kuchaytirish uchun qanday ovqatlar kerak?",
      "output": "Sariyog', yong'oq, mevalar, sabzavotlar va yog'li baliq immun tizimini kuchaytirishga yordam beradi."
    },
    {
      "id": 74,
      "input": "Hipotermiya qanday xavf tug'diradi?",
      "output": "Hipotermiya — tana harorati juda past bo'lishi holatida organizmning hayotiy faoliyatini buzishi mumkin."
    },
    {
      "id": 75,
      "input": "Yangi tug'ilgan chaqaloqni parvarishlashda qanday e'tibor kerak?",
      "output": "Yangi tug'ilgan chaqaloqni isitish, toza saqlash va emizish zarur."
    },
    {
      "id": 76,
      "input": "Diabetni qanday davolash mumkin?",
      "output": "Diabetni davolash insulin terapiyasi, dietaga rioya qilish va jismoniy faollikni oshirish bilan amalga oshiriladi."
    },
    {
      "id": 77,
      "input": "O'pkada yallig'lanishni qanday davolash mumkin?",
      "output": "O'pkadagi yallig'lanish antibiotiklar, nafas mashqlari va oksigen terapiyasi orqali davolanadi."
    },
    {
      "id": 78,
      "input": "Jigar qanday vazifalarni bajaradi?",
      "output": "Jigar toksinlarni tozalaydi, hazm qilishda yordam beradi, vitamin va minerallarni saqlaydi."
    },
    {
      "id": 79,
      "input": "Yangi tug'ilgan chaqaloqlarda yengil isitma nima sababdan yuzaga keladi?",
      "output": "Yengil isitma yangi tug'ilgan chaqaloqlarda immun tizimining rivojlanishi va tashqi muhitga moslashish jarayonida yuzaga keladi."
    },
    {
      "id": 80,
      "input": "Bosh aylanishi va hushdan ketish nima sababdan yuzaga keladi?",
      "output": "Bosh aylanishi va hushdan ketish qon bosimi tushishi, dehidratatsiya yoki yurak muammolari sababli yuzaga kelishi mumkin."
    },
    {
      "id": 81,
      "input": "Jismoniy faoliyatni ko'paytirishning foydalari nimalar?",
      "output": "Jismoniy faoliyat yurakni mustahkamlash, suyaklarni kuchaytirish va umumiy salomatlikni yaxshilashga yordam beradi."
    },
    {
      "id": 82,
      "input": "Jarohatlarni qanday tez tuzatish mumkin?",
      "output": "Jarohatlarni tez tuzatish uchun toza saqlash, antiseptiklar ishlatish va tana tiklanishiga yordam beradigan dam olish zarur."
    },
    {
      "id": 83,
      "input": "Tibbiyotda \"kardiologiya\" nima?",
      "output": "Kardiologiya yurak va qon tomir tizimini o'rganadigan tibbiyot sohasidir."
    },
    {
      "id": 84,
      "input": "Inson tanasida qancha suyak bor?",
      "output": "Inson tanasida taxminan 206 ta suyak mavjud."
    },
    {
      "id": 85,
      "input": "Xolesterin nima?",
      "output": "Xolesterin organizmda yog'li moddalardir, lekin u yuqori darajada bo'lsa, yurak kasalliklarini keltirib chiqarishi mumkin."
    },
    {
      "id": 86,
      "input": "Yana qanday kasalliklar jigarni zarar qiladi?",
      "output": "Jigarni zarar qiluvchi kasalliklar orasida gepatit, jigar sirrozi va yog'li jigar kasalliklari mavjud."
    },
    {
      "id": 87,
      "input": "Uzoq muddatli noqulaylikni qanday boshqarish mumkin?",
      "output": "Uzoq muddatli noqulaylikni dori-darmonlar, fizioterapiya, stressni boshqarish va psixologik yordam orqali boshqarish mumkin."
    },
    {
      "id": 88,
      "input": "Nafas olishni yengillashtirish uchun qanday usullar mavjud?",
      "output": "Nafas olish mashqlari, yog'ani kamaytirish va muntazam jismoniy faollik nafas olishni yengillashtiradi."
    },
    {
      "id": 89,
      "input": "Anemiya qanday kasallik?",
      "output": "Anemiya qonda qon hujayralarining yetishmasligi yoki kislorod tashish qobiliyatining pasayishiga olib keladigan holatdir."
    },
    {
      "id": 90,
      "input": "Narkotik moddalar organizmga qanday ta'sir qiladi?",
      "output": "Narkotik moddalar miyaga ta'sir qiladi, xotira va ruhiy holatni buzadi, jismoniy va ruhiy salomatlikka zarar yetkazadi."
    },
    {
      "id": 91,
      "input": "Parvovirus B19 nima kasallik keltirib chiqaradi?",
      "output": "Parvovirus B19 asosan bolalarda qo'ldan oyoqqa o'tuvchi kasalliklar, masalan, qizilcha, yuzaga keltirishi mumkin."
    },
    {
      "id": 92,
      "input": "Hipotoniya nima?",
      "output": "Hipotoniya qon bosimining pastligi holatidir, bu esa bosh aylanishi, charchoq va hushdan ketishga olib kelishi mumkin."
    },
    {
      "id": 93,
      "input": "Stres organizmga qanday ta'sir qiladi?",
      "output": "Stres tanadagi gormonlarni o'zgartiradi, yurak urishini tezlashtiradi va immun tizimining ish faoliyatini pasaytiradi."
    },
    {
      "id": 94,
      "input": "Suvsizlanishning alomatlari nimalar?",
      "output": "Suvsizlanish og'iz qurishi, charchoq, bosh og'rig'i, qattiq siydik va terlashning kamayishi kabi alomatlar bilan ko'rsatiladi."
    },
    {
      "id": 95,
      "input": "Qon donorligi nima?",
      "output": "Qon donorligi — boshqalarga yordam berish maqsadida qon yoki uning tarkibiy qismlarini donorlardan olish jarayonidir."
    },
    {
      "id": 96,
      "input": "Ko'z kasalliklarini qanday oldini olish mumkin?",
      "output": "Ko'z kasalliklarini oldini olish uchun UV nurlaridan himoya qilish, to'g'ri ovqatlanish va muntazam ko'z tekshiruvlarini o'tkazish kerak."
    },
    {
      "id": 97,
      "input": "Qon aylanishi qanday tizimda ishlaydi?",
      "output": "Qon aylanishi yurak va qon tomirlaridan iborat tizim bo'lib, qonning butun tana bo'ylab aylanishini ta'minlaydi."
    },
    {
      "id": 98,
      "input": "Ko'p yotishning salbiy ta'sirlari qanday?",
      "output": "Ko'p yotish mushaklarni kuchsizlantiradi, qondagi shakar va xolesterin darajasini oshiradi va yurak kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 99,
      "input": "Sog'lom immun tizimi uchun qanday vitaminlar zarur?",
      "output": "C vitamini, D vitamini va sink immun tizimining normal ishlashini ta'minlaydi."
    },
    {
      "id": 100,
      "input": "O'pkada havo yo'llarining to'lib qolishi qanday kasalliklarni keltirib chiqaradi?",
      "output": "O'pkada havo yo'llarining to'lib qolishi bronxit, astma va pnevmoniya kabi kasalliklarni keltirib chiqarishi mumkin."
    },
    {
      "id": 101,
      "input": "Allergiya haqida ko'proq nimalarni bilish kerak?",
      "output": "Allergiya immun tizimining zararli moddalar bilan befarq bo'lmasligi va bu moddaga qarshi kuchli reaksiya berishidir."
    },
    {
      "id": 102,
      "input": "Xurmo qanday foydalari bor?",
      "output": "Xurmo yuqori darajada vitamin va minerallarga boy, yurakni himoya qiladi va qon bosimini normallashtiradi."
    },
    {
      "id": 103,
      "input": "Saratonni qanday erta aniqlash mumkin?",
      "output": "Saratonni erta aniqlash uchun muntazam tibbiy tekshiruvlar, biopsiya, rentgen va boshqa skrining testlari kerak."
    },
    {
      "id": 104,
      "input": "Tibbiyotda \"fizioterapiya\" nima?",
      "output": "Fizioterapiya tana harakatlanuvchanligini tiklash, og'riqni kamaytirish va mushaklarni kuchaytirish uchun ishlatiladigan davolash usuli."
    },
    {
      "id": 105,
      "input": "Miya shikastlanishlarining davolash usullari qanday?",
      "output": "Miya shikastlanishlarini davolash uchun reabilitatsiya, dorilar va fizioterapiya ishlatiladi."
    },
    {
      "id": 106,
      "input": "Uyqu buzilishi qanday kasalliklarga olib kelishi mumkin?",
      "output": "Uyqu buzilishi stress, depressiya, yuqori qon bosimi va boshqa jismoniy va ruhiy muammolarga olib kelishi mumkin."
    },
    {
      "id": 107,
      "input": "Tibbiyotda \"xirurgiya\" nima?",
      "output": "Xirurgiya jarohatlarni davolash, kasalliklarni bartaraf etish yoki operatsiyalarni o'tkazish bilan shug'ullanadigan tibbiyot sohasidir."
    },
    {
      "id": 108,
      "input": "Oziq-ovqatni qanday to'g'ri tanlash kerak?",
      "output": "Oziq-ovqatni to'g'ri tanlash uchun kam yog'li, kam shakarli, ko'proq sabzavot va mevalarni o'z ichiga olgan dietaga rioya qilish zarur."
    },
    {
      "id": 109,
      "input": "Sog'lom semirish uchun nima qilish kerak?",
      "output": "Sog'lom semirish uchun to'g'ri ovqatlanish, oqsilga boy oziq-ovqatlar va muntazam jismoniy faoliyat zarur."
    },
    {
      "id": 110,
      "input": "O'zini yomon his qilgan odamga qanday yordam berish kerak?",
      "output": "O'zini yomon his qilgan odamga tinchlik berish, zarur bo'lsa tibbiy yordam chaqirish va suvsizlanishga yo'l qo'ymaslik kerak."
    },
    {
      "id": 111,
      "input": "Akne nima?",
      "output": "Akne — yuz, ko'krak va yelkalarda paydo bo'ladigan yallig'lanishli teri kasalligi bo'lib, asosan o'smirlikda uchraydi."
    },
    {
      "id": 112,
      "input": "Qandli diabetni qanday oldini olish mumkin?",
      "output": "Sog'lom turmush tarzini olib borish, muntazam jismoniy faollik, to'g'ri ovqatlanish va vaznni nazorat qilish orqali qandli diabetni oldini olish mumkin."
    },
    {
      "id": 113,
      "input": "Tibbiyotda \"nefrologiya\" nima?",
      "output": "Nefrologiya buyrak kasalliklarini o'rganadigan tibbiyot sohasidir."
    },
    {
      "id": 114,
      "input": "Yangi tug'ilgan chaqaloqni emizish nega muhim?",
      "output": "Yangi tug'ilgan chaqaloqni emizish uning immun tizimini mustahkamlash, o'sishini qo'llab-quvvatlash va o'zgaruvchan ehtiyojlariga javob berish uchun muhimdir."
    },
    {
      "id": 115,
      "input": "Hayz ko'rishning izchil bo'lishi nima sababdan yuzaga keladi?",
      "output": "Hayz ko'rishning izchil bo'lishi gormonal muvozanatning buzilishi, stress yoki ovqatlanishdagi o'zgarishlar bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 116,
      "input": "Grippni qanday oldini olish mumkin?",
      "output": "Grippni oldini olish uchun gripp vaksinasini olish, qo'llarni tez-tez yuvish va ommaviy joylarda niqob taqish tavsiya etiladi."
    },
    {
      "id": 117,
      "input": "Yulqinlash va tibbiy yordam ko'rsatish usullari qanday?",
      "output": "Yulqinlashda insonni xavfsiz joyga olib o'tish, shamollashdan saqlanish va shoshilinch tibbiy yordam chaqirish zarur."
    },
    {
      "id": 118,
      "input": "Uzoq vaqt kompyuterda ishlashning salbiy ta'sirlari qanday?",
      "output": "Uzoq vaqt kompyuterda ishlash ko'zlar og'rig'i, bosh og'rig'i, orqa va bo'yin og'rig'iga olib kelishi mumkin."
    },
    {
      "id": 119,
      "input": "Ovqat hazm qilish tizimi qanday ishlaydi?",
      "output": "Ovqat hazm qilish tizimi og'izda boshlanib, oshqozon, ichaklar va buyraklarda davom etib, ovqatni hazm qilib, kerakli moddalarni tanaga olib keladi."
    },
    {
      "id": 120,
      "input": "Salomatlik uchun qancha suv ichish kerak?",
      "output": "Odatda, kuniga 2-3 litr suv ichish tavsiya etiladi, ammo bu individual ehtiyojlarga qarab farq qilishi mumkin."
    },
    {
      "id": 121,
      "input": "Vitamin D tanada qanday rol o'ynaydi?",
      "output": "Vitamin D suyaklarni mustahkamlash, immun tizimini qo'llab-quvvatlash va kaltsiyni tanaga singdirishda yordam beradi."
    },
    {
      "id": 122,
      "input": "Hipertoniya nima?",
      "output": "Hipertoniya qon bosimining yuqori bo'lishi, bu esa yurak kasalliklari va insult xavfini oshiradi."
    },
    {
      "id": 123,
      "input": "Ijtimoiy jihatdan sog'lom bo'lish uchun qanday chora-tadbirlar mavjud?",
      "output": "Ijtimoiy jihatdan sog'lom bo'lish uchun ijtimoiy aloqalarni rivojlantirish, stressni boshqarish va samimiy munosabatlar o'rnatish zarur."
    },
    {
      "id": 124,
      "input": "Qon bosimini qanday nazorat qilish mumkin?",
      "output": "Qon bosimini nazorat qilish uchun muntazam tekshiruvlar, ozish, jismoniy faollik va tuz iste'molini kamaytirish zarur."
    },
    {
      "id": 125,
      "input": "Mikrob va bakteriyalar o'rtasidagi farq nima?",
      "output": "Mikroblar — umumiy atama bo'lib, bakteriyalar, viruslar va qo'ziqorinlarni o'z ichiga oladi, bakteriyalar esa mikroorganizmlarning faqat bir turi."
    },
    {
      "id": 126,
      "input": "Astma qanday kasallik?",
      "output": "Astma nafas olish yo'llarining yallig'lanishi va torayishi bilan bog'liq surunkali kasallikdir, bu nafas qisilishi va yo'talga olib keladi."
    },
    {
      "id": 127,
      "input": "Xolesterin darajasini qanday nazorat qilish mumkin?",
      "output": "Xolesterin darajasini nazorat qilish uchun sog'lom ovqatlanish, jismoniy faoliyat va sigaretdan chekishni tark etish kerak."
    },
    {
      "id": 128,
      "input": "Oyoqlarda varikozni qanday oldini olish mumkin?",
      "output": "Oyoqlarda varikozni oldini olish uchun muntazam yurish, oyoqlarni ko'tarish, siqish paypoqlarini kiyish va jismoniy faollikni oshirish kerak."
    },
    {
      "id": 129,
      "input": "Qonning ko'payishi qanday holatlarda yuzaga keladi?",
      "output": "Qonning ko'payishi (eritrositoz) suyak iligida qon hujayralarining ko'payishi natijasida yuzaga keladi va bu ba'zi kasalliklar bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 130,
      "input": "Neyropatiya qanday kasallik?",
      "output": "Neyropatiya nerv tizimining zarar ko'rishi, asosan diabet, travma yoki virusli infeksiyalar natijasida yuzaga keladi."
    },
    {
      "id": 131,
      "input": "Muntazam tekshiruvlar sog'liqni saqlashda qanday rol o'ynaydi?",
      "output": "Muntazam tekshiruvlar kasalliklarni erta bosqichlarda aniqlash va ularni davolashni boshlash imkonini beradi."
    },
    {
      "id": 132,
      "input": "Qandli diabetda qondagi shakar darajasini qanday boshqarish mumkin?",
      "output": "Qondagi shakar darajasini boshqarish uchun insulin va boshqa dori-darmonlar, to'g'ri ovqatlanish va muntazam jismoniy faollik zarur."
    },
    {
      "id": 133,
      "input": "O'zini tuta bilish va hissiy salomatlikni qanday yaxshilash mumkin?",
      "output": "O'zini tuta bilish uchun stressni kamaytirish, meditatsiya, ijobiy fikrlash va ruhiy yordam olish zarur."
    },
    {
      "id": 134,
      "input": "Qon guruhlari qanday farq qiladi?",
      "output": "Qon guruhlari, AB0 tizimi va Rh faktoriga qarab farqlanadi, bu qon quyishda muhim ahamiyatga ega."
    },
    {
      "id": 135,
      "input": "Mehnat xavfsizligi va sog'liqni saqlashda qanday chora-tadbirlar ko'rish kerak?",
      "output": "Mehnat xavfsizligini ta'minlash uchun himoya vositalarini ishlatish, xavfli ish joylarida ehtiyotkorlikni oshirish va treninglar o'tkazish zarur."
    },
    {
      "id": 136,
      "input": "Siqilish va og'riqlarni qanday yengillashtirish mumkin?",
      "output": "Siqilish va og'riqlarni yengillashtirish uchun muz yoki issiq kompresslar, og'riq qoldiruvchi dori-darmonlar va fizioterapiya tavsiya etiladi."
    },
    {
      "id": 137,
      "input": "Olma qanday sog'liq uchun foydalidir?",
      "output": "Olma vitaminlar, antioksidantlar va tolalar bilan boy bo'lib, yurakni himoya qiladi, hazm qilishni yaxshilaydi va vaznni nazorat qiladi."
    },
    {
      "id": 138,
      "input": "Odamlar nega ko'pincha sovuq alganida bemor bo'lib qoladi?",
      "output": "Sovuq hava immun tizimining kuchini kamaytiradi, bu esa kasalliklarga qarshi turish qobiliyatini pasaytiradi."
    },
    {
      "id": 139,
      "input": "Charchoqni yengish uchun qanday usullar mavjud?",
      "output": "To'g'ri uyqu, sog'lom ovqatlanish, jismoniy faollik va stressni boshqarish charchoqni kamaytirishga yordam beradi."
    },
    {
      "id": 140,
      "input": "Osteoporoz nima?",
      "output": "Osteoporoz suyaklar zichligining kamayishi va ularning sinish xavfini oshiradigan holatdir."
    },
    {
      "id": 141,
      "input": "Sog'lom yurak uchun qanday ovqatlar foydali?",
      "output": "Sog'lom yurak uchun omega-3 yog' kislotalari, to'yinmagan yog'lar, meva, sabzavot va to'liq donli mahsulotlar foydalidir."
    },
    {
      "id": 142,
      "input": "O'rtacha umrlik davomiyligi qanday o'zgarishi mumkin?",
      "output": "O'rtacha umrlik davomiyligi sog'lom turmush tarzini qo'llash, tibbiy xizmatlardan foydalanish va ekologik sharoitlarga bog'liq ravishda o'zgaradi."
    },
    {
      "id": 143,
      "input": "Tibbiyotda \"endokrinologiya\" nima?",
      "output": "Endokrinologiya gormonlar va endokrin tizim kasalliklarini o'rganadigan tibbiyot sohasidir."
    },
    {
      "id": 144,
      "input": "Hushdan ketishning sabablarini qanday aniqlash mumkin?",
      "output": "Hushdan ketishning sabablarini aniqlash uchun tibbiy tekshiruvlar, qon tahlillari va elektrokardiogramma (EKG) o'tkazish zarur."
    },
    {
      "id": 145,
      "input": "Muntazam jismoniy faollikning sog'liqka foydalari nimalar?",
      "output": "Muntazam jismoniy faollik yurakni mustahkamlash, stressni kamaytirish, mushaklarni kuchaytirish va metabolizmni tezlashtiradi."
    },
    {
      "id": 146,
      "input": "Bo'yin og'rig'ini qanday engish mumkin?",
      "output": "Bo'yin og'rig'ini yengillashtirish uchun to'g'ri posturani saqlash, yoga yoki strech mashqlarini bajarish va fizioterapiya zarur."
    },
    {
      "id": 147,
      "input": "Uzoq muddatli dorilarni qabul qilishning xavflari nimalar?",
      "output": "Uzoq muddatli dorilarni qabul qilish jigar va buyraklarga yuk tushirishi, yon ta'sirlarni keltirib chiqarishi va organizmning dorilarga qarshi chidamliligini oshirishi mumkin."
    },
    {
      "id": 148,
      "input": "Tibbiyotda \"onkologiya\" nima?",
      "output": "Onkologiya saraton va uning davolash usullari bilan shug'ullanadigan tibbiyot sohasidir."
    },
    {
      "id": 149,
      "input": "Yangi tug'ilgan chaqaloqda emizishning foydalari nimalar?",
      "output": "Yangi tug'ilgan chaqaloqqa emizish immunitetni oshiradi, rivojlanishga yordam beradi va onaning organizmiga foyda keltiradi."
    },
    {
      "id": 150,
      "input": "Qon ketishining oldini olish uchun qanday usullar mavjud?",
      "output": "Qon ketishini to'xtatish uchun yara ustiga bosim qo'yish, antiseptiklar ishlatish va shoshilinch tibbiy yordamga murojaat qilish zarur."
    },
    {
      "id": 151,
      "input": "Qon bosimini o'lchashda qanday qoidalar mavjud?",
      "output": "Qon bosimini o'lchashdan oldin bir necha daqiqa tinchlanish, to'g'ri holatda o'tirish va o'lchovlarni muntazam ravishda qilish kerak."
    },
    {
      "id": 152,
      "input": "To'liq ovqatlanish uchun qanday mahsulotlar kerak?",
      "output": "To'liq ovqatlanish uchun oqsil, uglevod, yog'lar, vitaminlar va minerallarga boy oziq-ovqatlar kerak."
    },
    {
      "id": 153,
      "input": "Psixologik salomatlikni qanday yaxshilash mumkin?",
      "output": "Psixologik salomatlikni yaxshilash uchun meditatsiya, ijobiy fikrlash, stressni boshqarish va psixoterapiya yordam beradi."
    },
    {
      "id": 154,
      "input": "Sigaret chekish qanday kasalliklarni keltirib chiqaradi?",
      "output": "Sigaret chekish yurak va o'pka kasalliklari, saraton, nafas olish muammolari va ko'plab boshqa kasalliklarga sabab bo'ladi."
    },
    {
      "id": 155,
      "input": "Tibbiyotda \"pediatriya\" nima?",
      "output": "Pediatriya bolalar va o'smirlarning salomatligini va ularning kasalliklarini davolash bilan shug'ullanadigan tibbiyot sohasidir."
    },
    {
      "id": 156,
      "input": "Bosh og'rig'ini qanday davolash mumkin?",
      "output": "Bosh og'rig'ini davolash uchun dori-darmonlar, massaj, dam olish va stressni kamaytirish zarur."
    },
    {
      "id": 157,
      "input": "Hipotermiya nima?",
      "output": "Hipotermiya tananing harorati juda past bo'lib, bu organizmning normal ishlashiga xalaqit berishi mumkin."
    },
    {
      "id": 158,
      "input": "Tibbiyotda \"radiologiya\" nima?",
      "output": "Radiologiya rentgen, kompyuter tomografiya (KT) va magnit-rezonans tomografiya (MRT) kabi tasvirlash usullarini o'rganadigan sohadir."
    },
    {
      "id": 159,
      "input": "Zaharli moddalar bilan ishlashda qanday ehtiyot choralari ko'rish kerak?",
      "output": "Zaharli moddalar bilan ishlashda himoya vositalarini kiyish, havoni yaxshi ventilyatsiya qilish va xavfli moddalar bilan to'g'ridan-to'g'ri aloqa qilmaslik zarur."
    },
    {
      "id": 160,
      "input": "Ko'zlarni qanday sog'lom saqlash mumkin?",
      "output": "Ko'zlarni sog'lom saqlash uchun UV nurlaridan himoya qilish, ko'zlarni muntazam tekshirish va sog'lom ovqatlanish zarur."
    },
    {
      "id": 161,
      "input": "Beshik kasalliklari qanday oldini olish mumkin?",
      "output": "Beshik kasalliklari gigiena qoidalariga rioya qilish, tibbiy tekshiruvlar va emlash orqali oldini olish mumkin."
    },
    {
      "id": 162,
      "input": "Yangi tug'ilgan chaqaloqlarda tibbiy tekshiruvlarning roli qanday?",
      "output": "Yangi tug'ilgan chaqaloqlarda tibbiy tekshiruvlar salomatlik holatini baholash va kasalliklarni erta aniqlashga yordam beradi."
    },
    {
      "id": 163,
      "input": "Surunkali og'riqlarga qanday yechimlar mavjud?",
      "output": "Surunkali og'riqlarni davolash uchun dori-darmonlar, fizioterapiya, akupunktura va stressni boshqarish usullari yordam beradi."
    },
    {
      "id": 164,
      "input": "Sog'lom ovqatlanish va jismoniy faoliyatni qanday uyg'unlashtirish mumkin?",
      "output": "Sog'lom ovqatlanish va jismoniy faoliyatni uyg'unlashtirish uchun balansli dietaga rioya qilish va muntazam jismoniy mashqlar qilish zarur."
    },
    {
      "id": 165,
      "input": "Astmaning oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Astmaning oldini olish uchun allergiya manbalaridan saqlanish, shifokor tavsiyalariga rioya qilish va inhalatorlarni muntazam ishlatish kerak."
    },
    {
      "id": 166,
      "input": "Nevrologik kasalliklarni qanday oldini olish mumkin?",
      "output": "Nevrologik kasalliklarni oldini olish uchun sog'lom turmush tarzini olib borish, stressni kamaytirish va to'g'ri ovqatlanish zarur."
    },
    {
      "id": 167,
      "input": "Insultni qanday aniqlash mumkin?",
      "output": "Insultning alomatlari yuz, qo'l yoki oyoqlarda zaiflik, so'zlash qiyinlishuvi, bosh og'rig'i va muvozanatsizlikni o'z ichiga oladi."
    },
    {
      "id": 168,
      "input": "O'pka kasalliklarini qanday oldini olish mumkin?",
      "output": "O'pka kasalliklarini oldini olish uchun sigaret chekishni tashlash, toza havoda yurish va muntazam tibbiy tekshiruvlar o'tkazish zarur."
    },
    {
      "id": 169,
      "input": "Yuqumli kasalliklarning oldini olish uchun nima qilish kerak?",
      "output": "Yuqumli kasalliklarning oldini olish uchun gigiena qoidalariga rioya qilish, emlash, va kasallik tarqalishini cheklash zarur."
    },
    {
      "id": 170,
      "input": "O'pkada yallig'lanishning belgilari qanday?",
      "output": "O'pkada yallig'lanish, yuqori harorat, yo'tal, nafas qisilishi, va og'riq bilan birga bo'lishi mumkin."
    },
    {
      "id": 171,
      "input": "Uyquning sog'liqka ta'siri qanday?",
      "output": "Uyquning yetarli darajada bo'lishi immun tizimini mustahkamlash, miya faoliyatini yaxshilash va ruhiy salomatlikni qo'llab-quvvatlashda muhim rol o'ynaydi."
    },
    {
      "id": 172,
      "input": "Streptokokk infektsiyasi qanday belgilarga ega?",
      "output": "Streptokokk infektsiyasi og'riqli tomoq, isitma, bosh og'rig'i va yutish qiyinlishuvi kabi alomatlar bilan kuzatiladi."
    },
    {
      "id": 173,
      "input": "Oziqlanishning jismoniy faoliyatga ta'siri qanday?",
      "output": "To'g'ri oziqlanish energiya darajasini oshiradi, mushaklarni rivojlantirishga yordam beradi va jismoniy faollikda yuqori natijalarga erishishga imkon beradi."
    },
    {
      "id": 174,
      "input": "Yog'li ovqatlarning sog'liqka salbiy ta'siri qanday?",
      "output": "Yog'li ovqatlar yurak-qon tomir kasalliklari, yuqori qon bosimi va semirish xavfini oshirishi mumkin."
    },
    {
      "id": 175,
      "input": "Qon tarkibidagi vitaminlar va minerallarni qanday oshirish mumkin?",
      "output": "Vitaminlar va minerallarni ko'proq meva, sabzavotlar, sut mahsulotlari va yong'oq orqali oshirish mumkin."
    },
    {
      "id": 176,
      "input": "Yurak kasalliklarini oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Yurak kasalliklarini oldini olish uchun sigaret chekishni tark etish, sog'lom ovqatlanish, muntazam jismoniy faollik va stressni boshqarish zarur."
    },
    {
      "id": 177,
      "input": "Alkogol iste'moli sog'liqka qanday ta'sir qiladi?",
      "output": "Ortcha alkogol iste'moli jigar kasalliklari, yurak kasalliklari, depressiya va boshqa sog'liq muammolariga olib kelishi mumkin."
    },
    {
      "id": 178,
      "input": "Surunkali kasalliklar bilan qanday yashash mumkin?",
      "output": "Surunkali kasalliklar bilan yashash uchun dori-darmonlarni muntazam qabul qilish, to'g'ri ovqatlanish va jismoniy faollikni saqlash zarur."
    },
    {
      "id": 179,
      "input": "Hiperkolesterinemiya nima?",
      "output": "Hiperkolesterinemiya qondagi xolesterin darajasining yuqori bo'lishi bo'lib, bu yurak kasalliklari xavfini oshiradi."
    },
    {
      "id": 180,
      "input": "Hayz ko'rish jarayonida qanday og'riqlar normal hisoblanadi?",
      "output": "Hayz ko'rish jarayonida engil og'riqlar normal hisoblanadi, lekin kuchli og'riqlar tibbiy muammolarni ko'rsatishi mumkin."
    },
    {
      "id": 181,
      "input": "Qon aylanishi muammolari qanday paydo bo'ladi?",
      "output": "Qon aylanishi muammolari qon tomirlarining torayishi, bloklanishi yoki boshqa to'siqlar natijasida yuzaga keladi."
    },
    {
      "id": 182,
      "input": "Muntazam tibbiy tekshiruvlar qanday foyda keltiradi?",
      "output": "Muntazam tibbiy tekshiruvlar erta kasalliklarni aniqlash, xavfli holatlarni oldini olish va sog'liqni yaxshilashga yordam beradi."
    },
    {
      "id": 183,
      "input": "Isitma nima?",
      "output": "Isitma organizmning infektsiyaga yoki yallig'lanishga javob sifatida haroratining ko'tarilishidir."
    },
    {
      "id": 184,
      "input": "Yangi tug'ilgan chaqaloqlar uchun qanday emlashlar zarur?",
      "output": "Yangi tug'ilgan chaqaloqlar uchun difteriya, qizamiq, gepatit B, poliomielit va boshqa asosiy emlashlar zarur."
    },
    {
      "id": 185,
      "input": "Virusli infeksiyalarni qanday davolash mumkin?",
      "output": "Virusli infeksiyalarni davolashda ko'pincha antiviral dorilar, ko'p suyuqlik ichish, dam olish va simptomatik davolash tavsiya etiladi."
    },
    {
      "id": 186,
      "input": "Og'irlikni qanday kamaytirish mumkin?",
      "output": "Og'irlikni kamaytirish uchun kaloriya miqdorini kamaytirish, sog'lom ovqatlanish va muntazam jismoniy mashqlar qilish zarur."
    },
    {
      "id": 187,
      "input": "Tibbiyotda \"geriatrik\" soha nima?",
      "output": "Geriatriya keksa yoshdagi insonlarning sog'lig'ini saqlash va kasalliklarni davolash bilan shug'ullanadi."
    },
    {
      "id": 188,
      "input": "Immunitetni qanday kuchaytirish mumkin?",
      "output": "Immunitetni kuchaytirish uchun balansli ovqatlanish, muntazam jismoniy faollik, uyquni to'liq olish va stressni boshqarish zarur."
    },
    {
      "id": 189,
      "input": "O'pka fibrozasi nima?",
      "output": "O'pka fibrozasi o'pkadagi to'qimalarning o'zgarishi va qattiqlashuvi bilan bog'liq bo'lib, nafas olishni qiyinlashtiradi."
    },
    {
      "id": 190,
      "input": "Beshik kasalliklari qanday belgilarga ega?",
      "output": "Beshik kasalliklari o'ziga xos toshmalar, qichishish, isitma va oshqozon muammolarini keltirib chiqaradi."
    },
    {
      "id": 191,
      "input": "Avitaminoz nima?",
      "output": "Avitaminoz vitaminlar yetishmasligi natijasida kelib chiqadigan kasallikdir."
    },
    {
      "id": 192,
      "input": "Hipertermiya nima?",
      "output": "Hipertermiya organizmning haddan tashqari issiqlik to'planishi holatidir, bu og'ir dehidratsiya va boshqa muammolarga olib kelishi mumkin."
    },
    {
      "id": 193,
      "input": "Bog'lanishlarni qanday kuchaytirish mumkin?",
      "output": "Bog'lanishlarni kuchaytirish uchun sog'lom ovqatlanish, muntazam mashqlar va vitaminlar olish zarur."
    },
    {
      "id": 194,
      "input": "Yuqumli kasalliklarni qanday davolash mumkin?",
      "output": "Yuqumli kasalliklarni davolash uchun antibakterial, antivirus, va antifungal dori-darmonlar, shuningdek, ko'p suyuqlik va dam olish zarur."
    },
    {
      "id": 195,
      "input": "Kam harakatlilikning sog'liqka salbiy ta'siri qanday?",
      "output": "Kam harakatlilik mushaklarning zaiflashishi, yurak-qon tomir kasalliklari va ortiqcha vazn olishga olib keladi."
    },
    {
      "id": 196,
      "input": "Sog'lom bo'lish uchun qancha vaqt jismoniy mashqlar qilish kerak?",
      "output": "Sog'lom bo'lish uchun haftada kamida 150 daqiqa jismoniy faollik tavsiya etiladi."
    },
    {
      "id": 197,
      "input": "Nefropatiya nima?",
      "output": "Nefropatiya buyraklarning yallig'lanishi yoki zararlanishi bilan bog'liq kasallikdir."
    },
    {
      "id": 198,
      "input": "Jigar kasalliklarini qanday oldini olish mumkin?",
      "output": "Jigar kasalliklarini oldini olish uchun to'g'ri ovqatlanish, alkogolni iste'mol qilmaslik va gepatitga qarshi emlash zarur."
    },
    {
      "id": 199,
      "input": "Xavfli materiallar bilan ishlashda qanday ehtiyot choralari ko'rish kerak?",
      "output": "Xavfli materiallar bilan ishlashda himoya kiyimlarini, qo'lqoplar va niqoblarni kiyish, va xavfsizlik protokollariga rioya qilish zarur."
    },
    {
      "id": 200,
      "input": "Stressni kamaytirish uchun qanday usullar mavjud?",
      "output": "Stressni kamaytirish uchun meditatsiya, yoga, chuqur nafas olish va tabiatda yurish kabi usullar samarali."
    },
    {
      "id": 201,
      "input": "Hipertoniya nima?",
      "output": "Hipertoniya qon bosimining normaldan yuqori bo'lishi bo'lib, yurak va qon tomirlarining salomatligini tahdid qiladi."
    },
    {
      "id": 202,
      "input": "Raqobatbardosh sportchilar uchun qanday ovqatlanish zarur?",
      "output": "Raqobatbardosh sportchilar uchun oqsilga boy, uglevodlar va suv muvozanatini ta'minlovchi ovqatlar zarur."
    },
    {
      "id": 203,
      "input": "Sigaret chekishni tark etishning sog'liqka ta'siri qanday?",
      "output": "Sigaret chekishni tark etish yurak-qon tomir kasalliklari, o'pka kasalliklari va saraton xavfini kamaytiradi."
    },
    {
      "id": 204,
      "input": "Sog'lom tishlarni qanday saqlash mumkin?",
      "output": "Sog'lom tishlar uchun muntazam tishlarni yuvish, tish pastasidan foydalanish va stomatologga muntazam tashrif buyurish zarur."
    },
    {
      "id": 205,
      "input": "O'zgarmas yurak urishi tezligi nima?",
      "output": "O'zgarmas yurak urishi tezligi organizmning holati, stress yoki jismoniy faollikka qarab o'zgaradi."
    },
    {
      "id": 206,
      "input": "Vitamin D ning organizmdagi roli nima?",
      "output": "Vitamin D suyaklar uchun muhim, kalsiy va fosforning o'zlashtirilishini ta'minlaydi, immun tizimiga yordam beradi."
    },
    {
      "id": 207,
      "input": "Yurak xurujini qanday aniqlash mumkin?",
      "output": "Yurak xurujining alomatlari ko'ngil aynishi, ko'krakda og'riq, nafas qisqarishi va terlash bo'lishi mumkin."
    },
    {
      "id": 208,
      "input": "To'g'ri ovqatlanish nima?",
      "output": "To'g'ri ovqatlanish muvozanatli va xilma-xil oziq-ovqatlarni iste'mol qilish, vitamin va minerallarga boy bo'lishi kerak."
    },
    {
      "id": 209,
      "input": "Nevrasteniya nima?",
      "output": "Nevrasteniya ruhiy va jismoniy charchoqlikdan kelib chiqqan, asab tizimini ta'sir qiluvchi holatdir."
    },
    {
      "id": 210,
      "input": "Odamda allergiya qanday paydo bo'ladi?",
      "output": "Allergiya odamning immun tizimining ba'zi moddalar bilan o'zaro ta'siri natijasida yuzaga keladi."
    },
    {
      "id": 211,
      "input": "Hipoglikemiya nima?",
      "output": "Hipoglikemiya qon shakarining juda past bo'lishi bo'lib, bu miyada energiya yetishmovchiligiga olib keladi."
    },
    {
      "id": 212,
      "input": "Oshqozon yarasi nima?",
      "output": "Oshqozon yarasi oshqozonning ichki qavatining zararlanishi va eroziyasidir, bu og'riq va bezovtalik keltirishi mumkin."
    },
    {
      "id": 213,
      "input": "Semirishni qanday oldini olish mumkin?",
      "output": "Semirishni oldini olish uchun kaloriyaga ehtiyot bo'lish, muntazam jismoniy mashqlar va sog'lom ovqatlanish zarur."
    },
    {
      "id": 214,
      "input": "Aqliy salomatlikni saqlash uchun qanday choralar ko'rish kerak?",
      "output": "Aqliy salomatlikni saqlash uchun psixologik yordam olish, stressni kamaytirish va ijobiy munosabatlarni rivojlantirish zarur."
    },
    {
      "id": 215,
      "input": "Jigar transaminazalari yuqori bo'lsa, nima qilish kerak?",
      "output": "Jigar transaminazalari yuqori bo'lsa, bu jigarning shikastlanishi yoki yallig'lanishini ko'rsatishi mumkin, shifokor bilan maslahatlashish zarur."
    },
    {
      "id": 216,
      "input": "Yashash davomiyligini oshirish uchun qanday odatlarni rivojlantirish kerak?",
      "output": "Yashash davomiyligini oshirish uchun to'g'ri ovqatlanish, jismoniy faoliyat, stressni boshqarish va muntazam tibbiy tekshiruvlar qilish zarur."
    },
    {
      "id": 217,
      "input": "Yurak kasalliklari uchun qanday tekshiruvlar o'tkazish kerak?",
      "output": "Yurak kasalliklarini aniqlash uchun EKG, echokardiyogramma, qon tahlillari va stress testlari o'tkazilishi mumkin."
    },
    {
      "id": 218,
      "input": "Neyropatiya nima?",
      "output": "Neyropatiya asab tizimining shikastlanishi natijasida yuzaga keladigan og'riqlar, zaiflik yoki sezgirlikni yo'qotish bilan ifodalanadi."
    },
    {
      "id": 219,
      "input": "O'pka emfizemasi nima?",
      "output": "O'pka emfizemasi o'pka to'qimalarining zararlanishi va elastikligini yo'qotishi natijasida nafas olishni qiyinlashtiradi."
    },
    {
      "id": 220,
      "input": "Spinal so'roqlar qanday tibbiy muammolarni keltirib chiqaradi?",
      "output": "Spinal so'roqlar umurtqa pog'onasi yoki asab tizimi bilan bog'liq muammolarni keltirib chiqarishi mumkin, bu esa og'riqlarni va harakatsizlikni keltirib chiqaradi."
    },
    {
      "id": 221,
      "input": "Sog'lom suyuqlik rejimi qanday bo'lishi kerak?",
      "output": "Sog'lom suyuqlik rejimi kuniga kamida 2 litr suv ichishni, shuningdek, meva va sabzavotlar orqali qo'shimcha suyuqlik olishni ta'minlaydi."
    },
    {
      "id": 222,
      "input": "Postnatal parvarishning ahamiyati qanday?",
      "output": "Postnatal parvarish ona va chaqaloqning sog'lig'ini tiklash va rivojlanish uchun muhim bo'lib, emizish, uyqu va tibbiy tekshiruvlarni o'z ichiga oladi."
    },
    {
      "id": 223,
      "input": "Karsinomalar qanday kasalliklarni anglatadi?",
      "output": "Karsinomalar o'smalar yoki saratonlarning turidir va ularni davolash uchun ko'pincha jarrohlik, kimyoterapiya yoki radioterapiya talab qilinadi."
    },
    {
      "id": 224,
      "input": "Prostata kasalliklarining oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Prostata kasalliklarining oldini olish uchun muntazam tibbiy tekshiruvlar, sog'lom ovqatlanish va jismoniy faollik zarur."
    },
    {
      "id": 225,
      "input": "Shakarli diabetni qanday oldini olish mumkin?",
      "output": "Shakarli diabetni oldini olish uchun to'g'ri ovqatlanish, jismoniy mashqlar va vaznni normallashtirish zarur."
    },
    {
      "id": 226,
      "input": "Bachadon bo'yni saratoni qanday aniqlanadi?",
      "output": "Bachadon bo'yni saratoni pap-smear testi, kolposkopiya va biopsisiz tahlillar orqali aniqlanadi."
    },
    {
      "id": 227,
      "input": "Pankreatit nima?",
      "output": "Pankreatit oshqozon osti bezi yallig'lanishi bo'lib, bu o'rtacha yoki kuchli og'riq, qusish va isitg'ilikni keltirib chiqaradi."
    },
    {
      "id": 228,
      "input": "Vegetarizmning sog'liqka ta'siri qanday?",
      "output": "Vegetarizm organizmning ozuqa moddalarini olish usulini o'zgartiradi va sog'lom ovqatlanish uchun to'g'ri reja talab etadi."
    },
    {
      "id": 229,
      "input": "Tromboz nima?",
      "output": "Tromboz qon tomirlarida qon quyulishining shakllanishidir va bu tomirlarning to'silishi va qon aylanishi bilan bog'liq muammolarni keltirib chiqaradi."
    },
    {
      "id": 230,
      "input": "Emlashlarning salomatlikka foydalari qanday?",
      "output": "Emlashlar infektsiyalarni oldini olish, immun tizimni mustahkamlash va pandemiyalarni oldini olishda katta ahamiyatga ega."
    },
    {
      "id": 231,
      "input": "Qon ketishini qanday tez to'xtatish mumkin?",
      "output": "Qon ketishini tez to'xtatish uchun bosim qo'yish, yara ustiga steril material qo'yish va tibbiy yordam so'rash zarur."
    },
    {
      "id": 232,
      "input": "Saratonning oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Saratonning oldini olish uchun sog'lom turmush tarzini olib borish, chekishni tark etish, muntazam tibbiy tekshiruvlar o'tkazish zarur."
    },
    {
      "id": 233,
      "input": "Qonuniy dori vositalari qanday farqlanadi?",
      "output": "Qonuniy dori vositalari davlat tomonidan tasdiqlangan, xavfsiz va samarali bo'lib, ular tibbiy nazorat ostida bo'ladi."
    },
    {
      "id": 234,
      "input": "Atrof-muhit ifloslanishi qanday kasalliklarga olib kelishi mumkin?",
      "output": "Atrof-muhit ifloslanishi nafas olish tizimi, yurak-qon tomir kasalliklari va allergik kasalliklarning rivojlanishiga olib kelishi mumkin."
    },
    {
      "id": 235,
      "input": "Hipoatremiya nima?",
      "output": "Hipoatremiya qon ichidagi natriy darajasining past bo'lishi bo'lib, bu suv va elektrolit muvozanatsizligiga olib keladi."
    },
    {
      "id": 236,
      "input": "Kattalarda va bolalarda semirishni oldini olish uchun qanday chora-tadbirlar mavjud?",
      "output": "Semirishni oldini olish uchun sog'lom ovqatlanish, jismoniy faollik va shirinliklar iste'molini cheklash zarur."
    },
    {
      "id": 237,
      "input": "Peshona og'rig'i qanday sabablar bilan yuzaga keladi?",
      "output": "Peshona og'rig'i stress, uyqusizlik, bosh miya qon tomirlarining torayishi yoki infektsiyalardan kelib chiqishi mumkin."
    },
    {
      "id": 238,
      "input": "Endokrin tizimi qanday ishlaydi?",
      "output": "Endokrin tizimi organizmda gormonlar ishlab chiqaradi va bu gormonlar turli organlar va tizimlarga ta'sir qiladi."
    },
    {
      "id": 239,
      "input": "O'pka saratonining belgilari qanday?",
      "output": "O'pka saratoni nafas qisilishi, doimiy yo'tal, ko'krakda og'riq, va qonli balg'am bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 240,
      "input": "O'pka va yurak kasalliklarini aniqlash uchun qanday testlar kerak?",
      "output": "O'pka va yurak kasalliklarini aniqlash uchun EKG, rentgen tasvir, echokardiyogramma va spirometriya testlari o'tkazilishi mumkin."
    },
    {
      "id": 241,
      "input": "Bosh miya sil kasalligi nima?",
      "output": "Bosh miya sil kasalligi bosh miya va orqa miya shikastlanishi va asab tizimining buzilishiga olib keluvchi kasallikdir."
    },
    {
      "id": 242,
      "input": "O'smirlar uchun emlashlar qanday ahamiyatga ega?",
      "output": "O'smirlar uchun emlashlar infektsiyalardan himoya qiladi, ularning salomatligini ta'minlaydi va surunkali kasalliklar xavfini kamaytiradi."
    },
    {
      "id": 243,
      "input": "O'pkada yallig'lanishni qanday davolash kerak?",
      "output": "O'pkada yallig'lanish antibiotiklar yoki antiviral dorilar, ko'p suyuqlik ichish, dam olish va zarur hollarda hospitalizatsiya bilan davolanadi."
    },
    {
      "id": 244,
      "input": "Yog'li va qovurilgan ovqatlar qanday ta'sir qiladi?",
      "output": "Yog'li va qovurilgan ovqatlar yurak-qon tomir kasalliklari va semirish xavfini oshiradi, shuningdek, xolesterin miqdorini oshirishi mumkin."
    },
    {
      "id": 245,
      "input": "Asab tizimining ishlashini yaxshilash uchun qanday usullar mavjud?",
      "output": "Asab tizimining ishlashini yaxshilash uchun dam olish, stressni boshqarish, mehnat va dam olishni muvozanatlash va to'g'ri ovqatlanish zarur."
    },
    {
      "id": 246,
      "input": "Onkologik kasalliklar qanday davolanadi?",
      "output": "Onkologik kasalliklar jarrohlik, kimyoterapiya, radioterapiya va immunoterapiya bilan davolanadi."
    },
    {
      "id": 247,
      "input": "Yurak xastaligi qanday aniqlanadi?",
      "output": "Yurak xastaligi EKG, echokardiyogramma, stress testlari, va qon tahlillari yordamida aniqlanadi."
    },
    {
      "id": 248,
      "input": "Saratonni erta bosqichda aniqlash qanday muhim?",
      "output": "Saratonni erta bosqichda aniqlash davolash imkoniyatlarini oshiradi va yashash davomiyligini uzaytiradi."
    },
    {
      "id": 249,
      "input": "Xavfli sun'iy qo'shimchalar ovqatda qanday salbiy ta'sir ko'rsatadi?",
      "output": "Xavfli qo'shimchalar allergik reaksiyalar, hazm qilish muammolari va uzoq muddatli foydalanishda saraton kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 250,
      "input": "Mikrobial qarshilik nima?",
      "output": "Mikrobial qarshilik dori vositalariga qarshi mikroblar tomonidan rivojlanadigan qarshilik bo'lib, bu davolanishni qiyinlashtiradi."
    },
    {
      "id": 251,
      "input": "Tibbiy nazorat ostida dorilarni qanday qabul qilish kerak?",
      "output": "Tibbiy nazorat ostida dorilarni belgilangan doza va vaqtga rioya qilgan holda qabul qilish kerak, shifokor ko'rsatmalariga to'liq amal qilish zarur."
    },
    {
      "id": 252,
      "input": "Piyoz va sarimsoqning sog'liq uchun foydalari qanday?",
      "output": "Piyoz va sarimsoq immun tizimini mustahkamlash, qon bosimini normallashtirish va yallig'lanishga qarshi samarali vositalardir."
    },
    {
      "id": 253,
      "input": "Tibbiy ma'lumotni qanday topish mumkin?",
      "output": "Tibbiy ma'lumotni ishonchli manbalardan, tibbiy jurnallardan, rasmiy sog'liq tashkilotlarining saytlari va shifokorlardan olish mumkin."
    },
    {
      "id": 254,
      "input": "Suv ichishning sog'liqka qanday ta'siri bor?",
      "output": "Suv ichish organizmni gidratatsiya qiladi, metabolizmni tezlashtiradi, terini sog'lom saqlaydi va buyrak faoliyatini yaxshilaydi."
    },
    {
      "id": 255,
      "input": "Bakterial infeksiyalar qanday davolanadi?",
      "output": "Bakterial infeksiyalar antibiotiklar yordamida davolanadi, ammo faqat shifokor belgilagan dori-darmonlar bilan."
    },
    {
      "id": 256,
      "input": "Jismoniy mashqlarni qanday vaqtda qilish eng foydali?",
      "output": "Jismoniy mashqlarni ertalab yoki kechqurun qilish mumkin, lekin eng muhimi, muntazam va izchil bajarishdir."
    },
    {
      "id": 257,
      "input": "Akupunktura qanday ishlaydi?",
      "output": "Akupunktura badaning ma'lum nuqtalariga ingichka ignalar kirgizish orqali energiya oqimini to'g'ri yo'naltirishni maqsad qiladi."
    },
    {
      "id": 258,
      "input": "Boshqarilmagan diabet qanday xavf tug'diradi?",
      "output": "Boshqarilmagan diabet qon shakarining doimiy yuqori bo'lishi natijasida yurak kasalliklari, asab tizimi shikastlanishi va ko'rish nuqsonlariga olib kelishi mumkin."
    },
    {
      "id": 259,
      "input": "Yutish muammolari qanday kasalliklarga aloqador bo'lishi mumkin?",
      "output": "Yutish muammolari nevrologik kasalliklar, o'pka yallig'lanishi yoki oshqozon-ichak tizimi muammolari bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 260,
      "input": "Psoriasis nima?",
      "output": "Psoriasis teridagi hujayralarning tezlashgan ko'payishi natijasida paydo bo'ladigan teri kasalligi bo'lib, qichishish va qizarish bilan ifodalanadi."
    },
    {
      "id": 261,
      "input": "Teri saratoni qanday turlariga bo'linadi?",
      "output": "Teri saratoni asosan bazal hujayra saratoni, skvamoz hujayra saratoni va melanomaga bo'linadi."
    },
    {
      "id": 262,
      "input": "Ko'zlar uchun qanday parvarish kerak?",
      "output": "Ko'zlarni yaxshi parvarish qilish uchun muntazam tekshiruvlar, ko'zlarga zararli nurlardan himoya qilish va yaxshi ovqatlanish zarur."
    },
    {
      "id": 263,
      "input": "Migrenni qanday davolash mumkin?",
      "output": "Migrenni davolash uchun og'riqni kamaytiradigan dorilar, dam olish va stressni kamaytirish zarur."
    },
    {
      "id": 264,
      "input": "Jigarni tozalash uchun qanday usullar mavjud?",
      "output": "Jigarni tozalash uchun sog'lom ovqatlanish, ko'p suyuqlik ichish va spirtli ichimliklardan saqlanish zarur."
    },
    {
      "id": 265,
      "input": "Yangi tug'ilgan chaqaloqlarda qanday jismoniy testlar o'tkazish kerak?",
      "output": "Yangi tug'ilgan chaqaloqlarda tez-tez to'g'ri nafas olish va yurak urish tekshiruvlari, fiziologik holatni baholash uchun testlar o'tkaziladi."
    },
    {
      "id": 266,
      "input": "Qonuniy dori vositalari qanday farqlanadi?",
      "output": "Qonuniy dori vositalari davlat tomonidan tasdiqlangan, xavfsiz va samarali bo'lib, ular tibbiy nazorat ostida bo'ladi."
    },
    {
      "id": 267,
      "input": "Atrof-muhit ifloslanishi qanday kasalliklarga olib kelishi mumkin?",
      "output": "Atrof-muhit ifloslanishi nafas olish tizimi, yurak-qon tomir kasalliklari va allergik kasalliklarning rivojlanishiga olib kelishi mumkin."
    },
    {
      "id": 268,
      "input": "Hipoatremiya nima?",
      "output": "Hipoatremiya qon ichidagi natriy darajasining past bo'lishi bo'lib, bu suv va elektrolit muvozanatsizligiga olib keladi."
    },
    {
      "id": 269,
      "input": "Kattalarda va bolalarda semirishni oldini olish uchun qanday chora-tadbirlar mavjud?",
      "output": "Semirishni oldini olish uchun sog'lom ovqatlanish, jismoniy faollik va shirinliklar iste'molini cheklash zarur."
    },
    {
      "id": 270,
      "input": "Peshona og'rig'i qanday sabablar bilan yuzaga keladi?",
      "output": "Peshona og'rig'i stress, uyqusizlik, bosh miya qon tomirlarining torayishi yoki infektsiyalardan kelib chiqishi mumkin."
    },
    {
      "id": 271,
      "input": "Endokrin tizimi qanday ishlaydi?",
      "output": "Endokrin tizimi organizmda gormonlar ishlab chiqaradi va bu gormonlar turli organlar va tizimlarga ta'sir qiladi."
    },
    {
      "id": 272,
      "input": "O'pka saratonining belgilari qanday?",
      "output": "O'pka saratoni nafas qisilishi, doimiy yo'tal, ko'krakda og'riq, va qonli balg'am bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 273,
      "input": "O'pka va yurak kasalliklarini aniqlash uchun qanday testlar kerak?",
      "output": "O'pka va yurak kasalliklarini aniqlash uchun EKG, rentgen tasvir, echokardiyogramma va spirometriya testlari o'tkazilishi mumkin."
    },
    {
      "id": 274,
      "input": "Bosh miya sil kasalligi nima?",
      "output": "Bosh miya sil kasalligi bosh miya va orqa miya shikastlanishi va asab tizimining buzilishiga olib keluvchi kasallikdir."
    },
    {
      "id": 275,
      "input": "O'smirlar uchun emlashlar qanday ahamiyatga ega?",
      "output": "O'smirlar uchun emlashlar infektsiyalardan himoya qiladi, ularning salomatligini ta'minlaydi va surunkali kasalliklar xavfini kamaytiradi."
    },
    {
      "id": 276,
      "input": "O'pkada yallig'lanishni qanday davolash kerak?",
      "output": "O'pkada yallig'lanish antibiotiklar yoki antiviral dorilar, ko'p suyuqlik ichish, dam olish va zarur hollarda hospitalizatsiya bilan davolanadi."
    },
    {
      "id": 277,
      "input": "Yog'li va qovurilgan ovqatlar qanday ta'sir qiladi?",
      "output": "Yog'li va qovurilgan ovqatlar yurak-qon tomir kasalliklari va semirish xavfini oshiradi, shuningdek, xolesterin miqdorini oshirishi mumkin."
    },
    {
      "id": 278,
      "input": "Asab tizimining ishlashini yaxshilash uchun qanday usullar mavjud?",
      "output": "Asab tizimining ishlashini yaxshilash uchun dam olish, stressni boshqarish, mehnat va dam olishni muvozanatlash va to'g'ri ovqatlanish zarur."
    },
    {
      "id": 279,
      "input": "Onkologik kasalliklar qanday davolanadi?",
      "output": "Onkologik kasalliklar jarrohlik, kimyoterapiya, radioterapiya va immunoterapiya bilan davolanadi."
    },
    {
      "id": 280,
      "input": "Yurak xastaligi qanday aniqlanadi?",
      "output": "Yurak xastaligi EKG, echokardiyogramma, stress testlari, va qon tahlillari yordamida aniqlanadi."
    },
    {
      "id": 281,
      "input": "Saratonni erta bosqichda aniqlash qanday muhim?",
      "output": "Saratonni erta bosqichda aniqlash davolash imkoniyatlarini oshiradi va yashash davomiyligini uzaytiradi."
    },
    {
      "id": 282,
      "input": "Xavfli sun'iy qo'shimchalar ovqatda qanday salbiy ta'sir ko'rsatadi?",
      "output": "Xavfli qo'shimchalar allergik reaksiyalar, hazm qilish muammolari va uzoq muddatli foydalanishda saraton kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 283,
      "input": "Mikrobial qarshilik nima?",
      "output": "Mikrobial qarshilik dori vositalariga qarshi mikroblar tomonidan rivojlanadigan qarshilik bo'lib, bu davolanishni qiyinlashtiradi."
    },
    {
      "id": 284,
      "input": "Tibbiy nazorat ostida dorilarni qanday qabul qilish kerak?",
      "output": "Tibbiy nazorat ostida dorilarni belgilangan doza va vaqtga rioya qilgan holda qabul qilish kerak, shifokor ko'rsatmalariga to'liq amal qilish zarur."
    },
    {
      "id": 285,
      "input": "Piyoz va sarimsoqning sog'liq uchun foydalari qanday?",
      "output": "Piyoz va sarimsoq immun tizimini mustahkamlash, qon bosimini normallashtirish va yallig'lanishga qarshi samarali vositalardir."
    },
    {
      "id": 286,
      "input": "Tibbiy ma'lumotni qanday topish mumkin?",
      "output": "Tibbiy ma'lumotni ishonchli manbalardan, tibbiy jurnallardan, rasmiy sog'liq tashkilotlarining saytlari va shifokorlardan olish mumkin."
    },
    {
      "id": 287,
      "input": "Suv ichishning sog'liqka qanday ta'siri bor?",
      "output": "Suv ichish organizmni gidratatsiya qiladi, metabolizmni tezlashtiradi, terini sog'lom saqlaydi va buyrak faoliyatini yaxshilaydi."
    },
    {
      "id": 288,
      "input": "Bakterial infeksiyalar qanday davolanadi?",
      "output": "Bakterial infeksiyalar antibiotiklar yordamida davolanadi, ammo faqat shifokor belgilagan dori-darmonlar bilan."
    },
    {
      "id": 289,
      "input": "Jismoniy mashqlarni qanday vaqtda qilish eng foydali?",
      "output": "Jismoniy mashqlarni ertalab yoki kechqurun qilish mumkin, lekin eng muhimi, muntazam va izchil bajarishdir."
    },
    {
      "id": 290,
      "input": "Akupunktura qanday ishlaydi?",
      "output": "Akupunktura badaning ma'lum nuqtalariga ingichka ignalar kirgizish orqali energiya oqimini to'g'ri yo'naltirishni maqsad qiladi."
    },
    {
      "id": 291,
      "input": "Boshqarilmagan diabet qanday xavf tug'diradi?",
      "output": "Boshqarilmagan diabet qon shakarining doimiy yuqori bo'lishi natijasida yurak kasalliklari, asab tizimi shikastlanishi va ko'rish nuqsonlariga olib kelishi mumkin."
    },
    {
      "id": 292,
      "input": "Yutish muammolari qanday kasalliklarga aloqador bo'lishi mumkin?",
      "output": "Yutish muammolari nevrologik kasalliklar, o'pka yallig'lanishi yoki oshqozon-ichak tizimi muammolari bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 293,
      "input": "Psoriasis nima?",
      "output": "Psoriasis teridagi hujayralarning tezlashgan ko'payishi natijasida paydo bo'ladigan teri kasalligi bo'lib, qichishish va qizarish bilan ifodalanadi."
    },
    {
      "id": 294,
      "input": "Teri saratoni qanday turlariga bo'linadi?",
      "output": "Teri saratoni asosan bazal hujayra saratoni, skvamoz hujayra saratoni va melanomaga bo'linadi."
    },
    {
      "id": 295,
      "input": "Ko'zlar uchun qanday parvarish kerak?",
      "output": "Ko'zlarni yaxshi parvarish qilish uchun muntazam tekshiruvlar, ko'zlarga zararli nurlardan himoya qilish va yaxshi ovqatlanish zarur."
    },
    {
      "id": 296,
      "input": "Migrenni qanday davolash mumkin?",
      "output": "Migrenni davolash uchun og'riqni kamaytiradigan dorilar, dam olish va stressni kamaytirish zarur."
    },
    {
      "id": 297,
      "input": "Jigarni tozalash uchun qanday usullar mavjud?",
      "output": "Jigarni tozalash uchun sog'lom ovqatlanish, ko'p suyuqlik ichish va spirtli ichimliklardan saqlanish zarur."
    },
    {
      "id": 298,
      "input": "Yangi tug'ilgan chaqaloqlarda qanday jismoniy testlar o'tkazish kerak?",
      "output": "Yangi tug'ilgan chaqaloqlarda tez-tez to'g'ri nafas olish va yurak urish tekshiruvlari, fiziologik holatni baholash uchun testlar o'tkaziladi."
    },
    {
      "id": 299,
      "input": "Xolesterin darajasini qanday nazorat qilish mumkin?",
      "output": "Xolesterin darajasini sog'lom ovqatlanish, muntazam jismoniy faollik, va kerak bo'lsa, dorilar yordamida nazorat qilish mumkin."
    },
    {
      "id": 300,
      "input": "Tibbiy yordam ko'rsatuvchi birinchi yordam usullarini bilishning ahamiyati qanday?",
      "output": "Birinchi yordam ko'rsatuvchi usullar inson hayotini saqlab qolishga yordam beradi, jarohatlar va favqulodda holatlarda hayotni qutqarish mumkin."
    },
    {
      "id": 301,
      "input": "Shifokor tomonidan belgilangan dori-darmonlarni qanday qabul qilish kerak?",
      "output": "Shifokor tomonidan belgilangan dori-darmonlarni vaqtida va belgilangan dozalarda qabul qilish kerak, shifokor ko'rsatmalariga rioya qilish muhim."
    },
    {
      "id": 302,
      "input": "Miokard infarkti qanday aniqlanadi?",
      "output": "Miokard infarkti ko'krakdagi og'riq, nafas qisqarishi, ko'ngil aynishi va elektrokardiyogramma yordamida aniqlanadi."
    },
    {
      "id": 303,
      "input": "Parkinson kasalligi qanday belgilarga ega?",
      "output": "Parkinson kasalligi titroq, mushaklarning qattiqligi, harakatlardagi sekinlashish va muvozanatni saqlashdagi qiyinchiliklar bilan namoyon bo'ladi."
    },
    {
      "id": 304,
      "input": "Fizioterapiya nima va qanday afzalliklarga ega?",
      "output": "Fizioterapiya jismoniy terapiya usullarini qo'llab, og'riqni kamaytirish, harakatlanuvchanlikni yaxshilash va tiklanishga yordam beradi."
    },
    {
      "id": 305,
      "input": "Oyoqdagi varikoz tomirlar qanday kasallikdir?",
      "output": "Varikoz tomirlar oyoqlardagi qon tomirlarining kengayishi va uzayishi bo'lib, og'riq, shishish va oyoqlarda og'riq keltirib chiqarishi mumkin."
    },
    {
      "id": 306,
      "input": "Jigarni qanday parvarish qilish kerak?",
      "output": "Jigarni sog'lom saqlash uchun spirtli ichimliklardan saqlanish, sog'lom ovqatlanish, va muntazam ravishda jigarni tekshirish zarur."
    },
    {
      "id": 307,
      "input": "Jismoniy mashqlarni boshlashdan oldin qanday tayyorgarlik qilish kerak?",
      "output": "Jismoniy mashqlarni boshlashdan oldin issiqlik bilan mashq qilish, mos jihozlarni tayyorlash va shifokor bilan maslahatlashish kerak."
    },
    {
      "id": 308,
      "input": "Sog'lom bo'lish uchun qanday turmush tarzini rivojlantirish zarur?",
      "output": "Sog'lom turmush tarzini rivojlantirish uchun to'g'ri ovqatlanish, muntazam jismoniy mashqlar, stressni kamaytirish va to'liq uyqu zarur."
    },
    {
      "id": 309,
      "input": "Anemiya qanday aniqlanadi?",
      "output": "Anemiya qon tahlilida gemoglobin darajasining past bo'lishi orqali aniqlanadi, shuningdek, odamda charchoq, teri rangining oqarishi, va zaiflik ko'rinishi mumkin."
    },
    {
      "id": 310,
      "input": "Humerus suyakning sinishi qanday davolanadi?",
      "output": "Humerus suyak sinishi jarrohlik yoki gipso yordamida tuzatiladi, va keyingi davolash fizioterapiya orqali amalga oshiriladi."
    },
    {
      "id": 311,
      "input": "Shaxsiy gigiena qoidalariga rioya qilishning ahamiyati qanday?",
      "output": "Shaxsiy gigiena qoidalariga rioya qilish kasalliklarning oldini olish, bakteriyalarning tarqalishini kamaytirish va umumiy sog'liqni saqlashga yordam beradi."
    },
    {
      "id": 312,
      "input": "O'pka yallig'lanishini oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "O'pka yallig'lanishini oldini olish uchun sigaret chekishdan saqlanish, toza havoda nafas olish, va muntazam jismoniy mashqlar qilish kerak."
    },
    {
      "id": 313,
      "input": "Yuqumli kasalliklar qanday tarqaladi?",
      "output": "Yuqumli kasalliklar odamdan odamga nafas yo'llari orqali, to'g'ridan-to'g'ri kontakt orqali yoki zararlangan yuzalar orqali tarqaladi."
    },
    {
      "id": 314,
      "input": "O'smirlarda o'sish va rivojlanishni qanday kuzatish kerak?",
      "output": "O'smirlarda o'sish va rivojlanishni muntazam tibbiy tekshiruvlar, sog'lom ovqatlanish, va jismoniy faollik orqali kuzatish kerak."
    },
    {
      "id": 315,
      "input": "Sog'liqni saqlash uchun qanday vitaminlar zarur?",
      "output": "Sog'liqni saqlash uchun A, C, D, E, va B guruhidagi vitaminlar zarur, ular immun tizimi, suyaklar va teri salomatligini saqlashga yordam beradi."
    },
    {
      "id": 316,
      "input": "Bosh og'rig'ini qanday yengillashtirish mumkin?",
      "output": "Bosh og'rig'ini yengillashtirish uchun og'riq qoldiruvchi dorilar, dam olish, yaxshi uyqu, va stressni kamaytirish zarur."
    },
    {
      "id": 317,
      "input": "Baxtli va sog'lom hayot uchun qanday ruxsatnomalar kerak?",
      "output": "Baxtli va sog'lom hayot uchun ijobiy fikrlash, yaxshi uyqu, to'g'ri ovqatlanish va o'ziga vaqt ajratish zarur."
    },
    {
      "id": 318,
      "input": "Allergiya va astma o'rtasidagi farq nima?",
      "output": "Allergiya immun tizimining sezgir reaksiyasi bo'lib, astma nafas olish tizimining kasalligi bo'lib, o'rtasidagi aloqasi siydik yo'llari orqali simptomlar keltirib chiqarishi mumkin."
    },
    {
      "id": 319,
      "input": "Qon bosimi qanday o'lchanadi?",
      "output": "Qon bosimi sphygmomanometr yordamida o'lchanadi va sistolik va diastolik bosim ko'rsatkichlari orqali baholanadi."
    },
    {
      "id": 320,
      "input": "Gormonlar nima va ularning vazifasi qanday?",
      "output": "Gormonlar organizmda turli funktsiyalarni boshqaradigan kimyoviy moddalar bo'lib, ular o'sish, metabolizm va immun tizimi kabi jarayonlarni boshqaradi."
    },
    {
      "id": 321,
      "input": "O'zgaruvchan haroratga chidamlilikni qanday oshirish mumkin?",
      "output": "O'zgaruvchan haroratga chidamlilikni oshirish uchun adaptiv mashqlar, ovqatlanish va stressni boshqarish zarur."
    },
    {
      "id": 322,
      "input": "Yuqori haroratda ishlashda qanday xavflar bor?",
      "output": "Yuqori haroratda ishlashda issiqlik urishi, dehidratatsiya va issiqlik shoklari xavfi mavjud."
    },
    {
      "id": 323,
      "input": "Yangi tug'ilgan chaqaloqlarda qanday og'ir kasalliklarni aniqlash mumkin?",
      "output": "Yangi tug'ilgan chaqaloqlarda jigar va yurak kasalliklari, nafas olish muammolari va genetika bilan bog'liq kasalliklar aniqlanishi mumkin."
    },
    {
      "id": 324,
      "input": "Stressni boshqarish uchun qanday mashqlar qilish kerak?",
      "output": "Stressni boshqarish uchun chuqur nafas olish, meditatsiya, yoga va jismoniy mashqlar samarali hisoblanadi."
    },
    {
      "id": 325,
      "input": "Alkogolni iste'mol qilishning sog'liqka ta'siri qanday?",
      "output": "Alkogolni haddan tashqari iste'mol qilish jigar, yurak, miya va oshqozon-ichak tizimlariga zarar etkazishi mumkin."
    },
    {
      "id": 326,
      "input": "Diabetni qanday boshqarish kerak?",
      "output": "Diabetni boshqarish uchun qon shakarini nazorat qilish, to'g'ri ovqatlanish, muntazam jismoniy mashqlar va dori vositalarini qabul qilish kerak."
    },
    {
      "id": 327,
      "input": "Jigar sirozi nima?",
      "output": "Jigar sirozi jigar hujayralarining shikastlanishi va funksiyasining buzilishi bo'lib, bu jigarning faolligini yo'qotishiga olib keladi."
    },
    {
      "id": 328,
      "input": "Semirishni qanday davolash mumkin?",
      "output": "Semirishni davolash uchun ovqatlanishning nazorat qilinishi, jismoniy mashqlar va kerak bo'lsa, jarrohlik yoki dori-darmonlar yordamida amalga oshiriladi."
    },
    {
      "id": 329,
      "input": "Oyoqlarda shishishning sabablari qanday?",
      "output": "Oyoqlarda shishish yurak, buyrak, jigar kasalliklari yoki qon aylanishi bilan bog'liq muammolardan kelib chiqishi mumkin."
    },
    {
      "id": 330,
      "input": "Yod etishning sog'liqka ta'siri qanday?",
      "output": "Yod organizmning metabolizmiga, ayniqsa qalqonsimon bezning ishlashiga ta'sir qiladi, ammo ortiqcha iste'mol qilish zararli bo'lishi mumkin."
    },
    {
      "id": 331,
      "input": "Sog'lom teri uchun qanday parvarish kerak?",
      "output": "Sog'lom teri uchun toza va gigiyenik parvarish, quyoshdan himoya qilish va yuvinish muhim ahamiyatga ega."
    },
    {
      "id": 332,
      "input": "Teri saratonining xavf omillari qanday?",
      "output": "Teri saratonining xavf omillari quyosh nurlariga haddan tashqari ta'sir qilish, qizil teri tipi, oilaviy tarix va kuchli quyosh yonishlaridir."
    },
    {
      "id": 333,
      "input": "Depressiya qanday kasallik?",
      "output": "Depressiya ruhiy holatning uzluksiz pasayishi bo'lib, kayfiyatning tushishi, energiya yo'qotilishi va kundalik faoliyatni bajara olmaslikka olib keladi."
    },
    {
      "id": 334,
      "input": "Jigarni qanday tozalash mumkin?",
      "output": "Jigarni tozalash uchun spirtli ichimliklardan saqlanish, sog'lom ovqatlanish, ko'p suv ichish va zarur hollarda detoksifikatsiya usullarini qo'llash kerak."
    },
    {
      "id": 335,
      "input": "O'pkada yuqumli kasalliklar qanday tarqaladi?",
      "output": "O'pkada yuqumli kasalliklar nafas olish yo'li orqali tarqaladi, asosan viruslar yoki bakteriyalar tomonidan yuqtiriladi."
    },
    {
      "id": 336,
      "input": "Miya zararlanishi qanday ta'sir qiladi?",
      "output": "Miya zararlanishi asab tizimining buzilishiga olib keladi, natijada harakatlar, his-tuyg'ular, va fikrlash qobiliyatlari ta'sirlanishi mumkin."
    },
    {
      "id": 337,
      "input": "Fibrilatsiya nima?",
      "output": "Fibrilatsiya yurakning normal urishini buzadigan holat bo'lib, yurakning tez va tartibsiz urishi bilan ifodalanadi."
    },
    {
      "id": 338,
      "input": "Asab tizimining yallig'lanishini qanday davolash kerak?",
      "output": "Asab tizimining yallig'lanishi immun tizimining faoliyatini normallashtirish va yallig'lanishga qarshi dorilar yordamida davolanadi."
    },
    {
      "id": 339,
      "input": "Vitamin D ning tanadagi roli qanday?",
      "output": "Vitamin D suyaklarni mustahkamlash, immun tizimni qo'llab-quvvatlash va organizmning kaltsiyni yaxshi qabul qilishini ta'minlashda muhim rol o'ynaydi."
    },
    {
      "id": 340,
      "input": "Bosh og'rig'i qanday kasalliklarga aloqador bo'lishi mumkin?",
      "output": "Bosh og'rig'i stress, migren, yuqori qon bosimi, yoki miya shikastlanishidan kelib chiqishi mumkin."
    },
    {
      "id": 341,
      "input": "Yangi tug'ilgan chaqaloqlarda to'g'ri emizishning ahamiyati nima?",
      "output": "Yangi tug'ilgan chaqaloqlarda to'g'ri emizish immunitetni kuchaytiradi, o'sishini ta'minlaydi va kerakli oziq moddalar bilan ta'minlaydi."
    },
    {
      "id": 342,
      "input": "Yurak xastaligiga qanday tekshiruvlar o'tkaziladi?",
      "output": "Yurak xastaligi uchun EKG, echokardiyogramma, stress testlar va qon tahlillari o'tkaziladi."
    },
    {
      "id": 343,
      "input": "Xavfli yuqori qon bosimini qanday nazorat qilish mumkin?",
      "output": "Qon bosimini nazorat qilish uchun ovqatlanishni tartibga solish, jismoniy mashqlarni amalga oshirish va zarur dorilarni qabul qilish kerak."
    },
    {
      "id": 344,
      "input": "O'smirlarda badanga ta'sir qiluvchi stress qanday namoyon bo'ladi?",
      "output": "O'smirlarda stress jismoniy va ruhiy holatni buzib, yomon uyqu, kayfiyat o'zgarishlari, va ijtimoiy o'zgarishlarga olib kelishi mumkin."
    },
    {
      "id": 345,
      "input": "Ko'zlar uchun qanday o'qish rejimlari tavsiya etiladi?",
      "output": "Ko'zlar uchun o'qish rejimida qisqa tanaffuslar, yoritishning to'g'ri bo'lishi va uzoq vaqt davomida kompyuter ishlatmaslik kerak."
    },
    {
      "id": 346,
      "input": "Badanning haroratini qanday nazorat qilish mumkin?",
      "output": "Boshqa haroratga qarab kiyinish, issiqlikni saqlash va sovuqda yoki issiqlikda zarur choralarni ko'rish orqali haroratni nazorat qilish mumkin."
    },
    {
      "id": 347,
      "input": "Endometrioz nima?",
      "output": "Endometrioz – bu bachadonning ichki qavatining tashqariga chiqishi va boshqa organlarda o'sib borishi bilan bog'liq kasallik."
    },
    {
      "id": 348,
      "input": "Tuz va shakarni ortiqcha iste'mol qilishning oqibatlari qanday?",
      "output": "Tuz va shakarni ortiqcha iste'mol qilish qon bosimining ko'tarilishi, yurak va buyrak kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 349,
      "input": "Jismoniy faollikni oshirish uchun qanday mashqlar tavsiya etiladi?",
      "output": "Aerobik mashqlar, kuchaytiruvchi mashqlar va fleksibilite mashqlari jismoniy faollikni oshirish uchun tavsiya etiladi."
    },
    {
      "id": 350,
      "input": "Stressni boshqarish uchun qanday usullar ishlaydi?",
      "output": "Stressni boshqarish uchun meditatsiya, yoga, chuqur nafas olish va tabiiy muhitda vaqt o'tkazish samarali hisoblanadi."
    },
    {
      "id": 351,
      "input": "Suyaklar uchun qanday ovqatlar foydalidir?",
      "output": "Suyaklar uchun kalsiy va D vitamini boy oziq-ovqatlar, masalan, sut mahsulotlari, baliq, brokkoli va apelsin iste'mol qilish muhimdir."
    },
    {
      "id": 352,
      "input": "Yuqumli kasalliklardan qanday himoyalanish mumkin?",
      "output": "Yuqumli kasalliklardan himoyalanish uchun emlash, shaxsiy gigiena va toza suvdan foydalanish zarur."
    },
    {
      "id": 353,
      "input": "O'pkada allergiyalarni qanday davolash mumkin?",
      "output": "O'pkada allergiyalarni davolash uchun antihistaminlar, nazal spreylari va allergiya in'ektsiyalari ishlatiladi."
    },
    {
      "id": 354,
      "input": "Uyquni yaxshilash uchun qanday maslahatlar bor?",
      "output": "Uyquni yaxshilash uchun muntazam uyqu rejimi, xona haroratini sozlash va yotishdan oldin mobil telefonlarni cheklash zarur."
    },
    {
      "id": 355,
      "input": "Semirishni oldini olish uchun qanday sog'lom odatlar kerak?",
      "output": "Semirishni oldini olish uchun ovqatlanish vaqti va miqdorini nazorat qilish, muntazam mashqlar va uyquni to'g'ri tashkil qilish zarur."
    },
    {
      "id": 356,
      "input": "Yuqori qon bosimini qanday davolash kerak?",
      "output": "Yuqori qon bosimini davolash uchun dori-darmonlar, tuz iste'molini kamaytirish, vaznni normallashtirish va jismoniy mashqlar qilish kerak."
    },
    {
      "id": 357,
      "input": "Qon ketishni to'xtatish uchun qanday usullar ishlaydi?",
      "output": "Qon ketishni to'xtatish uchun siqish, bandajni to'g'ri o'rash, zarur hollarda tibbiy yordam so'rash kerak."
    },
    {
      "id": 358,
      "input": "To'g'ri ovqatlanishning jismoniy va ruhiy salomatlikka ta'siri qanday?",
      "output": "To'g'ri ovqatlanish jismoniy salomatlikni yaxshilaydi, energiya darajasini oshiradi va ruhiy holatni normallashtiradi."
    },
    {
      "id": 359,
      "input": "Mikrobial kasalliklarni qanday oldini olish mumkin?",
      "output": "Mikrobial kasalliklarni oldini olish uchun shaxsiy gigiena, toza suv va ehtiyotkorlik bilan ovqat tayyorlash zarur."
    },
    {
      "id": 360,
      "input": "Gormonal o'zgarishlar qachon boshqarilishi kerak?",
      "output": "Gormonal o'zgarishlar semizlik, uyqu buzilishlari, kayfiyat o'zgarishlari yoki ovqatlanish muammolari bilan bog'liq bo'lsa, shifokorga murojaat qilish zarur."
    },
    {
      "id": 361,
      "input": "Uyqusizlikning sabablarini qanday aniqlash mumkin?",
      "output": "Uyqusizlikning sabablarini aniqlash uchun uyqu jadvali, stress darajasi va tibbiy tekshiruvlar o'tkaziladi."
    },
    {
      "id": 362,
      "input": "Akne bilan kurashish uchun qanday davolash usullari mavjud?",
      "output": "Akne bilan kurashish uchun toza teri saqlash, yallig'lanishga qarshi dorilar va zarur hollarda dermatologga murojaat qilish kerak."
    },
    {
      "id": 363,
      "input": "Ko'zdagi qizarish va og'riqning sabablari qanday?",
      "output": "Ko'zdagi qizarish va og'riq qurish, infektsiya, allergiyalar yoki uzoq vaqt kompyuterga qarashdan kelib chiqishi mumkin."
    },
    {
      "id": 364,
      "input": "D vitamini yetishmovchiligi qanday kasalliklarni keltirib chiqaradi?",
      "output": "D vitamini yetishmovchiligi suyaklarning zaiflashishi, immun tizimi zaifligi va depresyaga olib kelishi mumkin."
    },
    {
      "id": 365,
      "input": "Badan haroratini o'lchashning qanday usullari mavjud?",
      "output": "Badan haroratini o'lchash uchun og'iz, quloq, to'piq yoki rektal usullar qo'llaniladi, eng aniq natijalar rektal usuldan olinadi."
    },
    {
      "id": 366,
      "input": "Yurtimizda emlash qanday amalga oshiriladi?",
      "output": "Emlash tibbiyot tashkilotlarida, shifokor tomonidan belgilangan vaqtlarda, xavfli kasalliklardan himoya qilish uchun amalga oshiriladi."
    },
    {
      "id": 367,
      "input": "O'pka yallig'lanishini oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "O'pka yallig'lanishini oldini olish uchun sigaret chekishdan saqlanish, gripp va pnevmoniya emlashlarini olish va toza havo nafas olish muhim."
    },
    {
      "id": 368,
      "input": "Oshqozon-ichak tizimi kasalliklarini qanday aniqlash mumkin?",
      "output": "Oshqozon-ichak tizimi kasalliklarini endoskopiya, ultratovush tekshiruvlari va qon tahlillari yordamida aniqlash mumkin."
    },
    {
      "id": 369,
      "input": "Jigar kasalliklarining oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Jigar kasalliklarining oldini olish uchun sog'lom ovqatlanish, spirtli ichimliklardan saqlanish, va virusli gepatitga qarshi emlash zarur."
    },
    {
      "id": 370,
      "input": "Bosh miya shishlarining belgilarini qanday aniqlash mumkin?",
      "output": "Bosh miya shishlarining belgilariga bosh og'rig'i, ko'zi qarashdagi o'zgarishlar, ko'ngil aynishi, va muvozanatni yo'qotish kiradi."
    },
    {
      "id": 371,
      "input": "Nafas olish tizimi kasalliklarini qanday oldini olish mumkin?",
      "output": "Nafas olish tizimi kasalliklarining oldini olish uchun toza havo nafas olish, chekishni tashlash, va muntazam jismoniy mashqlar qilish zarur."
    },
    {
      "id": 372,
      "input": "Psoriaz qanday kasallik va uni qanday davolash kerak?",
      "output": "Psoriaz terining yallig'lanishidan kelib chiqadigan surunkali kasallik bo'lib, uni davolash uchun kremlar, UV terapiya va immunosupressiv dorilar ishlatiladi."
    },
    {
      "id": 373,
      "input": "Yurakni qanday himoya qilish mumkin?",
      "output": "Yurakni himoya qilish uchun qon bosimini nazorat qilish, sog'lom ovqatlanish, jismoniy faollikni oshirish, va stressni kamaytirish zarur."
    },
    {
      "id": 374,
      "input": "Qon tahlili natijalarini qanday tushunish kerak?",
      "output": "Qon tahlili natijalarini tushunish uchun shifokor maslahatiga muvofiq eritrositlar, leykotsitlar, gemoglobin va boshqa ko'rsatkichlar tekshiriladi."
    },
    {
      "id": 375,
      "input": "O'smirlar va yoshlar uchun qanday sog'lom turmush tarzini tavsiya etish mumkin?",
      "output": "O'smirlar uchun sog'lom turmush tarzi muntazam jismoniy mashqlar, to'g'ri ovqatlanish, va stressni boshqarishni o'z ichiga oladi."
    },
    {
      "id": 376,
      "input": "Diabetni qanday oldini olish mumkin?",
      "output": "Diabetni oldini olish uchun sog'lom vaznni saqlash, to'g'ri ovqatlanish, va muntazam jismoniy mashqlar zarur."
    },
    {
      "id": 377,
      "input": "Badan og'rig'ini yengillashtirish uchun qanday dorilar ishlatiladi?",
      "output": "Badan og'rig'ini yengillashtirish uchun aspirin, ibuprofen, paratsetamol kabi og'riq qoldiruvchi dorilar ishlatiladi."
    },
    {
      "id": 378,
      "input": "Semizlangan kishilarda yurak kasalliklari xavfi qanday?",
      "output": "Semizlik yurak kasalliklari, yuqori qon bosimi, va qon shakarini yuqori darajada oshirishi mumkin, bu esa yurak xastaligi xavfini oshiradi."
    },
    {
      "id": 379,
      "input": "Ko'z sog'lig'ini saqlash uchun qanday choralar ko'rish kerak?",
      "output": "Ko'z sog'lig'ini saqlash uchun muntazam ko'z tekshiruvlarini o'tkazish, to'g'ri yoritishda ishlash va ko'zlarni himoya qilish zarur."
    },
    {
      "id": 380,
      "input": "Astmani qanday davolash mumkin?",
      "output": "Astmani davolash uchun inhalyatorlar, kortikosteroidlar, va bronxolitiklar qo'llaniladi."
    },
    {
      "id": 381,
      "input": "O'smirlarda ortiqcha vaznning sabablari nima?",
      "output": "O'smirlarda ortiqcha vaznning sabablari noto'g'ri ovqatlanish, jismoniy faollikning pastligi va genetik omillar bo'lishi mumkin."
    },
    {
      "id": 382,
      "input": "O'pka saratonining belgilari qanday?",
      "output": "O'pka saratonining belgilari uzoq davom etgan yo'tal, nafas qisqarishi, qonli balg'am chiqarish va og'riq bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 383,
      "input": "Anemiya qanday aniqlanadi va qanday davolanadi?",
      "output": "Anemiya qon tahlilida gemoglobin darajasining pastligi orqali aniqlanadi va temir, vitamin B12, yoki foliy kislotasi bilan davolanadi."
    },
    {
      "id": 384,
      "input": "Yod yetishmovchiligi qanday kasalliklarni keltirib chiqaradi?",
      "output": "Yod yetishmovchiligi qalqonsimon bez kasalliklari, goiter (qalqonsimon bezning kattalashishi) va aqliy zaiflikka olib kelishi mumkin."
    },
    {
      "id": 385,
      "input": "O'zgaruvchan haroratda ishlashda qanday xavflar mavjud?",
      "output": "O'zgaruvchan haroratda ishlashda issiqlik urishi, sovuqni ko'tarish, va dehidratatsiya xavfi mavjud."
    },
    {
      "id": 386,
      "input": "Quyoshdan himoyalanish uchun qanday choralar ko'rish kerak?",
      "output": "Quyoshdan himoyalanish uchun quyoshdan himoya kremi ishlatish, qorong'u kiyim kiyish va quyoshda uzoq vaqt qolmaslik kerak."
    },
    {
      "id": 387,
      "input": "Ikki nafas olish tizimi bo'lishi mumkinmi?",
      "output": "Ikki nafas olish tizimi bo'lishi mumkin, ammo bu juda noyob va odamning anatomik xususiyatlariga bog'liq."
    },
    {
      "id": 388,
      "input": "Ko'p suyuqlik ichishning sog'liq uchun foydalari qanday?",
      "output": "Ko'p suyuqlik ichish organizmni gidratatsiya qiladi, oshqozon-ichak tizimini yaxshilaydi va terini toza saqlashga yordam beradi."
    },
    {
      "id": 389,
      "input": "Organizmda ozuqa moddalarining taqsimlanishini qanday boshqarish mumkin?",
      "output": "Ozuqa moddalarining taqsimlanishi sog'lom ovqatlanish, yaxshi hazm qilish tizimi va muntazam jismoniy faollik orqali boshqariladi."
    },
    {
      "id": 390,
      "input": "Yangi tug'ilgan chaqaloqni emizishning qanday afzalliklari bor?",
      "output": "Yangi tug'ilgan chaqaloqni emizish uning immun tizimini kuchaytiradi, rivojlanishini ta'minlaydi va ona bilan yaqin aloqani rivojlantiradi."
    },
    {
      "id": 391,
      "input": "Oyoqlarda og'riqning sabablari qanday?",
      "output": "Oyoqlarda og'riqning sabablari ortiqcha yuklanish, artrit, nervlarning shikastlanishi, yoki qon aylanishining yomonlashishi bo'lishi mumkin."
    },
    {
      "id": 392,
      "input": "Semizlikni davolash uchun qanday usullar mavjud?",
      "output": "Semizlikni davolash uchun ovqatlanish rejimiga rioya qilish, jismoniy mashqlar, va ba'zi hollarda dori-darmonlar yoki jarrohlik yordamida amalga oshiriladi."
    },
    {
      "id": 393,
      "input": "Yuzdagi akne va qora dog'lar bilan kurashish uchun qanday vositalar ishlatiladi?",
      "output": "Yuzdagi akne va qora dog'lar bilan kurashish uchun tozalovchi kremlar, yallig'lanishga qarshi dorilar va dermatolog maslahatlari kerak."
    },
    {
      "id": 394,
      "input": "Stressni kamaytirish uchun qanday ovqatlar foydalidir?",
      "output": "Stressni kamaytirish uchun magniy, omega-3 yog'li kislotalari va vitamin B kompleksini o'z ichiga olgan ovqatlar foydalidir."
    },
    {
      "id": 395,
      "input": "Gormonal o'zgarishlar qanday ta'sir ko'rsatadi?",
      "output": "Gormonal o'zgarishlar kayfiyatni, uyquni, ovqatlanishni va jinsiy faoliyatni o'zgartirishi mumkin."
    },
    {
      "id": 396,
      "input": "Yangi tug'ilgan chaqaloqlarda birinchi emizishning ahamiyati qanday?",
      "output": "Birinchi emizish chaqaloqni kerakli immun tizimi moddalari bilan ta'minlaydi va ona bilan mustahkam aloqani o'rnatadi."
    },
    {
      "id": 397,
      "input": "Artrit qanday kasallik?",
      "output": "Artrit — bu bo'g'imlardagi yallig'lanish, og'riq va harakatsizlikka olib keladigan kasallik."
    },
    {
      "id": 398,
      "input": "Qonning pıhtılaşmasi nima?",
      "output": "Qonning pıhtılaşmasi — bu qonning tomirda to'planib, qon aylanishini to'xtatishga olib keladigan jarayon."
    },
    {
      "id": 399,
      "input": "Uzoq davom etgan o'zgarishlar qachon shifokor yordamiga muhtoj?",
      "output": "Agar o'zgarishlar 2 haftadan ko'proq davom etsa yoki kasallik belgilari kuchaysa, shifokorga murojaat qilish kerak."
    },
    {
      "id": 400,
      "input": "Tibbiyotda \"hayotiy belgilari\" nima?",
      "output": "Hayotiy belgilar — bu odamning umumiy sog'lig'ini baholash uchun ishlatiladigan asosiy ko'rsatkichlar: yurak urishi, nafas olish, qon bosimi, tana harorati."
    },
    {
      "id": 401,
      "input": "Shokoladning sog'liq uchun foydalari qanday?",
      "output": "Shokolad (xususan qora shokolad) antioksidantlar bilan boy bo'lib, yurak salomatligini qo'llab-quvvatlash va stressni kamaytirishga yordam beradi."
    },
    {
      "id": 402,
      "input": "Stressning organizmga qanday ta'siri bor?",
      "output": "Stress organizmning immun tizimini zaiflashtiradi, yurak-qon tomir kasalliklari, uyqu buzilishlari va ruhiy kasalliklarga olib kelishi mumkin."
    },
    {
      "id": 403,
      "input": "Uzoq davom etgan ishda ko'zlarni qanday himoya qilish kerak?",
      "output": "Uzoq davom etgan ishda ko'zlarni himoya qilish uchun ekran bilan ishlaganda qisqa tanaffuslar qilish, ko'z mashqlari bajarish va ekranni to'g'ri yoritish zarur."
    },
    {
      "id": 404,
      "input": "Tashqi ko'rinishdagi o'zgarishlar salomatlikni ko'rsatadimi?",
      "output": "Tashqi ko'rinishdagi o'zgarishlar, masalan, teri rangi, ko'zlar yoki sochlar, ichki kasalliklar yoki vitamin etishmovchiligi haqida ma'lumot berishi mumkin."
    },
    {
      "id": 405,
      "input": "Yangi tug'ilgan chaqaloqlar uchun qanday emlashlar kerak?",
      "output": "Yangi tug'ilgan chaqaloqlar uchun BCG, gepatit B, poliomielit, va difteriya, qizamiq emlashlari kerak."
    },
    {
      "id": 406,
      "input": "Boshqalar bilan o'zaro aloqada qanday gigiena qoidalariga rioya qilish kerak?",
      "output": "Boshqalar bilan aloqada gigiena qoidalariga rioya qilish uchun qo'lni tez-tez yuvish, niqob taqish va kasallik belgilari bo'lganlarga yaqinlashmaslik zarur."
    },
    {
      "id": 407,
      "input": "Ko'zdagi qurish qanday kasallikning belgisi bo'lishi mumkin?",
      "output": "Ko'zdagi qurish, ko'z yallig'lanishi, allergiyalar, yoki jismoniy va ruhiy holatdagi o'zgarishlarga bog'liq bo'lishi mumkin."
    },
    {
      "id": 408,
      "input": "Sog'lom ovqatlanishning jismoniy salomatlikka ta'siri qanday?",
      "output": "Sog'lom ovqatlanish tanadagi barcha tizimlarning faoliyatini qo'llab-quvvatlaydi, immunitetni kuchaytiradi va yurak kasalliklarini kamaytiradi."
    },
    {
      "id": 409,
      "input": "Yuqori qon bosimi qanday aniqlanadi?",
      "output": "Yuqori qon bosimi qon bosimini o'lchash yordamida aniqlanadi. Ko'pincha bir necha martalab o'lchash zarur bo'ladi."
    },
    {
      "id": 410,
      "input": "Yuqumli kasalliklarni qanday tez aniqlash mumkin?",
      "output": "Yuqumli kasalliklar simptomlar va tahlil natijalari asosida aniqlanadi. Maxsus testlar, masalan, PCR testlari, foydalaniladi."
    },
    {
      "id": 411,
      "input": "O'pkada allergiyalar qanday ko'rinadi?",
      "output": "O'pkada allergiyalar yo'tal, nafas qisqarishi, ko'ngil aynishi va burun tiqilishi shaklida namoyon bo'lishi mumkin."
    },
    {
      "id": 412,
      "input": "Sog'lom terini qanday saqlash mumkin?",
      "output": "Sog'lom terini saqlash uchun to'g'ri ovqatlanish, ko'p suv ichish, terini tozalash va quyoshdan himoya qilish kerak."
    },
    {
      "id": 413,
      "input": "Yod yetishmovchiligi qanday kasalliklarni keltirib chiqaradi?",
      "output": "Yod yetishmovchiligi qalqonsimon bezning kattalashishi (goiter), aqliy zaiflik, va bolalarda rivojlanish muammolariga olib kelishi mumkin."
    },
    {
      "id": 414,
      "input": "Ovqat hazm qilish jarayoni qanday ishlaydi?",
      "output": "Ovqat hazm qilish jarayoni og'izdan boshlanadi, oshqozon va ichaklarda oziq moddalarning sintezlanishi orqali energiya va foydali moddalar ajralib chiqadi."
    },
    {
      "id": 415,
      "input": "Ko'zning salomatligini saqlash uchun qanday o'zgartirishlar kerak?",
      "output": "Ko'zning salomatligini saqlash uchun muntazam tekshiruvlardan o'tish, vitaminlar bilan boyitilgan ovqatlar iste'mol qilish va ko'zlarni himoya qilish zarur."
    },
    {
      "id": 416,
      "input": "Yog'li ovqatlar qanday salomatlik muammolariga olib kelishi mumkin?",
      "output": "Yog'li ovqatlar yurak-qon tomir kasalliklari, yuqori qon bosimi va semizlikka olib kelishi mumkin."
    },
    {
      "id": 417,
      "input": "Pnevmoniya va uning oldini olish choralarini qanday bilish mumkin?",
      "output": "Pnevmoniyaning oldini olish uchun gripp va pnevmoniya emlashlarini olish, sigarettadan saqlanish va muntazam qo'l yuvish zarur."
    },
    {
      "id": 418,
      "input": "Anemiya qanday kasallikdir va qanday davolanadi?",
      "output": "Anemiya – bu qonning kislorod tashish qobiliyatining pasayishi, ko'pincha temir etishmovchiligi bilan bog'liq. Temir qo'shimchalari va vitamin B12 bilan davolanadi."
    },
    {
      "id": 419,
      "input": "Yurak xastaligiga qarshi qanday dori-darmonlar mavjud?",
      "output": "Yurak xastaligiga qarshi beta-blokatorlar, ACE inhibitori, aspirin, va statinlar kabi dori-darmonlar mavjud."
    },
    {
      "id": 420,
      "input": "Bemorlarni og'riqsizlantirish uchun qanday usullar qo'llaniladi?",
      "output": "Bemorlarni og'riqsizlantirish uchun analjeziklar, lokal anestetiklar yoki umumiy narkozdan foydalaniladi."
    },
    {
      "id": 421,
      "input": "O'pkani yallig'lanishdan himoya qilish uchun qanday choralar ko'rish kerak?",
      "output": "O'pkani himoya qilish uchun chekishdan saqlanish, polen va ifloslanishdan ehtiyot bo'lish, va o'z vaqtida emlash zarur."
    },
    {
      "id": 422,
      "input": "Jigarni tozalashda qanday natural usullar qo'llaniladi?",
      "output": "Jigarni tozalash uchun limon, zaytun yog'i, qizil lavlagi va jo'xori kabi tabiiy mahsulotlar foydalidir."
    },
    {
      "id": 423,
      "input": "Ko'zdagi qizarish va og'riqning sabablari qanday?",
      "output": "Ko'zdagi qizarish va og'riqning sabablari infektsiya, allergiyalar yoki ko'zning ortiqcha ishlatilishidan kelib chiqishi mumkin."
    },
    {
      "id": 424,
      "input": "Teri kasalliklarini qanday oldini olish mumkin?",
      "output": "Teri kasalliklarini oldini olish uchun terini toza va namlash, quyoshdan himoya qilish va sog'lom turmush tarzini olib borish zarur."
    },
    {
      "id": 425,
      "input": "Buzilgan suyaklar qanday davolanadi?",
      "output": "Buzilgan suyaklar gipsozni qo'llash, jarrohlik amaliyotlari yoki suyakni to'g'ri joylashtirish orqali davolanadi."
    },
    {
      "id": 426,
      "input": "Semizlik va ortiqcha vaznni qanday davolash mumkin?",
      "output": "Semizlikni davolash uchun ovqatlanishni tartibga solish, jismoniy mashqlar, va ba'zi hollarda jarrohlik amaliyotlari zarur."
    },
    {
      "id": 427,
      "input": "O'smirlarning salomatligini saqlash uchun qanday maslahatlar bor?",
      "output": "O'smirlar uchun sog'lom turmush tarzini davom ettirish, muntazam jismoniy faoliyat, va o'qish uchun qulay muhit yaratish zarur."
    },
    {
      "id": 428,
      "input": "O'pkadagi infeksiya va yallig'lanishning belgilari qanday?",
      "output": "O'pkadagi infeksiya va yallig'lanishning belgilariga nafas olishda qiyinchilik, yo'tal, va balg'am chiqishi kiradi."
    },
    {
      "id": 429,
      "input": "Diabet kasalligi qanday aniqlanadi?",
      "output": "Diabet kasalligi qon shakarini o'lchash, oralni glukozani sinab ko'rish yoki A1c test orqali aniqlanadi."
    },
    {
      "id": 430,
      "input": "Oshqozonning yallig'lanishi (gastrit) qanday kasallikdir?",
      "output": "Gastrit — bu oshqozonning shilliq qavatining yallig'lanishi, ko'pincha oshqozon shirasining ortiqcha ishlab chiqarilishi yoki infeksiya bilan bog'liq bo'ladi."
    },
    {
      "id": 431,
      "input": "Ichak mikrobiozasi nima?",
      "output": "Ichak mikrobiozasi — bu ichakdagi mikroorganizmlar (bakteriyalar, qo'ziqorinlar, va boshqalar) to'plamidir, ularning sog'lom balansini saqlash organizmning sog'lig'iga muhim ta'sir qiladi."
    },
    {
      "id": 432,
      "input": "Yangi tug'ilgan chaqaloqlarda icodika kasalliklari qanday oldini olinadi?",
      "output": "Yangi tug'ilgan chaqaloqlarda icodika kasalliklarining oldini olish uchun emlashlar, onaning sog'lom turmush tarzi, va yuqori gigiena qoidalariga rioya qilish zarur."
    },
    {
      "id": 433,
      "input": "Stressni kamaytirish uchun qanday jismoniy mashqlar foydalidir?",
      "output": "Stressni kamaytirish uchun yoga, nafas olish mashqlari, piyoda yurish, va meditatsiya foydalidir."
    },
    {
      "id": 434,
      "input": "Teri saratoni qanday belgilarga ega?",
      "output": "Teri saratoni belgilariga teri ustida noaniq chegaralarga ega bo'lgan dog'lar, qonash yoki shishish, va terining o'zgarishi kiradi."
    },
    {
      "id": 435,
      "input": "Tish kasalliklarini qanday oldini olish mumkin?",
      "output": "Tish kasalliklarini oldini olish uchun muntazam tish yuvish, tish ipidan foydalanish, va tish shifokoriga muntazam tashrif buyurish zarur."
    },
    {
      "id": 436,
      "input": "Yurak xastaligining oldini olish uchun qanday ovqatlar foydalidir?",
      "output": "Yurak xastaligining oldini olish uchun omega-3 yog'li kislotalari, to'liq donli mahsulotlar, sabzavotlar va mevalar iste'mol qilish foydalidir."
    },
    {
      "id": 437,
      "input": "Depressiyaning belgilari qanday?",
      "output": "Depressiyaning belgilariga kayfiyatning pastligi, umidsizlik, yengillik, uyqu buzilishi, va jismoniy energiya yo'qligi kiradi."
    },
    {
      "id": 438,
      "input": "Anemiya kasalligini qanday davolash mumkin?",
      "output": "Anemiya kasalligini temir qo'shimchalari, vitamin B12 va foliy kislotasi bilan davolash mumkin."
    },
    {
      "id": 439,
      "input": "Yallig'lanishga qarshi dori-darmonlar qanday ishlaydi?",
      "output": "Yallig'lanishga qarshi dori-darmonlar (NSAIDlar) og'riqni kamaytiradi, yallig'lanishni pasaytiradi va isitmani tushiradi."
    },
    {
      "id": 440,
      "input": "Xolesterin darajasini qanday nazorat qilish mumkin?",
      "output": "Xolesterin darajasini sog'lom ovqatlanish, jismoniy faoliyat, va ba'zi hollarda dori-darmonlar orqali nazorat qilish mumkin."
    },
    {
      "id": 441,
      "input": "O'tkir nafas qisqarishining sabablari qanday?",
      "output": "O'tkir nafas qisqarishi bronxial astma, yurak kasalliklari, yallig'lanish yoki infektsiya kabi sabablarga bog'liq bo'lishi mumkin."
    },
    {
      "id": 442,
      "input": "Qon bosimini qanday normalizatsiya qilish mumkin?",
      "output": "Qon bosimini normalizatsiya qilish uchun tuz iste'molini kamaytirish, muntazam jismoniy mashqlar qilish, va stressni boshqarish zarur."
    },
    {
      "id": 443,
      "input": "O'pka infeksiyasining belgilari qanday?",
      "output": "O'pka infeksiyasining belgilariga yo'tal, balg'am, nafas olishda qiyinchilik, isitma va ko'ngil aynishi kiradi."
    },
    {
      "id": 444,
      "input": "Jigarni qanday tozalash mumkin?",
      "output": "Jigarni tozalash uchun toza suv ichish, qizil lavlagi, zaytun yog'i va o'tlarni iste'mol qilish zarur."
    },
    {
      "id": 445,
      "input": "Semizlik va ortiqcha vaznning sabablari nima?",
      "output": "Semizlikning sabablari noto'g'ri ovqatlanish, jismoniy faoliyatning yetishmasligi, va genetik omillar bilan bog'liq."
    },
    {
      "id": 446,
      "input": "Ovqat hazm qilish tizimining muammolarini qanday aniqlash mumkin?",
      "output": "Ovqat hazm qilish tizimining muammolarini endoskopiya, ultratovush tekshiruvlari va qon tahlillari yordamida aniqlash mumkin."
    },
    {
      "id": 447,
      "input": "Ko'zda qurish va yonishning sabablari qanday?",
      "output": "Ko'zda qurish va yonishning sabablari allergiya, infektsiyalar, yoki uzun vaqt davomida kompyuter yoki telefon ekraniga qarashdan kelib chiqishi mumkin."
    },
    {
      "id": 448,
      "input": "Yurak xastaligi uchun qanday og'riqsizlantirish usullari mavjud?",
      "output": "Yurak xastaligi uchun og'riqsizlantirish usullari morfin, beta-blokatorlar, va boshqa analjeziklar yordamida amalga oshiriladi."
    },
    {
      "id": 449,
      "input": "Akne va teri muammolarini qanday davolash mumkin?",
      "output": "Akne va teri muammolarini davolash uchun maxsus dorilar, krem va tozalash vositalari ishlatiladi."
    },
    {
      "id": 450,
      "input": "O'pka saratoni qanday aniqlanadi?",
      "output": "O'pka saratoni tasdiqlanishi uchun kompyuter tomografiyasi (KT), rentgen, va bronxoskopiya yordamida aniqlanadi."
    },
    {
      "id": 451,
      "input": "Teri saratonining oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Teri saratonining oldini olish uchun quyoshdan himoya qilish, kremdan foydalanish, va terini muntazam tekshiruvdan o'tkazish zarur."
    },
    {
      "id": 452,
      "input": "Stressni qanday boshqarish mumkin?",
      "output": "Stressni boshqarish uchun meditatsiya, yoga, nafas olish mashqlari, va muntazam jismoniy faollik foydalidir."
    },
    {
      "id": 453,
      "input": "Bosh og'rig'ining sabablari qanday?",
      "output": "Bosh og'rig'i stress, migren, o'pka infeksiyalari, yuqori qon bosimi, va ko'plab boshqa sabablardan kelib chiqishi mumkin."
    },
    {
      "id": 454,
      "input": "O'smirlar va yoshlar uchun qanday sog'lom turmush tarzini tavsiya etish mumkin?",
      "output": "O'smirlar uchun sog'lom turmush tarzini davom ettirish, muntazam jismoniy faoliyat, va o'qish uchun qulay muhit yaratish zarur."
    },
    {
      "id": 455,
      "input": "Tishlarni qanday himoya qilish mumkin?",
      "output": "Tishlarni himoya qilish uchun muntazam ravishda tishlarni yuvish, tish ipidan foydalanish va tish shifokoriga ko'rinish zarur."
    },
    {
      "id": 456,
      "input": "Tananing immunitet tizimini qanday kuchaytirish mumkin?",
      "output": "Immunitetni kuchaytirish uchun vitamin C va D, toza ovqatlar iste'mol qilish va jismoniy mashqlar qilish muhim."
    },
    {
      "id": 457,
      "input": "Yurak ritmini normallashtirish uchun qanday usullar mavjud?",
      "output": "Yurak ritmini normallashtirish uchun meditatsiya, qahva iste'molini kamaytirish va dorilar yordamida ritmni boshqarish kerak."
    },
    {
      "id": 458,
      "input": "Bosh og'rig'ining tez-tez yuzaga kelish sabablari nima?",
      "output": "Bosh og'rig'ining sabablari stress, suv yetishmasligi, qon bosimi o'zgarishlari yoki migren bo'lishi mumkin."
    },
    {
      "id": 459,
      "input": "Muntazam uyquning sog'liq uchun qanday ahamiyati bor?",
      "output": "Muntazam uyqu tananing tiklanishini ta'minlaydi, immunitetni oshiradi va ruhiy holatni yaxshilaydi."
    },
    {
      "id": 460,
      "input": "O'zingizni uzoq davom etgan charchoqdan qanday xalos qilish mumkin?",
      "output": "Charchoqdan xalos bo'lish uchun yetarli dam olish, vitaminlar qabul qilish va kundalik rejimga rioya qilish kerak."
    },
    {
      "id": 461,
      "input": "Jinsiy salomatlikni saqlash uchun qanday choralar ko'rish kerak?",
      "output": "Jinsiy salomatlikni saqlash uchun himoyalangan aloqada bo'lish, muntazam tibbiy tekshiruvdan o'tish va stressni boshqarish muhim."
    },
    {
      "id": 462,
      "input": "Ayollarda homiladorlik davrida qanday xavflar bo'lishi mumkin?",
      "output": "Homiladorlikda qon bosimining ko'tarilishi, qandli diabet, yoki kamqonlik xavfi kuzatilishi mumkin."
    },
    {
      "id": 463,
      "input": "Qon bosimini qanday qilib tabiiy usullarda tushirish mumkin?",
      "output": "Qon bosimini tushirish uchun tuz iste'molini kamaytirish, banan va yashil sabzavotlar iste'mol qilish hamda stressni boshqarish muhim."
    },
    {
      "id": 464,
      "input": "Oshqozon yarasining belgilari qanday?",
      "output": "Oshqozon yarasining belgilari orasida qorin og'rig'i, ko'ngil aynishi va qorin damishi mavjud."
    },
    {
      "id": 465,
      "input": "Spirtli ichimliklar tanaga qanday zarar yetkazadi?",
      "output": "Spirtli ichimliklar jigarni zararlaydi, qon bosimini oshiradi va yurak-qon tomir kasalliklariga olib keladi."
    },
    {
      "id": 466,
      "input": "Farzandlar uchun sog'lom ovqatlanishni qanday tashkil qilish kerak?",
      "output": "Farzandlar uchun ko'p vitaminlar, mevalar va proteinlarga boy ovqatlarni tanlash zarur."
    },
    {
      "id": 467,
      "input": "Qalqonsimon bezning ishlashini qanday baholash mumkin?",
      "output": "Qalqonsimon bezning ishlashini qon tahlili (TSH, T3, T4) va ultratovush yordamida baholash mumkin."
    },
    {
      "id": 468,
      "input": "Bo'g'im og'rig'ini kamaytirish uchun qanday dorilar bor?",
      "output": "Bo'g'im og'rig'i uchun ibuprofen, paratsetamol yoki kortikosteroidlar tavsiya etiladi."
    },
    {
      "id": 469,
      "input": "Yurak-qon tomir kasalliklarining asosiy xavf omillari nima?",
      "output": "Asosiy xavf omillari semizlik, yuqori qon bosimi, stress va noto'g'ri ovqatlanishdir."
    },
    {
      "id": 470,
      "input": "Kamqonlikni qanday aniqlash va davolash mumkin?",
      "output": "Kamqonlik qon tahlillari yordamida aniqlanadi va temir preparatlari, foliy kislotasi yoki B12 vitamini bilan davolanadi."
    },
    {
      "id": 471,
      "input": "O'pkadagi shish qanday aniqlanadi?",
      "output": "O'pkadagi shish rentgen, kompyuter tomografiyasi va laborator tekshiruvlar yordamida aniqlanadi."
    },
    {
      "id": 472,
      "input": "Teri ostida yuzaga kelgan shish qanday davolanadi?",
      "output": "Teri ostidagi shish sababiga qarab jarrohlik amaliyoti, antibiotiklar yoki yallig'lanishga qarshi dorilar bilan davolanadi."
    },
    {
      "id": 473,
      "input": "Bolalarda tez-tez kasallanish sabablari qanday bo'lishi mumkin?",
      "output": "Bolalarda kasallanishning asosiy sababi immun tizimining zaifligi yoki gigiena qoidalariga rioya qilmaslikdir."
    },
    {
      "id": 474,
      "input": "Allergiya belgilari qanday namoyon bo'ladi?",
      "output": "Allergiya belgilari orasida qichishish, toshma, burun tiqilishi va nafas olishda qiyinchiliklar bor."
    },
    {
      "id": 475,
      "input": "Grippni uy sharoitida qanday davolash mumkin?",
      "output": "Grippni davolash uchun ko'p suyuqlik ichish, dam olish va simptomlarni yengillashtirish uchun dorilar ishlatiladi."
    },
    {
      "id": 476,
      "input": "Soch to'kilishini qanday kamaytirish mumkin?",
      "output": "Soch to'kilishini kamaytirish uchun sog'lom ovqatlanish, stressni boshqarish va maxsus shampunlar ishlatish kerak."
    },
    {
      "id": 477,
      "input": "Yurak xurujining dastlabki belgilarini qanday aniqlash mumkin?",
      "output": "Yurak xurujining belgilariga ko'krakda og'riq, nafas qisishi va qo'llarda og'irlik hissi kiradi."
    },
    {
      "id": 478,
      "input": "Suyaklar mustahkamligini qanday saqlash kerak?",
      "output": "Suyaklar mustahkamligini saqlash uchun kalsiy va vitamin D iste'mol qilish, shuningdek, jismoniy mashqlar muhim."
    },
    {
      "id": 479,
      "input": "Oshqozon shishishini qanday kamaytirish mumkin?",
      "output": "Oshqozon shishishini kamaytirish uchun ovqatni sekin chaynash, gazli ichimliklardan saqlanish va probiotiklar iste'mol qilish kerak."
    },
    {
      "id": 480,
      "input": "Sport bilan shug'ullanayotgan kishilar uchun qanday oziq-ovqatlar foydali?",
      "output": "Protein, uglevodlar, va elektrolitlarga boy oziq-ovqatlar sportchilar uchun muhimdir."
    },
    {
      "id": 481,
      "input": "Diabet kasalligini boshqarish uchun qanday usullar bor?",
      "output": "Diabetni boshqarish uchun qon shakarini nazorat qilish, maxsus parhez va muntazam jismoniy mashqlar zarur."
    },
    {
      "id": 482,
      "input": "Ovqat allergiyalarini qanday aniqlash mumkin?",
      "output": "Ovqat allergiyalari teri testi yoki qon tahlillari orqali aniqlanadi."
    },
    {
      "id": 483,
      "input": "Yuzdagi charchoq belgilarini qanday kamaytirish mumkin?",
      "output": "Yuzdagi charchoqni kamaytirish uchun ko'p suv ichish, yetarlicha uyqu va yuzni namlovchi vositalardan foydalanish muhim."
    },
    {
      "id": 484,
      "input": "Uyqu buzilishlarini qanday davolash mumkin?",
      "output": "Uyqu buzilishlarini davolash uchun kundalik rejimni yaxshilash, stressni kamaytirish va melatonin qo'llash mumkin."
    },
    {
      "id": 485,
      "input": "Sog'lom vaznni saqlash uchun qanday odatlar kerak?",
      "output": "Sog'lom vaznni saqlash uchun balansli ovqatlanish, muntazam jismoniy mashqlar va shirinliklarni cheklash zarur."
    },
    {
      "id": 486,
      "input": "Havo ifloslanishi sog'liqqa qanday ta'sir ko'rsatadi?",
      "output": "Havo ifloslanishi nafas yo'llari kasalliklari, yurak xastaliklari va allergiyaga olib kelishi mumkin."
    },
    {
      "id": 487,
      "input": "Bolalarda qizamiqni qanday aniqlash mumkin?",
      "output": "Qizamiq isitma, burun oqishi, qizil toshmalar va ko'zning qizarishi bilan namoyon bo'ladi."
    },
    {
      "id": 488,
      "input": "Tishlarning mustahkamligini qanday ta'minlash mumkin?",
      "output": "Tishlarning mustahkamligi uchun kaltsiy va fosforga boy ovqatlar iste'mol qilish, tishlarni to'g'ri parvarish qilish kerak."
    },
    {
      "id": 489,
      "input": "Quyoshdan kuyishni qanday oldini olish mumkin?",
      "output": "Quyoshdan kuyishni oldini olish uchun SPF kremlardan foydalanish, soyabon ostida yurish va quyoshdan himoya kiyim kiyish kerak."
    },
    {
      "id": 490,
      "input": "Yurak xurujidan keyin qayta tiklanish jarayoni qanday o'tadi?",
      "output": "Yurak xurujidan keyin jismoniy mashqlar, to'g'ri ovqatlanish va muntazam tibbiy kuzatuv talab qilinadi."
    },
    {
      "id": 491,
      "input": "Qon bosimi tushib ketganda qanday yordam ko'rsatish mumkin?",
      "output": "Qon bosimi tushib ketganda ko'p suv ichish, tuzli mahsulot iste'mol qilish va oyoqlarni yuqoriga ko'tarish foydali."
    },
    {
      "id": 492,
      "input": "Homilador ayollarda vitamin D muhimmi?",
      "output": "Ha, vitamin D homiladorlikda suyaklarning rivojlanishi va immunitetni qo'llab-quvvatlash uchun muhimdir."
    },
    {
      "id": 493,
      "input": "Virus va bakteriya infektsiyalari qanday farqlanadi?",
      "output": "Virus infektsiyalari odatda antibiotiklarga javob bermaydi, bakteriya infektsiyalari esa antibiotiklar bilan davolanadi."
    },
    {
      "id": 494,
      "input": "Bo'yin mushaklarining og'rig'ini qanday davolash mumkin?",
      "output": "Bo'yin mushaklarini issiq yoki sovuq kompresslar, massaj va yengil mashqlar bilan davolash mumkin."
    },
    {
      "id": 495,
      "input": "Qandli diabetning dastlabki belgilarini qanday aniqlash mumkin?",
      "output": "Tez-tez chanqash, ko'p siydik ajralishi, va charchoq diabetning dastlabki belgilaridir."
    },
    {
      "id": 496,
      "input": "Bolalar sog'lig'ida immunizatsiyaning ahamiyati qanday?",
      "output": "Immunizatsiya yuqumli kasalliklardan himoya qiladi va bolalarning umumiy salomatligini yaxshilaydi."
    },
    {
      "id": 497,
      "input": "Teridagi yallig'lanishni qanday yengillashtirish mumkin?",
      "output": "Teridagi yallig'lanishni sovuq kompresslar, aloe vera yoki yallig'lanishga qarshi kremlar bilan yengillashtirish mumkin."
    },
    {
      "id": 498,
      "input": "Qondagi shakar miqdorini qanday boshqarish mumkin?",
      "output": "Qondagi shakarni boshqarish uchun uglevodlarni cheklash, muntazam ovqatlanish va mashq qilish zarur."
    },
    {
      "id": 499,
      "input": "Yuqori haroratni tezda qanday tushirish mumkin?",
      "output": "Yuqori haroratni tushirish uchun sovuq kompresslar, ko'p suyuqlik ichish va parasetamol ishlatish tavsiya etiladi."
    },
    {
      "id": 500,
      "input": "Anemiya rivojlanishining oldini olish uchun nima qilish kerak?",
      "output": "Temirga boy mahsulotlarni iste'mol qilish va muntazam qon tahlili o'tkazish anemiyani oldini oladi."
    },
    {
      "id": 501,
      "input": "Mushaklarning kuchsizlanishiga qanday sabablar bor?",
      "output": "Mushaklarning kuchsizlanishi noto'g'ri ovqatlanish, vitamin etishmovchiligi yoki asab kasalliklari bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 502,
      "input": "Asabiylikni kamaytirish uchun qanday maslahatlar bor?",
      "output": "Asabiylikni kamaytirish uchun chuqur nafas olish, meditatsiya va dam olish muhimdir."
    },
    {
      "id": 503,
      "input": "Mushak spazmlarini qanday oldini olish mumkin?",
      "output": "Mushak spazmlarini oldini olish uchun ko'p suv ichish, magniy va kaliy iste'molini oshirish kerak."
    },
    {
      "id": 504,
      "input": "Uyqusizlikdan qanday qutulish mumkin?",
      "output": "Uyqusizlikdan qutulish uchun yotishdan oldin ekranlardan uzoqlashish, yengil jismoniy mashqlar va chamomile choy ichish tavsiya etiladi."
    },
    {
      "id": 505,
      "input": "Oshqozondagi kislotalikni qanday kamaytirish mumkin?",
      "output": "Oshqozondagi kislotalikni kamaytirish uchun tuzli ovqatlardan saqlanish va antasid dorilar qabul qilish kerak."
    },
    {
      "id": 506,
      "input": "Bolalarda suyaklarning mustahkam o'sishini qanday qo'llab-quvvatlash mumkin?",
      "output": "Bolalarga kaltsiy, vitamin D va proteinlarga boy ovqatlar berish suyaklarning o'sishini ta'minlaydi."
    },
    {
      "id": 507,
      "input": "Yoshlikda yurak xastaligini oldini olish uchun nima qilish kerak?",
      "output": "Sog'lom ovqatlanish, jismoniy faoliyat va stressni boshqarish yurak xastaligini oldini oladi."
    },
    {
      "id": 508,
      "input": "Ayollarda osteoporozning oldini olish uchun nima qilish kerak?",
      "output": "Osteoporozning oldini olish uchun kaltsiy va vitamin D iste'moli, shuningdek, kuchli mashqlar kerak."
    },
    {
      "id": 509,
      "input": "Yuqumli kasalliklarning eng keng tarqalgan turlari qanday?",
      "output": "Yuqumli kasalliklarga gripp, qizamiq, gepatit va o'pka infeksiyalari kiradi."
    },
    {
      "id": 510,
      "input": "Qon tomirlarining mustahkamligini qanday yaxshilash mumkin?",
      "output": "Qon tomirlarini mustahkamlash uchun ko'p harakat qilish, omega-3 yog' kislotasini iste'mol qilish va chekishdan saqlanish kerak."
    },
    {
      "id": 511,
      "input": "Keksalarda qon aylanishini yaxshilash uchun nima qilish kerak?",
      "output": "Keksalarda qon aylanishini yaxshilash uchun yengil mashqlar, yurish va qon aylanishini rag'batlantiruvchi dorilar yordam beradi."
    },
    {
      "id": 512,
      "input": "Yosh bolalardagi allergiya qanday boshqariladi?",
      "output": "Yosh bolalarda allergiyani boshqarish uchun allergenlarni aniqlash va undan saqlanish zarur."
    },
    {
      "id": 513,
      "input": "Aqliy sog'liqni yaxshilash uchun qanday odatlar kerak?",
      "output": "Meditatsiya, sog'lom ovqatlanish va o'z his-tuyg'ularini ifodalash uchun vaqt ajratish aqliy sog'liqni yaxshilaydi."
    },
    {
      "id": 514,
      "input": "Semizlikni tabiiy usullarda qanday kamaytirish mumkin?",
      "output": "Semizlikni kamaytirish uchun to'g'ri parhez, muntazam harakat va spirtli ichimliklardan voz kechish muhim."
    },
    {
      "id": 515,
      "input": "Uzoq davom etgan yo'talning sabablarini qanday aniqlash mumkin?",
      "output": "Uzoq davom etgan yo'talni rentgen va laboratoriya tahlillari orqali aniqlash mumkin."
    },
    {
      "id": 516,
      "input": "Stress organizmga qanday ta'sir ko'rsatadi?",
      "output": "Stress yurak urishini tezlashtiradi, immunitetni zaiflashtiradi va asabiylikni kuchaytiradi."
    },
    {
      "id": 517,
      "input": "Katta yoshdagi odamlarda eshitish pasayishining sabablarini aniqlash uchun nima qilish kerak?",
      "output": "Eshitish pasayishini aniqlash uchun audiometriya testi va LOR shifokor bilan maslahat zarur."
    },
    {
      "id": 518,
      "input": "Sovuqni oldini olish uchun qanday choralar ko'rish mumkin?",
      "output": "Sovuqni oldini olish uchun immunitetni mustahkamlash, iliq kiyinish va grippga qarshi emlash tavsiya etiladi."
    },
    {
      "id": 519,
      "input": "Ich ketishiga qarshi qanday dori vositalari mavjud?",
      "output": "Loperamid, probiotiklar va ko'p suyuqlik ichish ich ketishiga qarshi ishlatiladi."
    },
    {
      "id": 520,
      "input": "Homiladorlikning dastlabki belgilari qanday?",
      "output": "Dastlabki belgilar orasida hayz kechikishi, ko'ngil aynishi va ko'krak sezuvchanligi mavjud."
    },
    {
      "id": 521,
      "input": "Ichaklarning sog'lig'ini qanday saqlash kerak?",
      "output": "Ichak sog'lig'ini saqlash uchun tolaga boy ovqatlar, probiotiklar va ko'p suv ichish zarur."
    },
    {
      "id": 522,
      "input": "Qo'l terisining qurishi qanday oldini olinadi?",
      "output": "Qo'l terisini namlovchi kremlar, iliq suv va sovun ishlatish bilan himoya qilish mumkin."
    },
    {
      "id": 523,
      "input": "Ko'z zo'riqishini qanday kamaytirish mumkin?",
      "output": "Ko'z zo'riqishini kamaytirish uchun har 20 daqiqada ko'z dam olishini ta'minlash va ko'z tomchilarini ishlatish kerak."
    },
    {
      "id": 524,
      "input": "Suyak sinishini qanday tezroq davolash mumkin?",
      "output": "Suyak sinishini davolash uchun kaltsiy va vitamin D iste'moli, shuningdek, fizioterapiya muhim."
    },
    {
      "id": 525,
      "input": "Nafas qisishi qanday sabablarga ko'ra yuzaga keladi?",
      "output": "Nafas qisishi astma, yurak kasalliklari yoki allergiyalar natijasida paydo bo'lishi mumkin."
    },
    {
      "id": 526,
      "input": "Gormonal nomutanosiblikning belgilarini qanday aniqlash mumkin?",
      "output": "Charchoq, vazn o'zgarishi va uyqu buzilishi gormonal muvozanat buzilishining belgilari bo'lishi mumkin."
    },
    {
      "id": 527,
      "input": "Og'iz bo'shlig'ini qanday to'g'ri parvarish qilish kerak?",
      "output": "Tishlarni kuniga ikki marta tozalash, ipdan foydalanish va stomatologga muntazam murojaat qilish muhim."
    },
    {
      "id": 528,
      "input": "O'lat kasalligining oldini olish uchun qanday choralar zarur?",
      "output": "O'latning oldini olish uchun gigiena qoidalariga rioya qilish va kemiruvchilar bilan aloqani cheklash zarur."
    },
    {
      "id": 529,
      "input": "Yurak urishini normal holatda saqlash uchun nima qilish kerak?",
      "output": "Yurak urishini normal saqlash uchun stressni kamaytirish, kofeinni cheklash va muntazam jismoniy mashqlar qilish kerak."
    },
    {
      "id": 530,
      "input": "Ko'ngil aynishini qanday tabiiy usullarda yengish mumkin?",
      "output": "Zanjabil choy, limon suv va chuqur nafas olish ko'ngil aynishini yengillashtiradi."
    },
    {
      "id": 531,
      "input": "Yuqori xolesterin darajasi qanday kasalliklarga olib kelishi mumkin?",
      "output": "Yuqori xolesterin yurak xastaligi, insult va qon tomir kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 532,
      "input": "Astma va bronxitni qanday farqlash mumkin?",
      "output": "Astma nafas olishda qiyinchiliklar va havo yo'llarining torayishi bilan tavsiflanadi, bronxit esa yo'tal va shamollash bilan bog'liq."
    },
    {
      "id": 533,
      "input": "Suv ichishning sog'liq uchun qanday foydalari bor?",
      "output": "Suv ichish organizmni namlaydi, toksinlarni chiqaradi va ichaklar faoliyatini yaxshilaydi."
    },
    {
      "id": 534,
      "input": "Anksiyetani qanday yengish mumkin?",
      "output": "Anksiyetani meditatsiya, chuqur nafas olish va muntazam jismoniy mashqlar bilan yengish mumkin."
    },
    {
      "id": 535,
      "input": "Ko'zdagi qizarishni qanday davolash mumkin?",
      "output": "Ko'z qizarishi uchun sovuq kompress, ko'z tomchilari yoki allergiyaga qarshi preparatlar ishlatiladi."
    },
    {
      "id": 536,
      "input": "Qiymatni to'g'ri o'lchash uchun qanday usullar mavjud?",
      "output": "Ideal vaznni hisoblash uchun BMI (Body Mass Index) usulidan foydalanish mumkin."
    },
    {
      "id": 537,
      "input": "Tishlarni tozalashda qaysi texnikalar samarali?",
      "output": "Tishlarni to'g'ri tozalash uchun tish pastasi bilan harakatlarni yumshoq qilib, barcha yuzalarini tozalash zarur."
    },
    {
      "id": 538,
      "input": "Menstrual tsiklni qanday yaxshilash mumkin?",
      "output": "Menstrual tsiklni yaxshilash uchun stressni kamaytirish, to'g'ri ovqatlanish va muntazam jismoniy faoliyatni bajarish zarur."
    },
    {
      "id": 539,
      "input": "Xolesterin va yog'larning o'rtasidagi farq nima?",
      "output": "Xolesterin – organizm uchun zarur, lekin ortiqcha miqdori zararli; yog'lar esa organizmga energiya beradi, lekin zararli yog'lar o'zgaradi."
    },
    {
      "id": 540,
      "input": "Nefrit (buyrak yallig'lanishi) qanday aniqlanadi?",
      "output": "Nefritni qon tahlillari, siydik tahlillari va buyrak ultratovush tekshiruvi orqali aniqlash mumkin."
    },
    {
      "id": 541,
      "input": "O'pka saratonini qanday erta bosqichda aniqlash mumkin?",
      "output": "O'pka saratonining erta bosqichlari xususan ko'p yo'tal, qonni ko'rish va nafas qisish bilan aniqlanadi."
    },
    {
      "id": 542,
      "input": "Teri yallig'lanishiga nima sabab bo'ladi?",
      "output": "Teri yallig'lanishiga allergiya, infeksiyalar yoki tashqi muhitning ta'siri sabab bo'lishi mumkin."
    },
    {
      "id": 543,
      "input": "Qo'llarning artritidan qanday saqlanish mumkin?",
      "output": "Artritdan saqlanish uchun mushaklarni mustahkamlash, yengil mashqlar va ortiqcha yukdan qochish kerak."
    },
    {
      "id": 544,
      "input": "Homiladorlikda temir ta'minoti nima uchun muhim?",
      "output": "Temir homiladorlikda qon hajmini oshirish, qonning kislorod bilan ta'minlanishini yaxshilash uchun zarur."
    },
    {
      "id": 545,
      "input": "Oyoqlarda dam olishni qanday ta'minlash mumkin?",
      "output": "Oyoqlarda dam olish uchun oyoqlarni ko'tarish, yengil massaj va to'g'ri oyoq kiyimlarini tanlash kerak."
    },
    {
      "id": 546,
      "input": "Yurakning noto'g'ri urishini qanday aniqlash mumkin?",
      "output": "Yurakning noto'g'ri urishi ko'krakdagi og'riq, nafas qisilishi va tez yurak urishiga sabab bo'lishi mumkin."
    },
    {
      "id": 547,
      "input": "Yuz terisi uchun qanday parvarish qilish kerak?",
      "output": "Yuz terisini tozalash, namlash va himoya qilish uchun SPF krem va yengil niqoblardan foydalanish kerak."
    },
    {
      "id": 548,
      "input": "Hipertoniya (yuqori qon bosimi) uchun qanday dori vositalari mavjud?",
      "output": "Hipertoniya uchun angiotenzin-konvertatsiya fermenti tormozlovchilari, beta-blokerlar va diuretika dorilari ishlatiladi."
    },
    {
      "id": 549,
      "input": "Ba'zida qayta-qayta yuzaga keladigan bosh og'rig'ining sabablarini qanday aniqlash mumkin?",
      "output": "Bosh og'rig'ining sababi stress, ko'z zo'riqishi yoki migrenga bog'liq bo'lishi mumkin, buning uchun nevrologga murojaat qilish kerak."
    },
    {
      "id": 550,
      "input": "O'tkir allergiyalarga qanday tez yordam ko'rsatiladi?",
      "output": "O'tkir allergiyalarni davolashda antihistaminlar, epinefrin va shifokor nazorati kerak bo'lishi mumkin."
    },
    {
      "id": 551,
      "input": "Jigar kasalliklarini qanday oldini olish mumkin?",
      "output": "Jigar kasalliklarining oldini olish uchun alkogoldan saqlanish, sog'lom ovqatlanish va muntazam jismoniy faoliyat zarur."
    },
    {
      "id": 552,
      "input": "Stressni boshqarish uchun qanday psixologik usullar mavjud?",
      "output": "Stressni boshqarish uchun meditatsiya, yoga, chuqur nafas olish va tabiatda vaqt o'tkazish samarali usullardir."
    },
    {
      "id": 553,
      "input": "Narkotik moddalar sog'liqqa qanday zarar yetkazadi?",
      "output": "Narkotik moddalar asab tizimi va yurak-qon tomir tizimiga jiddiy zarar yetkazib, psixologik va jismoniy qaramlikka olib kelishi mumkin."
    },
    {
      "id": 554,
      "input": "Keksalarning sog'lig'ini saqlash uchun nima qilish kerak?",
      "output": "Keksalarda muntazam jismoniy mashqlar, to'g'ri ovqatlanish va ijtimoiy faoliyatni davom ettirish muhimdir."
    },
    {
      "id": 555,
      "input": "Uyqusizlikni davolashda qanday tabiatga asoslangan vositalar ishlatiladi?",
      "output": "Uyqusizlikni davolashda chamomile, melatonin yoki lavanda oilari ishlatilishi mumkin."
    },
    {
      "id": 556,
      "input": "O'tkir nafas olish qiyinchiliklarida qanday yordam ko'rsatish kerak?",
      "output": "O'tkir nafas olish qiyinchiliklari bo'lsa, tez yordam chaqirish, bemorni yotqizish va kislorod berish kerak."
    },
    {
      "id": 557,
      "input": "Qon tomirlarining ichki qattiqlashishi qanday davolanadi?",
      "output": "Qon tomirlarining ichki qattiqlashishi statinlar, qon bosimini pasaytiruvchi dorilar va sog'lom turmush tarzini qo'llab-quvvatlash orqali davolanadi."
    },
    {
      "id": 558,
      "input": "Yengil kontuziya (mushak urishlari) uchun qanday yordam ko'rsatish mumkin?",
      "output": "Yengil kontuziya uchun muzli kompress, dam olish va yengil massaj yordam beradi."
    },
    {
      "id": 559,
      "input": "Qon guruhining turlari va uning ahamiyati nima?",
      "output": "Qon guruhlari A, B, AB va O turlariga bo'linadi, har biri turli immunitet tizimi va qon quyish uchun muhimdir."
    },
    {
      "id": 560,
      "input": "Tizdagi yallig'lanish va og'riqlarni qanday kamaytirish mumkin?",
      "output": "Tizdagi yallig'lanishni kamaytirish uchun antiinflamatuar dorilar, sovuq kompresslar va yengil mashqlar yordam beradi."
    },
    {
      "id": 561,
      "input": "Qon quyishning muhimligi va xavfsizligi qanday ta'minlanadi?",
      "output": "Qon quyish jarayonida bemorning qon guruhiga mos ravishda va gigiena qoidalariga rioya qilgan holda amalga oshirilishi kerak."
    },
    {
      "id": 562,
      "input": "Bolalarda oqsil yetishmovchiligi qanday aniqlanadi?",
      "output": "Bolalarda oqsil yetishmovchiligi tana og'irligining kamayishi, zaiflik va immun tizimi pasayishi bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 563,
      "input": "Uzoq muddatli stressning aqliy salomatlikka ta'siri qanday?",
      "output": "Uzoq muddatli stress anksiyete, depressiya va yodlash qobiliyatining pasayishiga olib kelishi mumkin."
    },
    {
      "id": 564,
      "input": "Muntazam ravishda yurishning sog'liq uchun foydalari qanday?",
      "output": "Muntazam yurish yurak salomatligini yaxshilaydi, stressni kamaytiradi va suyaklarni mustahkamlaydi."
    },
    {
      "id": 565,
      "input": "Hipertoniya kasalligini qanday aniqlash mumkin?",
      "output": "Hipertoniya qon bosimini o'lchash orqali aniqlanadi, yuqori qon bosimi ko'plab simptomlar bermaydi."
    },
    {
      "id": 566,
      "input": "Eng yaxshi uyqu tartibi qanday bo'lishi kerak?",
      "output": "Eng yaxshi uyqu tartibi har kuni bir vaqtning o'zida yotish va uyg'onish, 7-9 soat uyquni ta'minlashdir."
    },
    {
      "id": 567,
      "input": "Teri qarishini qanday sekinlashtirish mumkin?",
      "output": "Teri qarishini sekinlashtirish uchun yuzga krem va niqoblar, SPF krem va zararsiz oziq-ovqatlar iste'mol qilish zarur."
    },
    {
      "id": 568,
      "input": "Tibbiy tekshiruvni necha yil davomida o'tkazish kerak?",
      "output": "Yoshingizga qarab, tibbiy tekshiruvni har 1-2 yilda bir marta o'tkazish kerak."
    },
    {
      "id": 569,
      "input": "O'pkada o'sma bo'lsa, qanday simptomlar kuzatiladi?",
      "output": "O'pkada o'sma ko'pincha doimiy yo'tal, nafas qisish, va qonni ko'rish bilan namoyon bo'ladi."
    },
    {
      "id": 570,
      "input": "Badan haroratini qanday normallashtirish mumkin?",
      "output": "Badan haroratini normallashtirish uchun ko'p suyuqlik ichish, salqin muhitda bo'lish va yengil kiyim kiyish kerak."
    },
    {
      "id": 571,
      "input": "Qon shakarini qanday nazorat qilish mumkin?",
      "output": "Qon shakarini nazorat qilish uchun to'g'ri ovqatlanish, jismoniy faollik va zarur bo'lsa, dori vositalarini qabul qilish kerak."
    },
    {
      "id": 572,
      "input": "Qarish belgilari qanday kechadi?",
      "output": "Qarish belgilari orasida teri ajinlari, sochning oqarishi, va mushak kuchining pasayishi mavjud."
    },
    {
      "id": 573,
      "input": "To'g'ri ovqatlanish qanday sog'liqni saqlashga yordam beradi?",
      "output": "To'g'ri ovqatlanish yurak va qon tomirlarini himoya qiladi, immunitetni mustahkamlaydi va vaznni nazorat qiladi."
    },
    {
      "id": 574,
      "input": "Qandli diabetni qanday davolash mumkin?",
      "output": "Qandli diabetni davolash uchun qon shakarini nazorat qilish, to'g'ri ovqatlanish va dori vositalarini ishlatish zarur."
    },
    {
      "id": 575,
      "input": "Baxtsizlik va depressiya o'rtasidagi farq nima?",
      "output": "Baxtsizlik vaqtincha bo'lishi mumkin, depressiya esa uzoq davom etuvchi ruhiy holatdir."
    },
    {
      "id": 576,
      "input": "Neftli dorilarni qanday saqlash kerak?",
      "output": "Neftli dorilarni to'g'ri saqlash uchun quruq joyda, bevosita quyosh nuri tushmaydigan joyda saqlash kerak."
    },
    {
      "id": 577,
      "input": "Vitamin D yetishmovchiligi qanday belgilarga ega?",
      "output": "Vitamin D yetishmovchiligi suyak og'rig'i, charchoq va immun tizimining zaiflashishi bilan namoyon bo'ladi."
    },
    {
      "id": 578,
      "input": "O'pka shishini qanday davolash mumkin?",
      "output": "O'pka shishini davolash uchun diuretiklar, kislorod terapiyasi va antiseptik dori vositalari ishlatiladi."
    },
    {
      "id": 579,
      "input": "Avitaminozning asosiy belgilari qanday?",
      "output": "Avitaminoz charchoq, teri qurishi, va immunitetning zaiflashishi kabi belgilar bilan namoyon bo'ladi."
    },
    {
      "id": 580,
      "input": "Kichik yoshdagi bolalarda qichishishning sabablari nima?",
      "output": "Qichishish allergiyalar, teri kasalliklari yoki parazitlar sababli bo'lishi mumkin."
    },
    {
      "id": 581,
      "input": "Teri kasalliklarini oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Teri kasalliklarini oldini olish uchun gigiena qoidalariga rioya qilish va zararsiz kosmetika vositalaridan foydalanish zarur."
    },
    {
      "id": 582,
      "input": "Uyqu buzilishining asosiy sabablari nima?",
      "output": "Uyqu buzilishi stress, yomon ovqatlanish, gormonal o'zgarishlar yoki uyqu muhitining noqulayligi sababli yuzaga keladi."
    },
    {
      "id": 583,
      "input": "Suv ichishning sog'liqdagi o'rni qanday?",
      "output": "Suv ichish tananing barcha funktsiyalarini qo'llab-quvvatlaydi, toksinlarni chiqaradi va umumiy sog'liqni yaxshilaydi."
    },
    {
      "id": 584,
      "input": "Tish va og'iz bo'shlig'ida yallig'lanish sabablarini qanday aniqlash mumkin?",
      "output": "Tish va og'iz bo'shlig'ida yallig'lanish bakterial infektsiyalar yoki yomon og'iz gigienasidan kelib chiqadi."
    },
    {
      "id": 585,
      "input": "Yallig'lanish va infeksiyaning farqi nima?",
      "output": "Yallig'lanish organizmning himoya reaksiyasi bo'lsa, infeksiya zararlangan mikroblar tufayli yuzaga keladi."
    },
    {
      "id": 586,
      "input": "Yurak xastaligi xavfini kamaytirish uchun qanday chora-tadbirlar ko'rish kerak?",
      "output": "Yurak xastaligini oldini olish uchun sog'lom ovqatlanish, jismoniy faollik, stressni kamaytirish va sigaret chekishni tark etish zarur."
    },
    {
      "id": 587,
      "input": "Ko'z va teri allergiyalarini qanday farqlash mumkin?",
      "output": "Ko'z allergiyasi ko'z qizarishi, yallig'lanish va ko'rishning xiralashishi bilan namoyon bo'ladi, teri allergiyasi esa qichishish va toshmalar bilan."
    },
    {
      "id": 588,
      "input": "O'pkadagi infeksiyani qanday aniqlash mumkin?",
      "output": "O'pkadagi infeksiya simptomlari orasida yuqori isitma, yo'tal, nafas qisish va ko'krakdagi og'riq mavjud."
    },
    {
      "id": 589,
      "input": "Qon ketishini qanday to'xtatish mumkin?",
      "output": "Qon ketishini to'xtatish uchun zararlangan joyni siqish, yuqori holatga ko'tarish va zarur bo'lsa, tez yordam chaqirish kerak."
    },
    {
      "id": 590,
      "input": "Ishdagi stressni qanday boshqarish mumkin?",
      "output": "Ishdagi stressni boshqarish uchun vaqtni samarali rejalashtirish, dam olish va psixologik yordamga murojaat qilish zarur."
    },
    {
      "id": 591,
      "input": "Suvli va shirasiz kasalliklarni qanday farqlash mumkin?",
      "output": "Suvli kasalliklar yuqumli va organizmda suyuqlikni yo'qotishga olib keladi, shirasiz kasalliklar esa ayniqsa ichak tizimida yuzaga keladi."
    },
    {
      "id": 592,
      "input": "Gripp va sovuqni qanday farqlash mumkin?",
      "output": "Gripp odatda yuqori isitma, mushak og'rig'i va kuchli charchoq bilan boshlanadi, sovuq esa engil burun oqishi va yo'taldan boshlanadi."
    },
    {
      "id": 593,
      "input": "Yodning tanadagi o'rni qanday?",
      "output": "Yod qalqonsimon bezning normal ishlashini ta'minlash uchun zarur bo'lib, gormonlar ishlab chiqarishga yordam beradi."
    },
    {
      "id": 594,
      "input": "Teri kasalliklarining umumiy sabablari qanday?",
      "output": "Teri kasalliklari allergiya, infektsiya, yomon ovqatlanish va stress natijasida yuzaga kelishi mumkin."
    },
    {
      "id": 595,
      "input": "Uyqusizlikka qarshi qanday tabiiy usullar mavjud?",
      "output": "Chamomile choyi, lavanda aromaterapiyasi va muntazam jismoniy mashqlar uyqusizlikni yengishga yordam beradi."
    },
    {
      "id": 596,
      "input": "Yallig'lanishning organizmdagi roli nima?",
      "output": "Yallig'lanish organizmning himoya javobi bo'lib, infektsiya va shikastlanishga qarshi kurashadi."
    },
    {
      "id": 597,
      "input": "Kardiovaskulyar kasalliklardan qanday himoyalanish mumkin?",
      "output": "Sog'lom ovqatlanish, muntazam jismoniy faollik va stressni boshqarish kardiovaskulyar kasalliklardan himoya qiladi."
    },
    {
      "id": 598,
      "input": "Bosh og'rig'ini qanday kamaytirish mumkin?",
      "output": "Bosh og'rig'ini kamaytirish uchun og'riqqa qarshi dorilar, qoralama va toza havo olish yordam beradi."
    },
    {
      "id": 599,
      "input": "Tishdagi kasalliklarni oldini olish uchun nima qilish kerak?",
      "output": "Tishlarni tozalash, yomon ovqatlanishdan qochish va muntazam stomatologga murojaat qilish kerak."
    },
    {
      "id": 600,
      "input": "Ortiqcha vaznni qanday kamaytirish mumkin?",
      "output": "Ortiqcha vaznni kamaytirish uchun kaloriyalarni kamaytirish, jismoniy mashqlarni bajarish va balansli ovqatlanish zarur."
    },
    {
      "id": 601,
      "input": "Qon bosimi yuqoriligi qanday xavf yaratadi?",
      "output": "Yuqori qon bosimi yurak xastaligi, insult va buyrak kasalliklari kabi jiddiy xavf-xatarlarga olib kelishi mumkin."
    },
    {
      "id": 602,
      "input": "Yuz terisida akne paydo bo'lsa, qanday davolash kerak?",
      "output": "Akne uchun tozalovchi mahsulotlar, antibiotiklar yoki retinoidlar ishlatiladi."
    },
    {
      "id": 603,
      "input": "Psoriaz kasalligi nima?",
      "output": "Psoriaz — teridagi qizil, quruq va teri qo'ziqorinlariga o'xshash toshmalar bilan namoyon bo'ladigan surunkali kasallikdir."
    },
    {
      "id": 604,
      "input": "Spinal disklarni qanday saqlash kerak?",
      "output": "Spinal disklarni saqlash uchun to'g'ri o'rindiqlarda o'tirish, ortiqcha yukdan qochish va muntazam mashqlar bajarish zarur."
    },
    {
      "id": 605,
      "input": "Homiladorlikda qandli diabet qanday ta'sir qiladi?",
      "output": "Homiladorlikda qandli diabet ona va bola uchun xavf tug'diradi, o'zgargan gormonlar qon shakarini boshqarishni qiyinlashtiradi."
    },
    {
      "id": 606,
      "input": "Ko'zda qizarish va qichishishning sabablari qanday?",
      "output": "Ko'zdagi qizarish va qichishish allergiya, qurish yoki infektsiya tufayli yuzaga kelishi mumkin."
    },
    {
      "id": 607,
      "input": "Baxtsiz hodisalardan keyin qancha vaqt davomida dori vositalari ishlatish kerak?",
      "output": "Baxtsiz hodisalardan keyin dori vositalarini shifokor ko'rsatmasiga ko'ra, bir necha kun yoki haftalar davomida ishlatish mumkin."
    },
    {
      "id": 608,
      "input": "Suyaklarning mustahkamligini qanday saqlash mumkin?",
      "output": "Suyaklarni mustahkamlash uchun kaltsiy, D vitamini va og'irlik ko'tarish mashqlarini bajarish zarur."
    },
    {
      "id": 609,
      "input": "Imunitet tizimi qanday ishlaydi?",
      "output": "Imunitet tizimi organizmni zararlangan bakteriyalar, viruslar va boshqa begona moddalar bilan kurashishda himoya qiladi."
    },
    {
      "id": 610,
      "input": "Qon donorlari qanday shartlarga javob berishi kerak?",
      "output": "Qon donorlari sog'lom bo'lishi, 18-65 yoshda bo'lishi va qon donate qilishdan oldin tibbiy tekshiruvdan o'tishi kerak."
    },
    {
      "id": 611,
      "input": "Allergiya nima va qanday davolanadi?",
      "output": "Allergiya — organizmning zararli moddalarni normal deb bilib hujum qilishi, antihistaminlar va allergiya bilan kurashadigan dorilar yordamida davolanadi."
    },
    {
      "id": 612,
      "input": "Erkaklar uchun prostata sog'lig'ini qanday saqlash mumkin?",
      "output": "Prostata sog'lig'ini saqlash uchun muntazam tekshiruvlar, sog'lom turmush tarzi va harakat qilish zarur."
    },
    {
      "id": 613,
      "input": "O'zgarishlar va stressni qanday boshqarish mumkin?",
      "output": "O'zgarishlarni qabul qilish, meditasiya qilish, tabiatda vaqt o'tkazish va vaqtni boshqarish stressni yengishga yordam beradi."
    },
    {
      "id": 614,
      "input": "Organizmni tozalash qanday amalga oshiriladi?",
      "output": "Organizmdan toksinlarni chiqarish uchun suv ichish, to'g'ri ovqatlanish va jismoniy mashqlar qilish zarur."
    },
    {
      "id": 615,
      "input": "Sog'liqni saqlashda psikoterapiya qanday rol o'ynaydi?",
      "output": "Psikoterapiya odamlarning ruhiy salomatligini yaxshilash, stressni kamaytirish va emotsional muammolarni hal qilishda muhim rol o'ynaydi."
    },
    {
      "id": 616,
      "input": "Jigar kasalliklarini oldini olish uchun nima qilish kerak?",
      "output": "Jigar kasalliklarini oldini olish uchun alkogoldan saqlanish, sog'lom ovqatlanish va muntazam jismoniy faollik zarur."
    },
    {
      "id": 617,
      "input": "Imunitet tizimini kuchaytirish uchun qanday oziq-ovqatlar foydalidir?",
      "output": "Imunitet tizimini kuchaytirish uchun S vitamini, zinc, probiyotiklar va omega-3 yog' kislotalariga boy oziq-ovqatlar iste'mol qilish zarur."
    },
    {
      "id": 618,
      "input": "Qon tomirlarining mustahkamligini qanday saqlash mumkin?",
      "output": "Qon tomirlarini mustahkamlash uchun balansli ovqatlanish, muntazam mashqlar va ortiqcha tuzdan saqlanish zarur."
    },
    {
      "id": 619,
      "input": "To'rtlamchi (IV) nevrologik kasalliklar nima?",
      "output": "To'rtlamchi nevrologik kasalliklar markaziy asab tizimining jiddiy kasalliklaridan bo'lib, asosan miya va orqa miya bilan bog'liq bo'ladi."
    },
    {
      "id": 620,
      "input": "Yuzni qanday to'g'ri parvarish qilish kerak?",
      "output": "Yuzni tozalash, tonik ishlatish, yuz uchun mos niqoblar va SPF krem yordamida himoya qilish kerak."
    },
    {
      "id": 621,
      "input": "Homiladorlikning ilk belgilarini qanday aniqlash mumkin?",
      "output": "Homiladorlikning ilk belgilariga kechikkan hayz, ko'ngil aynishi, sezgirlik va ko'krak og'rig'i kiradi."
    },
    {
      "id": 622,
      "input": "Fizioterapiya qanday yordam beradi?",
      "output": "Fizioterapiya jismoniy faoliyatni yaxshilash, mushaklar va bo'g'imlarni tiklash va og'riqni kamaytirishga yordam beradi."
    },
    {
      "id": 623,
      "input": "Stressning jismoniy sog'liqdagi ta'siri qanday?",
      "output": "Stress organizmda gormonlarni o'zgartiradi, yurak-qon tomir tizimi, immun tizimiga salbiy ta'sir ko'rsatadi."
    },
    {
      "id": 624,
      "input": "Badanni sog'lom tutish uchun qanday mashqlar bajarish kerak?",
      "output": "Badanni sog'lom tutish uchun yurish, yugurish, suzish va og'irlik ko'tarish kabi mashqlar tavsiya etiladi."
    },
    {
      "id": 625,
      "input": "Qon ketishini to'xtatish uchun qanday usullar ishlatiladi?",
      "output": "Qon ketishini to'xtatish uchun siqish, bandajlash va zarur bo'lsa, tez yordam chaqirish kerak."
    },
    {
      "id": 626,
      "input": "Yurak xastaligidan saqlanish uchun qanday choralar ko'rish kerak?",
      "output": "Yurak xastaligidan saqlanish uchun muvozanatli ovqatlanish, sigaretsiz turmush tarzi va muntazam mashqlar qilish zarur."
    },
    {
      "id": 627,
      "input": "Sog'liqni saqlashda psixologik yordamning o'rni nima?",
      "output": "Psixologik yordam ruhiy salomatlikni yaxshilash, stressni kamaytirish va emotsional muammolarni hal qilishda muhimdir."
    },
    {
      "id": 628,
      "input": "Yoqilg'i va kimyoviy moddalarning sog'liqka ta'siri qanday?",
      "output": "Yoqilg'i va kimyoviy moddalar uzoq muddatli ta'sirida respirator va nerv tizimi kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 629,
      "input": "Homiladorlik davrida qanday ovqatlar yaramaydi?",
      "output": "Homiladorlikda alkogol, xom go'sht va past pishirilgan tuxumdan saqlanish kerak."
    },
    {
      "id": 630,
      "input": "Gormonal muvozanatsizlik nima va qanday belgilar ko'rsatiladi?",
      "output": "Gormonal muvozanatsizlik asosan ayollarda xususiy belgilar bilan namoyon bo'ladi, jumladan, hayz tsiklida o'zgarishlar va teri muammolari."
    },
    {
      "id": 631,
      "input": "Qon tomirlaridagi tromblar qanday aniqlanadi?",
      "output": "Qon tomirlaridagi tromblar ultratovush tekshiruvi yoki qon tahlili orqali aniqlanishi mumkin."
    },
    {
      "id": 632,
      "input": "Sog'lom va yomon xolesterin orasidagi farq nima?",
      "output": "Sog'lom xolesterin (HDL) qon tomirlarini himoya qilsa, yomon xolesterin (LDL) arteriyalarda yig'ilib, yurak kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 633,
      "input": "O'pkadagi infeksiyaning asosiy sabablari nima?",
      "output": "O'pkadagi infeksiya bakteriya, virus yoki gripp viruslari sabab bo'lishi mumkin."
    },
    {
      "id": 634,
      "input": "Ortiqcha tuz iste'mol qilishning ta'siri qanday?",
      "output": "Ortiqcha tuz iste'mol qilish qon bosimini oshirishi va yurak-qon tomir tizimini yomonlashtirishi mumkin."
    },
    {
      "id": 635,
      "input": "Tabiiy dori vositalari qanday xavflarni keltirib chiqarishi mumkin?",
      "output": "Tabiiy dori vositalari allergiya, nojo'ya ta'sirlar yoki boshqa dorilar bilan o'zaro ta'sirlar keltirib chiqarishi mumkin."
    },
    {
      "id": 636,
      "input": "Quyoshdan qanday himoya qilish kerak?",
      "output": "Quyoshdan himoya qilish uchun SPF krem ishlatish, uzoq vaqt quyoshda qolmaslik va himoya kiyimlaridan foydalanish kerak."
    },
    {
      "id": 637,
      "input": "O'zgaruvchan kayfiyatning sabablari nimalardan iborat?",
      "output": "O'zgaruvchan kayfiyat stress, gormonal o'zgarishlar, ruhiy holat yoki uyqu yetishmasligidan kelib chiqadi."
    },
    {
      "id": 638,
      "input": "Qarish jarayonini qanday sekinlashtirish mumkin?",
      "output": "Qarish jarayonini sekinlashtirish uchun sog'lom ovqatlanish, jismoniy faollik va stressni boshqarish muhimdir."
    },
    {
      "id": 639,
      "input": "Qon donorlari uchun qanday sog'liq tekshiruvlari kerak?",
      "output": "Qon donorlari qon gruxi, gemoglobinning miqdori va umumiy sog'lik holatini tekshirishdan o'tishi kerak."
    },
    {
      "id": 640,
      "input": "Neyrodegenerativ kasalliklar nima?",
      "output": "Neyrodegenerativ kasalliklar miya hujayralarining shikastlanishi va o'limi bilan bog'liq kasalliklar, masalan, Altsgeymer va Parkinson kasalliklari."
    },
    {
      "id": 641,
      "input": "Immunitetni mustahkamlash uchun qanday vitaminlar foydalidir?",
      "output": "C vitamini, D vitamini, B6 va B12 vitaminlari immunitetni kuchaytirishga yordam beradi."
    },
    {
      "id": 642,
      "input": "Endokrin tizimi qanday ishlaydi?",
      "output": "Endokrin tizimi organizmda gormonlarni ishlab chiqarish va ularni taqsimlash orqali tana funksiyalarini tartibga soladi."
    },
    {
      "id": 643,
      "input": "Yuqumli kasalliklarni qanday oldini olish mumkin?",
      "output": "Yuqumli kasalliklarni oldini olish uchun gigiena qoidalariga rioya qilish, vaksinatsiya qilish va toza suvdan foydalanish zarur."
    },
    {
      "id": 644,
      "input": "To'g'ri ovqatlanishning umumiysi nima?",
      "output": "To'g'ri ovqatlanish muvozanatli va turli xil oziq-ovqatlarni o'z ichiga olgan, barcha vitaminlar va minerallarni ta'minlaydigan rejadir."
    },
    {
      "id": 645,
      "input": "Depressiyani qanday davolash mumkin?",
      "output": "Depressiyani davolash uchun psixoterapiya, dori-darmonlar va sog'lom turmush tarzi zarur."
    },
    {
      "id": 646,
      "input": "Nefrologiya sohasida qanday kasalliklar mavjud?",
      "output": "Nefrologiya buyraklar bilan bog'liq kasalliklarni o'rganadi, jumladan, buyrak etishmovchiligi, nefrit va toshlar."
    },
    {
      "id": 647,
      "input": "Qandli diabetni oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "Qandli diabetni oldini olish uchun sog'lom turmush tarzi, muntazam jismoniy faollik va o'z vaqtida tibbiy tekshiruvlar zarur."
    },
    {
      "id": 648,
      "input": "Odamni semirishga olib keladigan omillar qanday?",
      "output": "Semirishning asosiy omillari yomon ovqatlanish, jismoniy faollikning kamligi, genetik omillar va stressdir."
    },
    {
      "id": 649,
      "input": "Spirtli ichimliklarning salomatlikka ta'siri qanday?",
      "output": "Spirtli ichimliklar qon bosimini oshirishi, jigarda shikastlanishga olib kelishi va yurak-qon tomir tizimiga zarar yetkazishi mumkin."
    },
    {
      "id": 650,
      "input": "Ayollarda menopauza davrining belgilarini qanday aniqlash mumkin?",
      "output": "Menopauza belgilari issiqlik toshqinlari, hayz tsiklida o'zgarishlar va uyqusizlik kabi holatlar bilan namoyon bo'ladi."
    },
    {
      "id": 651,
      "input": "Orqa miya og'rig'ini qanday kamaytirish mumkin?",
      "output": "Orqa miya og'rig'ini kamaytirish uchun muntazam jismoniy faollik, to'g'ri o'rindiqlarda o'tirish va massajdan foydalanish kerak."
    },
    {
      "id": 652,
      "input": "Gormonlarni muvozanatlash qanday amalga oshiriladi?",
      "output": "Gormonlarni muvozanatlash uchun sog'lom ovqatlanish, muntazam jismoniy faollik va zarur bo'lsa, gormonlarni boshqaruvchi dori vositalarini qabul qilish zarur."
    },
    {
      "id": 653,
      "input": "Mikrobiota va uning sog'liq uchun ahamiyati qanday?",
      "output": "Mikrobiota ichakda mavjud bakteriyalar yig'indisidir va u immunitetni kuchaytiradi, hazmni yaxshilaydi va ruhiy salomatlikni qo'llab-quvvatlaydi."
    },
    {
      "id": 654,
      "input": "Yallig'lanishni kamaytirish uchun qanday oziq-ovqatlar foydalidir?",
      "output": "Yallig'lanishni kamaytirish uchun omega-3 yog' kislotalari, antoksidantlarga boy meva va sabzavotlar iste'mol qilish zarur."
    },
    {
      "id": 655,
      "input": "O'tkir respirator infeksiyalar qanday davolanadi?",
      "output": "O'tkir respirator infeksiyalarni davolash uchun antibiotiklar, antiviral dorilar, dam olish va ko'p suyuqlik ichish zarur."
    },
    {
      "id": 656,
      "input": "Baxtli turmush tarzini qanday yaratish mumkin?",
      "output": "Baxtli turmush tarzi uchun ruhiy salomatlikni qo'llab-quvvatlash, faol hayot tarzini tutish va ijobiy o'zgarishlarga ochiq bo'lish zarur."
    },
    {
      "id": 657,
      "input": "Uxlab qolishning eng yaxshi usullari nimalar?",
      "output": "Eng yaxshi uxlab qolish usullari — yengil ovqat, aromaterapiya, quyosh nurlaridan saqlanish va uyqu uchun toza muhit yaratishdir."
    },
    {
      "id": 658,
      "input": "Tabiiy dori vositalari yordamida sog'liqni yaxshilash mumkinmi?",
      "output": "Tabiiy dori vositalari, masalan, zanjabil, murch va sarimsoq, immunitetni oshirish va yallig'lanishni kamaytirish uchun foydalidir."
    },
    {
      "id": 659,
      "input": "Kamqonlikning belgilari qanday?",
      "output": "Kamqonlikning belgilari orasida charchoq, bosh aylanishi, terlash va terining oqarishi mavjud."
    },
    {
      "id": 660,
      "input": "Diabetni qanday aniqlash mumkin?",
      "output": "Diabet qon shakarining yuqori darajasini aniqlash uchun qon tahlili orqali aniqlanadi."
    },
    {
      "id": 661,
      "input": "Stressni qanday kamaytirish mumkin?",
      "output": "Stressni kamaytirish uchun meditatsiya, nafas olish mashqlari, sport va tabiatda vaqt o'tkazish foydalidir."
    },
    {
      "id": 662,
      "input": "Yangi tug'ilgan chaqaloqni qanday parvarish qilish kerak?",
      "output": "Yangi tug'ilgan chaqaloqqa toza va quruq joyda yotqizish, onaning sutini berish va muntazam ravishda gigiena saqlash kerak."
    },
    {
      "id": 663,
      "input": "Xolesterin miqdorini qanday nazorat qilish mumkin?",
      "output": "Xolesterin miqdorini nazorat qilish uchun sog'lom ovqatlanish, sport va, kerak bo'lsa, dori vositalarini qabul qilish zarur."
    },
    {
      "id": 664,
      "input": "Suyaklarni qanday mustahkamlash mumkin?",
      "output": "Suyaklarni mustahkamlash uchun kaltsiy va D vitamini boy ovqatlar, shuningdek, og'irlik ko'tarish mashqlari tavsiya etiladi."
    },
    {
      "id": 665,
      "input": "Allergiya va uning davolash usullari qanday?",
      "output": "Allergiya antihistaminlar, kortikosteroidlar va allergik reaktsiyalarni oldini olish uchun allergik omillardan qochish bilan davolanadi."
    },
    {
      "id": 666,
      "input": "Akne bilan qanday kurashish mumkin?",
      "output": "Akne bilan kurashish uchun to'g'ri teri parvarishi, antiseptiklar va zarur bo'lsa, dermatolog tomonidan yozilgan dorilar kerak."
    },
    {
      "id": 667,
      "input": "Homiladorlikda to'g'ri ovqatlanishning ahamiyati nima?",
      "output": "Homiladorlikda to'g'ri ovqatlanish bola va ona uchun zarur vitaminlar va minerallarni ta'minlashga yordam beradi."
    },
    {
      "id": 668,
      "input": "Ko'zlarni qanday parvarish qilish kerak?",
      "output": "Ko'zlarni parvarish qilish uchun uyquda dam olish, ko'zni yorug'likdan himoya qilish va muntazam ravishda ko'zlarni tekshirish zarur."
    },
    {
      "id": 669,
      "input": "Yengil sport turlari qaysilar?",
      "output": "Yengil sport turlari orasida yurish, suzish, velosipedda haydash va yoga kiradi."
    },
    {
      "id": 670,
      "input": "Jismoniy faollikni qanday oshirish mumkin?",
      "output": "Jismoniy faollikni oshirish uchun har kunlik mashqlarni qilish, mashq qilishni zavqli qilish va maqsadlarni qo'yish kerak."
    },
    {
      "id": 671,
      "input": "Tishlarni qanday to'g'ri tozalash kerak?",
      "output": "Tishlarni tozalash uchun tish pastasini qo'llash, 2-3 daqiqa davomida tishlarni tozalash va tish ipidan foydalanish zarur."
    },
    {
      "id": 672,
      "input": "Ortiqcha vaznni qanday samarali kamaytirish mumkin?",
      "output": "Ortiqcha vaznni kamaytirish uchun balansli ovqatlanish, jismoniy mashqlar va muntazam ravishda suyuqlik ichish kerak."
    },
    {
      "id": 673,
      "input": "O'pka kasalliklarini qanday oldini olish mumkin?",
      "output": "O'pka kasalliklarini oldini olish uchun sigaret chekishdan saqlanish, toza havo va sog'lom ovqatlanish zarur."
    },
    {
      "id": 674,
      "input": "Ruhiy salomatlikni qanday saqlash mumkin?",
      "output": "Ruhiy salomatlikni saqlash uchun stressni boshqarish, ijobiy fikrlash va do'stlar bilan vaqt o'tkazish muhimdir."
    },
    {
      "id": 675,
      "input": "O'pka saratoni qanday aniqlanadi?",
      "output": "O'pka saratonini aniqlash uchun kompyuter tomografiya (KT), rentgen va biopsiya yordamida tashxis qo'yiladi."
    },
    {
      "id": 676,
      "input": "Yurak salomatligini qanday yaxshilash mumkin?",
      "output": "Yurak salomatligini yaxshilash uchun yog'siz ovqatlanish, muntazam mashqlar, chekishdan saqlanish va stressni boshqarish zarur."
    },
    {
      "id": 677,
      "input": "Gormonal muvozanatsizlikning belgilari nimalardan iborat?",
      "output": "Gormonal muvozanatsizlik belgilari orasida kayfiyatning o'zgarishi, uyqu buzilishlari va vaznning o'zgarishi mavjud."
    },
    {
      "id": 678,
      "input": "Qonning kislorod tashish xususiyati qanday?",
      "output": "Qonning kislorod tashish xususiyati gemoglobin bilan bog'liq bo'lib, u o'pkadan kislorodni tananing barcha qismlariga olib boradi."
    },
    {
      "id": 679,
      "input": "Spirtli ichimliklarni iste'mol qilishning sog'liqka ta'siri qanday?",
      "output": "Spirtli ichimliklar yurak-qon tomir tizimi, jigar va asab tizimi uchun zararli bo'lishi mumkin."
    },
    {
      "id": 680,
      "input": "Qandli diabetni qanday nazorat qilish mumkin?",
      "output": "Qandli diabetni nazorat qilish uchun qon shakarini doimiy ravishda tekshirish, dorilarni qabul qilish va sog'lom turmush tarzini saqlash zarur."
    },
    {
      "id": 681,
      "input": "Uxlashdan oldin qanday rasmiy rituals qilish kerak?",
      "output": "Uxlashdan oldin kitob o'qish, iliq suv ichish, telefonni o'chirish va toza va sokin muhitda dam olish muhimdir."
    },
    {
      "id": 682,
      "input": "Xavfli oziq-ovqatlarni qanday tanlash kerak?",
      "output": "Xavfli oziq-ovqatlardan saqlanish uchun shubhali va yaroqsiz mahsulotlardan foydalanmaslik, sanoatdagi etiketkalarni tekshirish kerak."
    },
    {
      "id": 683,
      "input": "Avitaminozning belgilari qanday?",
      "output": "Avitaminoz belgilariga charchoq, terining qurishi, soch to'kilishi va immunitetni susayishi kiradi."
    },
    {
      "id": 684,
      "input": "Ortiqcha suyuqlikni qanday olib tashlash mumkin?",
      "output": "Ortiqcha suyuqlikni tashlash uchun diuretiklar, tuz miqdorini kamaytirish va ko'proq suv ichish zarur."
    },
    {
      "id": 685,
      "input": "Semizlik va yomon ovqatlanishning sog'liqka ta'siri qanday?",
      "output": "Semizlik va yomon ovqatlanish yurak kasalliklari, diabet va boshqa surunkali kasalliklarga olib kelishi mumkin."
    },
    {
      "id": 686,
      "input": "Shikastlanishdan keyin tiklanish jarayonini qanday tezlashtirish mumkin?",
      "output": "Shikastlanishdan keyin tiklanish uchun fizioterapiya, dam olish, to'g'ri ovqatlanish va zarur bo'lsa, dori vositalaridan foydalanish kerak."
    },
    {
      "id": 687,
      "input": "Ijtimoiy tarmoqlardan uzoq vaqt foydalanishning salbiy ta'siri qanday?",
      "output": "Ijtimoiy tarmoqlardan uzoq vaqt foydalanish uyqu buzilishi, depressiya va stressni kuchaytirishi mumkin."
    },
    {
      "id": 688,
      "input": "Gigiya va toza suvni qanday saqlash mumkin?",
      "output": "Gigiya va toza suvni saqlash uchun muntazam ravishda suvni filtrdan o'tkazish, toza va xavfsiz idishlarda saqlash kerak."
    },
    {
      "id": 689,
      "input": "Xolesterin darajasini qanday kamaytirish mumkin?",
      "output": "Xolesterin darajasini kamaytirish uchun yog'siz ovqatlanish, yengil mashqlar va kerakli dorilarni qabul qilish zarur."
    },
    {
      "id": 690,
      "input": "O'pka kasalliklarini qanday aniqlash mumkin?",
      "output": "O'pka kasalliklarini aniqlash uchun rentgen, tomografiya va nafas olish testlari yordamida tashxis qo'yiladi."
    },
    {
      "id": 691,
      "input": "Terining sog'ligini qanday yaxshilash mumkin?",
      "output": "Terining sog'ligini yaxshilash uchun toza suv ichish, to'g'ri teri parvarishi va quyoshdan himoya qilish zarur."
    },
    {
      "id": 692,
      "input": "Tibbiy tekshiruvlarni qachon o'tkazish kerak?",
      "output": "Tibbiy tekshiruvlarni har yili amalga oshirish, yoshi, oilaviy tarixga va kasallik xavfini hisobga olib, zarur."
    },
    {
      "id": 693,
      "input": "To'g'ri uyqu rejimi qanday bo'lishi kerak?",
      "output": "To'g'ri uyqu rejimi uchun har kecha kamida 7-8 soat uyqu va muntazam uyqu vaqti muhimdir."
    },
    {
      "id": 694,
      "input": "O'pka saratonining asosiy belgilari qanday?",
      "output": "O'pka saratonining asosiy belgilariga yo'tal, nafas qisishi va ko'krak qafasida og'riq kiradi."
    },
    {
      "id": 695,
      "input": "Uyquni yaxshilash uchun qanday maslahatlar mavjud?",
      "output": "Uyquni yaxshilash uchun tinch muhitda uxlab qolish, har kuni bir vaqtda yotish va elektr qurilmalardan saqlanish tavsiya etiladi."
    },
    {
      "id": 696,
      "input": "Yangi tug'ilgan chaqaloqqa qanday g'amxo'rlik qilish kerak?",
      "output": "Yangi tug'ilgan chaqaloqqa yaxshi gigiena, onaning suti, yengil va qulay kiyimlar va doimiy kuzatuv kerak."
    },
    {
      "id": 697,
      "input": "Astmani qanday davolash mumkin?",
      "output": "Astmani davolash uchun inhalyatorlar, allergiya dorilari va nafas olish mashqlaridan foydalanish kerak."
    },
    {
      "id": 698,
      "input": "Qon bosimi yuqori bo'lsa, nima qilish kerak?",
      "output": "Qon bosimi yuqori bo'lsa, yuqori tuzli oziq-ovqatlardan saqlanish, jismoniy faoliyatni oshirish va dori vositalarini qabul qilish zarur."
    },
    {
      "id": 699,
      "input": "Yurak xuruji belgilari qanday bo'ladi?",
      "output": "Yurak xuruji belgilari orasida ko'krak qafasida og'riq, nafas qisishi, terlash va bosh aylanishi mavjud."
    },
    {
      "id": 700,
      "input": "Organizmda temir yetishmasligi qanday aniqlanadi?",
      "output": "Temir yetishmasligi qon tahlili yordamida aniqlanadi, bu erda gemoglobinning past darajasi ko'rsatiladi."
    },
    {
      "id": 701,
      "input": "Sog'lom ovqatlanishning tamoyillari nimalardan iborat?",
      "output": "Sog'lom ovqatlanishning tamoyillari balansli va turli xil ovqatlar, ko'p meva va sabzavotlar, yetarli miqdorda suyuqlikni iste'mol qilishni o'z ichiga oladi."
    },
    {
      "id": 702,
      "input": "Sigaret chekishning salomatlikka ta'siri qanday?",
      "output": "Sigaret chekish nafas olish tizimi, yurak va qon tomir tizimi uchun zararli, shuningdek, saraton xavfini oshiradi."
    },
    {
      "id": 703,
      "input": "O'smirlar uchun sog'lom turmush tarzini qanday shakllantirish mumkin?",
      "output": "O'smirlar uchun sog'lom turmush tarzini shakllantirish uchun ularni sport bilan shug'ullanishga undash, o'zgaruvchan gormonal o'zgarishlarga mos ravishda ovqatlanish va stressni boshqarish zarur."
    },
    {
      "id": 704,
      "input": "Asalning sog'liq uchun foydalari qanday?",
      "output": "Asal antibakterial xususiyatlarga ega bo'lib, immunitetni oshirish, og'riqlarni kamaytirish va terini parvarish qilishda yordam beradi."
    },
    {
      "id": 705,
      "input": "Hammasi bir xil bo'lgan vitaminlar nima?",
      "output": "Vitaminlar organizm uchun zarur bo'lgan, ularni turli xil oziq-ovqatlardan olish mumkin, masalan, A, C, D, E vitaminlari."
    },
    {
      "id": 706,
      "input": "Stressni kamaytirish uchun qanday usullar mavjud?",
      "output": "Stressni kamaytirish uchun nafas olish mashqlari, yoga, meditatsiya va faol dam olish muhimdir."
    },
    {
      "id": 707,
      "input": "Ayollarda menopauza belgilari qanday?",
      "output": "Menopauza belgilari orasida issiqlik toshqinlari, uyqusizlik, kayfiyat o'zgarishi va hayz tsiklida o'zgarishlar bor."
    },
    {
      "id": 708,
      "input": "Jigar kasalliklarini qanday oldini olish mumkin?",
      "output": "Jigar kasalliklarini oldini olish uchun alkogolni cheklash, toza suv ichish, sog'lom ovqatlanish va muntazam jismoniy faollik zarur."
    },
    {
      "id": 709,
      "input": "Yangi tug'ilgan chaqaloqda emizishni qanday boshlash kerak?",
      "output": "Yangi tug'ilgan chaqaloqqa onaning sutini muntazam ravishda berish, to'g'ri emizish pozitsiyasini tanlash va chaqaloqni muntazam ravishda emizish kerak."
    },
    {
      "id": 710,
      "input": "Gormonal kasalliklar qanday belgilar bilan boshlanadi?",
      "output": "Gormonal kasalliklar asosan kayfiyat o'zgarishlari, vazn o'zgarishlari, uyqu muammolari va teri holatidagi o'zgarishlar bilan namoyon bo'ladi."
    },
    {
      "id": 711,
      "input": "To'g'ri teri parvarishi qanday amalga oshiriladi?",
      "output": "Teri parvarishida teri turiga mos tozalovchi vositalar, nemlendiruvchi krem va quyoshdan himoya qilish asosiy elementlardir."
    },
    {
      "id": 712,
      "input": "Homiladorlikda chekishning ta'siri qanday?",
      "output": "Homiladorlikda chekish bolaning rivojlanishiga salbiy ta'sir ko'rsatadi, jumladan, kam vaznli tug'ilish va nafas olish tizimi muammolariga olib kelishi mumkin."
    },
    {
      "id": 713,
      "input": "Saraton kasalliklarini qanday oldini olish mumkin?",
      "output": "Saraton kasalliklarini oldini olish uchun to'g'ri ovqatlanish, muntazam jismoniy faollik, sigaretdan saqlanish va ortiqcha og'irlikdan qochish kerak."
    },
    {
      "id": 714,
      "input": "Yo'talni qanday davolash mumkin?",
      "output": "Yo'talni davolash uchun toza havoda bo'lish, ko'p suyuqlik ichish, yaxshilanish uchun dori vositalari va ba'zan mukolitiklar kerak bo'lishi mumkin."
    },
    {
      "id": 715,
      "input": "Ikkinchi turdagi diabetni qanday oldini olish mumkin?",
      "output": "Ikkinchi turdagi diabetni oldini olish uchun sog'lom ovqatlanish, jismoniy faollik va og'irlikni nazorat qilish zarur."
    },
    {
      "id": 716,
      "input": "O'pkada infeksiya bo'lsa, qanday davolash kerak?",
      "output": "O'pkada infeksiya bo'lsa, antibiotiklar yoki antiviral dorilar, nafas olish mashqlari va ko'p suyuqlik ichish kerak."
    },
    {
      "id": 717,
      "input": "Yengil yallig'lanishning belgilari qanday?",
      "output": "Yengil yallig'lanishning belgilariga tanadagi qizarish, shishish, og'riq va haroratning ko'tarilishi kiradi."
    },
    {
      "id": 718,
      "input": "Ayollarda PCOS (polikistik tuxumdon sindromi) qanday davolanadi?",
      "output": "PCOSni davolash uchun gormonlarni muvozanatlash, og'irlikni nazorat qilish va zarur bo'lsa, dorilar yoki insulinga qarshi preparatlar ishlatiladi."
    },
    {
      "id": 719,
      "input": "Uyqu buzilishlari qanday davolanadi?",
      "output": "Uyqu buzilishlarini davolash uchun uyqu gigienasi, stressni kamaytirish va kerak bo'lsa, dorilarni qo'llash zarur."
    },
    {
      "id": 720,
      "input": "O'pkada astma qanday aniqlanadi?",
      "output": "O'pkada astma spirometriya va bronxial provokatsion testlar orqali aniqlanadi."
    },
    {
      "id": 721,
      "input": "Qon donorligi uchun qanday tayyorgarlik ko'rish kerak?",
      "output": "Qon donorligi uchun yengil nonushta qilish, yaxshi dam olish va qon olishdan oldin suyuqlik ichish kerak."
    },
    {
      "id": 722,
      "input": "Uyquning salomatlikka ta'siri qanday?",
      "output": "Uyquning salomatlikka ta'siri kattadir, chunki yaxshi uyqu immunitetni kuchaytiradi, xotirani yaxshilaydi va ruhiy holatni normallashtiradi."
    },
    {
      "id": 723,
      "input": "Hiperforeniyani qanday boshqarish mumkin?",
      "output": "Hiperforeniya nafas olish mashqlari, jismoniy faollik va stressni boshqarish orqali boshqarilishi mumkin."
    },
    {
      "id": 724,
      "input": "Teridagi alerjiya reaktsiyalarini qanday davolash mumkin?",
      "output": "Teridagi alerjiya reaktsiyalarini antihistaminlar, kortikosteroidlar va alerjenlardan saqlanish bilan davolash mumkin."
    },
    {
      "id": 725,
      "input": "Yallig'lanishga qarshi eng yaxshi oziq-ovqatlar qanday?",
      "output": "Yallig'lanishga qarshi eng yaxshi oziq-ovqatlar omega-3 yog' kislotalari, meva va sabzavotlar, zanjabil va sarimsoqdir."
    },
    {
      "id": 726,
      "input": "Qonning guruhini qanday aniqlash mumkin?",
      "output": "Qon guruhini aniqlash uchun qon tahlili amalga oshiriladi, bunda eritrotsitlar va antikorlar tahlil qilinadi."
    },
    {
      "id": 727,
      "input": "Yuqori tana harorati ko'tarilishi nima?",
      "output": "Yuqori tana harorati ko'tarilishi organizmda yallig'lanish, infeksiya yoki boshqa kasalliklarning belgisidir."
    },
    {
      "id": 728,
      "input": "Sog'lom yurak uchun qanday ovqatlar foydalidir?",
      "output": "Sog'lom yurak uchun omega-3 yog' kislotalari, to'qima tolasi, sabzavotlar va mevalar, to'liq donli mahsulotlar foydalidir."
    },
    {
      "id": 729,
      "input": "Pankreatitning asosiy belgilari qanday?",
      "output": "Pankreatitning asosiy belgilari oshqozon og'rig'i, qusish, isitma va og'riqli oshqozon shishishi hisoblanadi."
    },
    {
      "id": 730,
      "input": "Jigarni qanday tozalash mumkin?",
      "output": "Jigarni tozalash uchun ko'p suv ichish, sog'lom ovqatlanish va zararli moddalar bilan aloqani cheklash kerak."
    },
    {
      "id": 731,
      "input": "Suyuqlik tanqisligi qanday aniqlanadi?",
      "output": "Suyuqlik tanqisligi terining quruqligi, ko'zlarning qurishi, bosh og'rig'i va kam urinish bilan aniqlanadi."
    },
    {
      "id": 732,
      "input": "Soch to'kilishini qanday davolash mumkin?",
      "output": "Soch to'kilishini davolash uchun sog'lom ovqatlanish, stressni boshqarish, vitaminlar va minеrallarni qabul qilish zarur."
    },
    {
      "id": 733,
      "input": "Balansli ovqatlanishning afzalliklari qanday?",
      "output": "Balansli ovqatlanish organizmni zarur ozuqa moddalariga ta'minlaydi, energiya beradi va immunitetni kuchaytiradi."
    },
    {
      "id": 734,
      "input": "Yangi tug'ilgan chaqaloqni qanday emizish kerak?",
      "output": "Yangi tug'ilgan chaqaloqni onaning sutini berish, to'g'ri pozitsiyada emizish va chaqaloqni har ikki tomondan emizish kerak."
    },
    {
      "id": 735,
      "input": "Arterial gipertenziya belgilari qanday?",
      "output": "Arterial gipertenziya belgilari bosh og'rig'i, yurak urishi tezlashishi, ko'zning oldida qorong'ilik va nafas qisishi bo'lishi mumkin."
    },
    {
      "id": 736,
      "input": "Sog'lom immunitetni qanday saqlash mumkin?",
      "output": "Sog'lom immunitetni saqlash uchun vitamin C, D, toza havo, muntazam sport va to'g'ri uyqu zarur."
    },
    {
      "id": 737,
      "input": "O'pkadagi infeksiyalarni qanday aniqlash mumkin?",
      "output": "O'pkadagi infeksiyalarni rentgen, kompyuter tomografiya (KT) va nafas olish testi yordamida aniqlash mumkin."
    },
    {
      "id": 738,
      "input": "Teridagi akne va yallig'lanishlarni qanday davolash kerak?",
      "output": "Akne va yallig'lanishlarni to'g'ri teri parvarishi, antiseptiklar, antibiotiklar yoki kerak bo'lsa dermatolog tavsiyalari bilan davolash mumkin."
    },
    {
      "id": 739,
      "input": "Semizlikni qanday oldini olish mumkin?",
      "output": "Semizlikni oldini olish uchun muntazam jismoniy faollik, kaloriyalarning balansli taqsimlanishi va sog'lom ovqatlanish zarur."
    },
    {
      "id": 740,
      "input": "Yog'li jigarni qanday davolash mumkin?",
      "output": "Yog'li jigarni davolash uchun to'g'ri ovqatlanish, alkogoldan saqlanish va jismoniy faollikni oshirish kerak."
    },
    {
      "id": 741,
      "input": "Ikkinchi turdagi diabetni qanday nazorat qilish mumkin?",
      "output": "Ikkinchi turdagi diabetni nazorat qilish uchun qon shakarini tekshirish, sog'lom ovqatlanish, jismoniy faollik va dori vositalari zarur."
    },
    {
      "id": 742,
      "input": "Asab tizimining salomatligini qanday saqlash mumkin?",
      "output": "Asab tizimini saqlash uchun stressni boshqarish, muntazam dam olish, o'qish va ijtimoiy aloqalarni yaxshilash zarur."
    },
    {
      "id": 743,
      "input": "Uyqudan oldin qanday ovqatlarni iste'mol qilish kerak?",
      "output": "Uyqudan oldin engil, oson hazm bo'ladigan ovqatlarni iste'mol qilish, masalan, meva yoki yoğurt tavsiya etiladi."
    },
    {
      "id": 744,
      "input": "Yo'talni qanday oldini olish mumkin?",
      "output": "Yo'talni oldini olish uchun yuqumli kasalliklaridan saqlanish, sovuqdan himoyalanish va gigienani saqlash zarur."
    },
    {
      "id": 745,
      "input": "Vaksinalarning ahamiyati qanday?",
      "output": "Vaksinalar yuqumli kasalliklarni oldini olishda muhim rol o'ynaydi, immunitetni kuchaytiradi va jamiyatni himoya qiladi."
    },
    {
      "id": 746,
      "input": "Oyoqlardagi varikozni qanday davolash mumkin?",
      "output": "Varikozni davolash uchun kompresyon paypoqlar, jismoniy faollik va ba'zan jarrohlik aralashuvlar kerak bo'lishi mumkin."
    },
    {
      "id": 747,
      "input": "Hayz tsiklini qanday nazorat qilish mumkin?",
      "output": "Hayz tsiklini nazorat qilish uchun gormonal dori vositalarini qabul qilish, stressni boshqarish va to'g'ri ovqatlanish zarur."
    },
    {
      "id": 748,
      "input": "Bemorni psixologik qo'llab-quvvatlash qanday amalga oshiriladi?",
      "output": "Bemorni psixologik qo'llab-quvvatlash uchun tinglash, rahbarlik, ijobiy motivatsiya va qo'llab-quvvatlovchi muhit yaratish kerak."
    },
    {
      "id": 749,
      "input": "Akut angina belgilari qanday?",
      "output": "Akut angina belgilari orasida ko'krak og'rig'i, nafas qisishi, yurak urishi tezlashishi va terlash mavjud."
    },
    {
      "id": 750,
      "input": "Qon aylanishining buzilishi qanday aniqlanadi?",
      "output": "Qon aylanishi buzilishining belgilari sifatida sovuq qo'llar, oyoqlar, tez charchash va teri rangidagi o'zgarishlar paydo bo'lishi mumkin."
    },
    {
      "id": 751,
      "input": "Bolalarda astma qanday alomatlar bilan namoyon bo'ladi?",
      "output": "Bolalarda astma alomatlari yo'tal, nafas qisishi, havotir va o'pka infeksiyalariga tez-tez chalinish ko'rinishida bo'lishi mumkin."
    },
    {
      "id": 752,
      "input": "Homiladorlikda qo'shimcha vitaminlarni qachon olish kerak?",
      "output": "Homiladorlikda qo'shimcha vitaminlar, ayniqsa, folat va D vitamini, homiladorlikning dastlabki davrida va tug'ruqdan keyin olinishi kerak."
    },
    {
      "id": 753,
      "input": "Yurakni qanday himoya qilish mumkin?",
      "output": "Yurakni himoya qilish uchun to'g'ri ovqatlanish, sigaret chekishdan saqlanish, muntazam jismoniy faollik va stressni boshqarish zarur."
    },
    {
      "id": 754,
      "input": "Harorat ko'tarilishi va isitmaning farqi qanday?",
      "output": "Isitma organizmda yallig'lanish yoki infeksiya borligini ko'rsatadi, harorat esa jismoniy faollik yoki atrof-muhit sharoitiga bog'liq o'zgaradi."
    },
    {
      "id": 755,
      "input": "Tananing ortiqcha yog'ini qanday kamaytirish mumkin?",
      "output": "Tananing ortiqcha yog'ini kamaytirish uchun kaloriyalarni kamaytirish, jismoniy faollikni oshirish va muvozanatli ovqatlanish kerak."
    },
    {
      "id": 756,
      "input": "Stressni boshqarish uchun qanday metodlardan foydalanish mumkin?",
      "output": "Stressni boshqarish uchun nafas olish mashqlari, meditatsiya, sport va shaxsiy vaqtni ajratish tavsiya etiladi."
    },
    {
      "id": 757,
      "input": "Yangi tug'ilgan chaqaloq uchun qanday dorilar zarur?",
      "output": "Yangi tug'ilgan chaqaloq uchun faqat shifokor tomonidan belgilangan dorilar kerak, asosan onaning suti va parvarishi asosida."
    },
    {
      "id": 758,
      "input": "Gipotireozning belgilari qanday?",
      "output": "Gipotireozning belgilari uyquchanlik, vazn ortishi, sovuqqa chidamsizlik, teri qurishi va xotira muammolari bilan ko'rsatiladi."
    },
    {
      "id": 759,
      "input": "O'pka saratonining asosiy xavf omillari qanday?",
      "output": "O'pka saratonining asosiy xavf omillari chekish, havodagi ifloslanish, genetik omillar va oldingi o'pka kasalliklari."
    },
    {
      "id": 760,
      "input": "Semizlikni davolashda qanday dori vositalari qo'llaniladi?",
      "output": "Semizlikni davolashda og'irlikni kamaytiruvchi dorilar, masalan, orlistat, liraglutid yoki bupropion-naltrekson kombinatsiyasi qo'llanilishi mumkin."
    },
    {
      "id": 761,
      "input": "Teri saratoni belgilari qanday?",
      "output": "Teri saratoni belgilari orasida terida o'zgarishlar, yangi yallig'lanishlar, toshmalar, bo'rtib chiqishlar va qon ketishlari kiradi."
    },
    {
      "id": 762,
      "input": "O'zgarishlar yuzaga kelganda buyraklar qanday ishlaydi?",
      "output": "O'zgarishlar yuzaga kelganda, buyraklar organizmda suyuqlik va elektrolit muvozanatini saqlashga yordam beradi, ammo ularning ishlashida muammolar yuzaga kelishi mumkin."
    },
    {
      "id": 763,
      "input": "O'pkada yallig'lanish qanday belgilar bilan boshlanadi?",
      "output": "O'pkada yallig'lanishning boshlanishi nafas qisishi, yo'tal, qizarish va ko'krakda og'riq bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 764,
      "input": "Yurakni mustahkamlash uchun qanday mashqlar amalga oshiriladi?",
      "output": "Yurakni mustahkamlash uchun aerobik mashqlar, yugurish, suzish, velosipedda sayr qilish va tez yurish tavsiya etiladi."
    },
    {
      "id": 765,
      "input": "Qon ketishining asosiy sabablari qanday?",
      "output": "Qon ketishining asosiy sabablari jarohatlar, tomirlarning yorilishi, ichki qonamalar va qon ivishining buzilishi bo'lishi mumkin."
    },
    {
      "id": 766,
      "input": "Oyoqlardagi shishishni qanday davolash mumkin?",
      "output": "Oyoqlardagi shishishni davolash uchun kompresyon paypoqlar, oyoqlarni baland qo'yish, jismoniy faollik va suyuqlikni cheklash kerak."
    },
    {
      "id": 767,
      "input": "Qo'llarni va oyoqlarni sog'lom saqlash uchun qanday mashqlar mavjud?",
      "output": "Qo'llar va oyoqlarni sog'lom saqlash uchun kuchaytiruvchi mashqlar, masalan, og'irliklar bilan ishlash, yoga va stretching mashqlari foydalidir."
    },
    {
      "id": 768,
      "input": "Qandli diabetda qondagi shakar miqdorini qanday nazorat qilish mumkin?",
      "output": "Qondagi shakar miqdorini nazorat qilish uchun insulinni vaqtida olish, sog'lom ovqatlanish, muntazam jismoniy faollik va qon shakarini doimiy tekshirish zarur."
    },
    {
      "id": 769,
      "input": "Homiladorlikda o'zgarishlar qanday bo'ladi?",
      "output": "Homiladorlikda o'zgarishlar orasida ko'krak hajmining kattalashishi, teri yuzasida o'zgarishlar, tashqi ko'rinishdagi o'zgarishlar va kayfiyatning o'zgarishi bor."
    },
    {
      "id": 770,
      "input": "Uyqu buzilishlarini davolash uchun qanday dorilar ishlatiladi?",
      "output": "Uyqu buzilishlarini davolash uchun melatonin, benzodiazepinlar, antidepresanlar yoki boshqa uyquni yaxshilovchi dorilar ishlatilishi mumkin."
    },
    {
      "id": 771,
      "input": "Ko'zlarni qanday parvarish qilish kerak?",
      "output": "Ko'zlarni parvarish qilish uchun muntazam ravishda ko'zlarni tozalash, quyoshdan himoya qilish va ko'z bo'shlig'ini namlash kerak."
    },
    {
      "id": 772,
      "input": "O'zgarishlar yuzaga kelganda prostata qanday ishlaydi?",
      "output": "Prostata bezining kattalashishi yoki infeksiyalari o'sish va og'riqlarga sabab bo'lishi mumkin, shuningdek, siydik chiqarish bilan bog'liq muammolarni keltirib chiqaradi."
    },
    {
      "id": 773,
      "input": "Gormonal muvozanatsizlikning belgilari qanday?",
      "output": "Gormonal muvozanatsizlikning belgilari kayfiyat o'zgarishi, uyqusizlik, ortiqcha tüyish va og'irlikni o'zgartirish bo'lishi mumkin."
    },
    {
      "id": 774,
      "input": "Organizmda temir yetishmasligi qanday belgilar bilan ko'rinadi?",
      "output": "Temir yetishmasligi belgilari yorg'inlik, bosh aylanishi, teri rangining o'zgarishi va ko'zlarning oqarishi bilan namoyon bo'ladi."
    },
    {
      "id": 775,
      "input": "Hujayra energiyasining asosiy manbai nima?",
      "output": "Hujayra energiyasining asosiy manbai uglevodlar (glikogen) va yog'lar bo'lib, ular metabolizm jarayonida energiyaga aylantiriladi."
    },
    {
      "id": 776,
      "input": "Homiladorlikda ortiqcha vaznni qanday nazorat qilish mumkin?",
      "output": "Homiladorlikda ortiqcha vaznni nazorat qilish uchun to'g'ri ovqatlanish, muntazam yurish va shifokor tavsiyalariga rioya qilish zarur."
    },
    {
      "id": 777,
      "input": "O'zgarishlar yuzaga kelganda ovqat hazm qilish tizimi qanday ishlaydi?",
      "output": "Ovqat hazm qilish tizimi oziq-ovqatni yutish, hazm qilish va kerakli ozuqaviy moddalarni so'rib olishni amalga oshiradi, o'zgarishlar esa uni samaradorligini pasaytirishi mumkin."
    },
    {
      "id": 778,
      "input": "Laringitni qanday davolash mumkin?",
      "output": "Laringitni davolash uchun ovozni ko'p ishlatmang, iliq suyuqlik iching, yallig'lanishga qarshi dorilar va ba'zan antibiotiklardan foydalanish mumkin."
    },
    {
      "id": 779,
      "input": "Endometriozning belgilari qanday?",
      "output": "Endometriozning belgilari og'ir hayz ko'rish, qorin og'rig'i, ko'ngil aynishi va bepushtlikni o'z ichiga oladi."
    },
    {
      "id": 780,
      "input": "O'zgarishlar yuzaga kelganda me'da qanday ishlaydi?",
      "output": "Me'da oziq-ovqatni qabul qilib, uni hazm qilish uchun kislotalar ishlab chiqaradi, ammo tizimda bo'sh joy yoki og'riqlar bo'lsa, bu o'zgarishlar tufayli qiyinlashishi mumkin."
    },
    {
      "id": 781,
      "input": "O'pka yallig'lanishining sabablari qanday?",
      "output": "O'pka yallig'lanishining sabablari orasida bakteriyalar, viruslar, to'liq ishlamagan immun tizimi va chekish mavjud."
    },
    {
      "id": 782,
      "input": "Uyqu buzilishlari qanday belgilari bo'lishi mumkin?",
      "output": "Uyqu buzilishlari bosh og'rig'i, kunduzgi uyquchanlik, uyquga ketishda qiyinchiliklar va tez-tez uyg'onishlar bilan ko'rinadi."
    },
    {
      "id": 783,
      "input": "Ortopedik jarohatlar qanday davolanadi?",
      "output": "Ortopedik jarohatlar, masalan, suyagalar, orqa va bo'yin og'riqlari fizioterapiya, jarrohlik aralashuvlar va og'riqni kamaytiruvchi dorilar yordamida davolanishi mumkin."
    },
    {
      "id": 784,
      "input": "Yuqumli kasalliklarni qanday oldini olish mumkin?",
      "output": "Yuqumli kasalliklarni oldini olish uchun gigiena qoidalariga rioya qilish, qo'l yuvish, vaksinatsiya va muvozanatli ovqatlanish zarur."
    },
    {
      "id": 785,
      "input": "Sog'lom ovqatlanishning asosiy tamoyillari qanday?",
      "output": "Sog'lom ovqatlanishning asosiy tamoyillari ozuqaviy moddalar balansini saqlash, meva-sabzavotlar iste'mol qilish va ortiqcha yog'lardan saqlanishdir."
    },
    {
      "id": 786,
      "input": "Shakarni ko'proq iste'mol qilishning salbiy ta'siri qanday?",
      "output": "Shakarni ortiqcha iste'mol qilish organizmda qondagi shakar miqdorini oshirib, semizlik, diabet va yurak kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 787,
      "input": "Stressni kamaytirish uchun qanday mashqlar mavjud?",
      "output": "Stressni kamaytirish uchun yoga, meditatsiya, nafas olish mashqlari va tabiatda sayr qilish samarali bo'lishi mumkin."
    },
    {
      "id": 788,
      "input": "Homiladorlikda toksikozni qanday boshqarish mumkin?",
      "output": "Homiladorlikda toksikozni boshqarish uchun meva va sabzavotlar iste'mol qilish, kichik va tez-tez ovqatlanish, sovuq va iliq ichimliklar ichish tavsiya etiladi."
    },
    {
      "id": 789,
      "input": "O'pka saratonining asosiy xavf omillari qanday?",
      "output": "O'pka saratonining asosiy xavf omillari chekish, havodagi ifloslanish, genetik omillar va oldingi o'pka kasalliklari."
    },
    {
      "id": 790,
      "input": "Semizlikni davolashda qanday dori vositalari qo'llaniladi?",
      "output": "Semizlikni davolashda og'irlikni kamaytiruvchi dorilar, masalan, orlistat, liraglutid yoki bupropion-naltrekson kombinatsiyasi qo'llanilishi mumkin."
    },
    {
      "id": 791,
      "input": "Teri saratoni belgilari qanday?",
      "output": "Teri saratoni belgilari orasida terida o'zgarishlar, yangi yallig'lanishlar, toshmalar, bo'rtib chiqishlar va qon ketishlari kiradi."
    },
    {
      "id": 792,
      "input": "O'zgarishlar yuzaga kelganda buyraklar qanday ishlaydi?",
      "output": "O'zgarishlar yuzaga kelganda, buyraklar organizmda suyuqlik va elektrolit muvozanatini saqlashga yordam beradi, ammo ularning ishlashida muammolar yuzaga kelishi mumkin."
    },
    {
      "id": 793,
      "input": "O'pkada yallig'lanish qanday belgilar bilan boshlanadi?",
      "output": "O'pkada yallig'lanishning boshlanishi nafas qisishi, yo'tal, qizarish va ko'krakda og'riq bilan namoyon bo'lishi mumkin."
    },
    {
      "id": 794,
      "input": "Yurakni mustahkamlash uchun qanday mashqlar amalga oshiriladi?",
      "output": "Yurakni mustahkamlash uchun aerobik mashqlar, yugurish, suzish, velosipedda sayr qilish va tez yurish tavsiya etiladi."
    },
    {
      "id": 795,
      "input": "Qon ketishining asosiy sabablari qanday?",
      "output": "Qon ketishining asosiy sabablari jarohatlar, tomirlarning yorilishi, ichki qonamalar va qon ivishining buzilishi bo'lishi mumkin."
    },
    {
      "id": 796,
      "input": "Oyoqlardagi shishishni qanday davolash mumkin?",
      "output": "Oyoqlardagi shishishni davolash uchun kompresyon paypoqlar, oyoqlarni baland qo'yish, jismoniy faollik va suyuqlikni cheklash kerak."
    },
    {
      "id": 797,
      "input": "Qo'llarni va oyoqlarni sog'lom saqlash uchun qanday mashqlar mavjud?",
      "output": "Qo'llar va oyoqlarni sog'lom saqlash uchun kuchaytiruvchi mashqlar, masalan, og'irliklar bilan ishlash, yoga va stretching mashqlari foydalidir."
    },
    {
      "id": 798,
      "input": "Qandli diabetda qondagi shakar miqdorini qanday nazorat qilish mumkin?",
      "output": "Qondagi shakar miqdorini nazorat qilish uchun insulinni vaqtida olish, sog'lom ovqatlanish, muntazam jismoniy faollik va qon shakarini doimiy tekshirish zarur."
    },
    {
      "id": 799,
      "input": "Homiladorlikda o'zgarishlar qanday bo'ladi?",
      "output": "Homiladorlikda o'zgarishlar orasida ko'krak hajmining kattalashishi, teri yuzasida o'zgarishlar, tashqi ko'rinishdagi o'zgarishlar va kayfiyatning o'zgarishi bor."
    },
    {
      "id": 800,
      "input": "Uyqu buzilishlarini davolash uchun qanday dorilar ishlatiladi?",
      "output": "Uyqu buzilishlarini davolash uchun melatonin, benzodiazepinlar, antidepresanlar yoki boshqa uyquni yaxshilovchi dorilar ishlatilishi mumkin."
    },
    {
      "id": 801,
      "input": "Ko'zlarni qanday parvarish qilish kerak?",
      "output": "Ko'zlarni parvarish qilish uchun muntazam ravishda ko'zlarni tozalash, quyoshdan himoya qilish va ko'z bo'shlig'ini namlash kerak."
    },
    {
      "id": 802,
      "input": "O'zgarishlar yuzaga kelganda prostata qanday ishlaydi?",
      "output": "Prostata bezining kattalashishi yoki infeksiyalari o'sish va og'riqlarga sabab bo'lishi mumkin, shuningdek, siydik chiqarish bilan bog'liq muammolarni keltirib chiqaradi."
    },
    {
      "id": 803,
      "input": "Gormonal muvozanatsizlikning belgilari qanday?",
      "output": "Gormonal muvozanatsizlikning belgilari kayfiyat o'zgarishi, uyqusizlik, ortiqcha tüyish va og'irlikni o'zgartirish bo'lishi mumkin."
    },
    {
      "id": 804,
      "input": "Organizmda temir yetishmasligi qanday belgilar bilan ko'rinadi?",
      "output": "Temir yetishmasligi belgilari yorg'inlik, bosh aylanishi, teri rangining o'zgarishi va ko'zlarning oqarishi bilan namoyon bo'ladi."
    },
    {
      "id": 805,
      "input": "Hujayra energiyasining asosiy manbai nima?",
      "output": "Hujayra energiyasining asosiy manbai uglevodlar (glikogen) va yog'lar bo'lib, ular metabolizm jarayonida energiyaga aylantiriladi."
    },
    {
      "id": 806,
      "input": "Homiladorlikda ortiqcha vaznni qanday nazorat qilish mumkin?",
      "output": "Homiladorlikda ortiqcha vaznni nazorat qilish uchun to'g'ri ovqatlanish, muntazam yurish va shifokor tavsiyalariga rioya qilish zarur."
    },
    {
      "id": 807,
      "input": "O'zgarishlar yuzaga kelganda ovqat hazm qilish tizimi qanday ishlaydi?",
      "output": "Ovqat hazm qilish tizimi oziq-ovqatni yutish, hazm qilish va kerakli ozuqaviy moddalarni so'rib olishni amalga oshiradi, o'zgarishlar esa uni samaradorligini pasaytirishi mumkin."
    },
    {
      "id": 808,
      "input": "Laringitni qanday davolash mumkin?",
      "output": "Laringitni davolash uchun ovozni ko'p ishlatmang, iliq suyuqlik iching, yallig'lanishga qarshi dorilar va ba'zan antibiotiklardan foydalanish mumkin."
    },
    {
      "id": 809,
      "input": "Endometriozning belgilari qanday?",
      "output": "Endometriozning belgilari og'ir hayz ko'rish, qorin og'rig'i, ko'ngil aynishi va bepushtlikni o'z ichiga oladi."
    },
    {
      "id": 810,
      "input": "O'zgarishlar yuzaga kelganda me'da qanday ishlaydi?",
      "output": "Me'da oziq-ovqatni qabul qilib, uni hazm qilish uchun kislotalar ishlab chiqaradi, ammo tizimda bo'sh joy yoki og'riqlar bo'lsa, bu o'zgarishlar tufayli qiyinlashishi mumkin."
    },
    {
      "id": 811,
      "input": "O'pka yallig'lanishining sabablari qanday?",
      "output": "O'pka yallig'lanishining sabablari orasida bakteriyalar, viruslar, to'liq ishlamagan immun tizimi va chekish mavjud."
    },
    {
      "id": 812,
      "input": "Uyqu buzilishlari qanday belgilari bo'lishi mumkin?",
      "output": "Uyqu buzilishlari bosh og'rig'i, kunduzgi uyquchanlik, uyquga ketishda qiyinchiliklar va tez-tez uyg'onishlar bilan ko'rinadi."
    },
    {
      "id": 813,
      "input": "Ortopedik jarohatlar qanday davolanadi?",
      "output": "Ortopedik jarohatlar, masalan, suyagalar, orqa va bo'yin og'riqlari fizioterapiya, jarrohlik aralashuvlar va og'riqni kamaytiruvchi dorilar yordamida davolanishi mumkin."
    },
    {
      "id": 814,
      "input": "Yuqumli kasalliklarni qanday oldini olish mumkin?",
      "output": "Yuqumli kasalliklarni oldini olish uchun gigiena qoidalariga rioya qilish, qo'l yuvish, vaksinatsiya va muvozanatli ovqatlanish zarur."
    },
    {
      "id": 815,
      "input": "Sog'lom ovqatlanishning asosiy tamoyillari qanday?",
      "output": "Sog'lom ovqatlanishning asosiy tamoyillari ozuqaviy moddalar balansini saqlash, meva-sabzavotlar iste'mol qilish va ortiqcha yog'lardan saqlanishdir."
    },
    {
      "id": 816,
      "input": "Shakarni ko'proq iste'mol qilishning salbiy ta'siri qanday?",
      "output": "Shakarni ortiqcha iste'mol qilish organizmda qondagi shakar miqdorini oshirib, semizlik, diabet va yurak kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 817,
      "input": "Stressni kamaytirish uchun qanday mashqlar mavjud?",
      "output": "Stressni kamaytirish uchun yoga, meditatsiya, nafas olish mashqlari va tabiatda sayr qilish samarali bo'lishi mumkin."
    },
    {
      "id": 818,
      "input": "Homiladorlikda toksikozni qanday boshqarish mumkin?",
      "output": "Homiladorlikda toksikozni boshqarish uchun meva va sabzavotlar iste'mol qilish, kichik va tez-tez ovqatlanish, sovuq va iliq ichimliklar ichish tavsiya etiladi."
    },
    {
      "id": 819,
      "input": "Yangi tug'ilgan chaqaloqda qanday noto'g'ri rivojlanishlar bo'lishi mumkin?",
      "output": "Yangi tug'ilgan chaqaloqda noto'g'ri rivojlanishlar orasida neyrologik muammolar, jigar kasalliklari yoki yurak nuqsonlari bo'lishi mumkin."
    },
    {
      "id": 820,
      "input": "Jigarni qanday parvarish qilish kerak?",
      "output": "Jigarni parvarish qilish uchun alkogoldan saqlanish, sog'lom ovqatlanish, muntazam sport va toksinlardan himoyalanish zarur."
    },
    {
      "id": 821,
      "input": "Tabiiy antibiotiklar qanday ishlaydi?",
      "output": "Tabiiy antibiotiklar, masalan, sarimsoq, zanjabil, va asal, bakteriyalarni kamaytirish va immun tizimini kuchaytirishga yordam beradi."
    },
    {
      "id": 822,
      "input": "O'pka kasalliklarini qanday aniqlash mumkin?",
      "output": "O'pka kasalliklarini rentgen tasvirga olish, kompyuter tomografiyasi (KT) va spirometriya yordamida aniqlash mumkin."
    },
    {
      "id": 823,
      "input": "Nutqni kech rivojlanayotgan bolalar uchun qanday yordam ko'rsatish mumkin?",
      "output": "Nutqni kech rivojlanayotgan bolalarga logoped yordamida maxsus mashqlar, til va nutqni rivojlantirishga qaratilgan o'quv dasturlari yordam beradi."
    },
    {
      "id": 824,
      "input": "Semizlikni kamaytirish uchun qaysi turdagi diyetalar samarali?",
      "output": "Semizlikni kamaytirish uchun past karbongidratli, yog'ni kamaytiruvchi va ozuqaviy moddalarga boy diyetalar samarali bo'lishi mumkin."
    },
    {
      "id": 825,
      "input": "Alkogolni iste'mol qilishning sog'liq uchun ta'siri qanday?",
      "output": "Alkogolni ortiqcha iste'mol qilish jigar kasalliklari, yurak va qon tomir kasalliklari, psixologik muammolarni keltirib chiqarishi mumkin."
    },
    {
      "id": 826,
      "input": "Yallig'lanish nima va uning belgilari qanday?",
      "output": "Yallig'lanish organizmning himoya reaksiyasi bo'lib, og'riq, qizarish, shishish va isitma kabi belgilarga olib kelishi mumkin."
    },
    {
      "id": 827,
      "input": "Qon bosimi qanday o'lchanadi?",
      "output": "Qon bosimi, sistolik va diastolik bosimlarni o'lchash orqali aniqlanadi. Sistolik bosim yurakning qisqarish bosimi, diastolik esa uning bo'shagan paytidagi bosimni ko'rsatadi."
    },
    {
      "id": 828,
      "input": "Nefropatiya nima va uning belgilari qanday?",
      "output": "Nefropatiya buyraklarning kasalliklari bo'lib, qondagi kreatinin miqdori, shishish va siydikda o'zgarishlar bilan namoyon bo'ladi."
    },
    {
      "id": 829,
      "input": "Avitaminoz nima va qanday alomatlar ko'rinadi?",
      "output": "Avitaminoz tanqis vitaminlar tufayli yuzaga keladi va u charchoq, teri qurishi, ko'zdagi muammolar va immunitetning pasayishi kabi belgilar bilan ko'rinadi."
    },
    {
      "id": 830,
      "input": "Shishlarni qanday davolash mumkin?",
      "output": "Shishlarni davolash uchun to'g'ri ovqatlanish, kompreslar, suyuqlikni kamaytirish va zarur bo'lsa, shifokor tavsiyalariga amal qilish kerak."
    },
    {
      "id": 831,
      "input": "Artritni qanday davolash mumkin?",
      "output": "Artritni davolashda yallig'lanishga qarshi dorilar, jismoniy terapiya, og'riqni kamaytirish va ba'zan jarrohlik aralashuvlar qo'llaniladi."
    },
    {
      "id": 832,
      "input": "Me'da yarasini qanday aniqlash mumkin?",
      "output": "Me'da yarasini gastroskopiya yoki endoskopiya yordamida aniqlash mumkin, bu usullar me'daning ichki qismini tekshirishga yordam beradi."
    },
    {
      "id": 833,
      "input": "Fizioterapiya qanday yordam beradi?",
      "output": "Fizioterapiya mushaklar va suyaklarning sog'ligini saqlash, og'riqlarni kamaytirish va harakat qobiliyatini tiklash uchun yordam beradi."
    },
    {
      "id": 834,
      "input": "O'pka yetishmovchiligi qanday belgilarga ega?",
      "output": "O'pka yetishmovchiligi belgilari nafas qisishi, charchoq, kayfiyatning o'zgarishi, kuchli yo'tal va ko'krak og'rig'i bilan ko'rinadi."
    },
    {
      "id": 835,
      "input": "Quyosh nurlari bilan haddan tashqari ko'proq ta'sir qilishning zararli ta'siri qanday?",
      "output": "Quyosh nurlarining ortiqcha ta'siri teri saratoniga, terining yoshga bog'liq o'zgarishlariga va quyoshdan burni yoki ko'zlari zarar ko'rishiga olib kelishi mumkin."
    },
    {
      "id": 836,
      "input": "Altsgeymer kasalligi qanday belgilarga ega?",
      "output": "Altsgeymer kasalligi qisqa muddatli xotira yo'qotilishi, so'zlarni eslashda qiyinchiliklar, boshqaruvni yo'qotish va shaxsiyat o'zgarishlari bilan ko'rinadi."
    },
    {
      "id": 837,
      "input": "Kasalliklarni oldini olishda gigiena qanday muhim rol o'ynaydi?",
      "output": "Gigiena kasalliklarni oldini olishda eng muhim rolni o'ynaydi, chunki toza qo'llar, toza muhit va sog'lom yashash tarzini saqlash infektsiyalarni kamaytiradi."
    },
    {
      "id": 838,
      "input": "Infarktni qanday oldini olish mumkin?",
      "output": "Infarktni oldini olish uchun yurakni mustahkamlash, balansli ovqatlanish, jismoniy faollikni oshirish va sigaretdan voz kechish kerak."
    },
    {
      "id": 839,
      "input": "Zaharli moddalar bilan tanishuvning xavfi qanday?",
      "output": "Zaharli moddalar bilan tanishuv turli kasalliklarni keltirib chiqarishi, masalan, saraton, asab tizimi muammolari yoki jigar kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 840,
      "input": "Tananing ortiqcha issiqlikni qanday tartibga soladi?",
      "output": "Tana ortiqcha issiqlikni terlash, nafas olish tezligini oshirish va qon tomirlarini kengaytirish orqali tartibga soladi."
    },
    {
      "id": 841,
      "input": "Karpal tunel sindromi nima va qanday davolash mumkin?",
      "output": "Karpal tunel sindromi qo'l va barmoqlarda og'riq, uyqusizlik va sezgirlikni kamaytiradi, davolashda fizioterapiya, maxsus shinalar va ba'zan jarrohlik ishlatiladi."
    },
    {
      "id": 842,
      "input": "Ko'zning qurishi nima sababdan bo'ladi?",
      "output": "Ko'zning qurishi ko'p vaqt kompyuterda ishlash, havoning quruqligi, allergiya yoki ko'zning kamroq yuvilishi sababli yuzaga keladi."
    },
    {
      "id": 843,
      "input": "Torakal ateliektaziya qanday aniqlanadi?",
      "output": "Torakal ateliektaziya kompyuter tomografiya (KT) yoki rentgen yordamida aniqlanadi, bu nafas olish tizimidagi bir qator kasalliklarni ko'rsatadi."
    },
    {
      "id": 844,
      "input": "Jigarni qanday tekshirish mumkin?",
      "output": "Jigarni tekshirish uchun qon tahlillari, ultratovush tekshiruvi (US) yoki kompyuter tomografiyasi (KT) ishlatilishi mumkin."
    },
    {
      "id": 845,
      "input": "Bosh og'rig'ining asosiy turlari qanday?",
      "output": "Bosh og'rig'ining asosiy turlari migren, giperpeteziya (qon bosimi yuqori bo'lishi) va giperemiya (yurak faoliyatining buzilishi) hisoblanadi."
    },
    {
      "id": 846,
      "input": "Erta yoshdagi diabetning belgilari qanday bo'ladi?",
      "output": "Erta yoshdagi diabet belgilari tez charchash, ortiqcha siydik chiqarish, ortiqcha ochlik va doimiy chanqash bilan ko'rinadi."
    },
    {
      "id": 847,
      "input": "Sinovdan o'tish jarayonida qanday ruhiy tayyorgarlikni amalga oshirish kerak?",
      "output": "Sinovdan o'tish jarayonida tinchlanish, nafas olish mashqlari, tayyorgarlikni oldindan rejalashtirish va yaxshi dam olish muhimdir."
    },
    {
      "id": 848,
      "input": "Salomatlikni mustahkamlashda stressni qanday boshqarish mumkin?",
      "output": "Stressni boshqarish uchun meditatsiya, yoga, tabiiy muhitda dam olish, jismoniy mashqlar va ijobiy fikrlar yordam beradi."
    },
    {
      "id": 849,
      "input": "Astma kasalligini qanday davolash mumkin?",
      "output": "Astmani davolashda inhalyatorlar, dori vositalari va allergiyalarni kamaytirish uchun parvarish muhimdir."
    },
    {
      "id": 850,
      "input": "Peshob yo'llaridagi infeksiyani qanday aniqlash mumkin?",
      "output": "Peshob yo'llaridagi infeksiyani peshob tahlili orqali aniqlash mumkin, bunda bakteriyalar va boshqa o'zgarishlar ko'rinadi."
    },
    {
      "id": 851,
      "input": "Yurak xuruji qanday belgilarga ega?",
      "output": "Yurak xuruji og'riq, ko'ngil aynishi, nafas qisishi, terlash va bosh aylanishi kabi belgilar bilan boshlanishi mumkin."
    },
    {
      "id": 852,
      "input": "Grippni qanday davolash mumkin?",
      "output": "Grippni davolashda ko'p suyuqlik ichish, dam olish, paratsetamol kabi og'riq qoldiruvchi dorilar va antivirus dorilardan foydalanish mumkin."
    },
    {
      "id": 853,
      "input": "Oyoq-qo'llardagi og'riqni qanday davolash mumkin?",
      "output": "Oyoq-qo'llardagi og'riqni iliq kompres, jismoniy terapiya, og'riq qoldiruvchi dorilar va dam olish yordamida davolash mumkin."
    },
    {
      "id": 854,
      "input": "Alergiyalarga qarshi qanday dori vositalari mavjud?",
      "output": "Alergiyalarga qarshi antihistaminlar, nasallar va kortikosteroidlar kabi dorilar ishlatiladi."
    },
    {
      "id": 855,
      "input": "Vitamin D ning tanadagi roli nima?",
      "output": "Vitamin D suyaklar va immun tizimining sog'lom bo'lishi uchun zarur, shuningdek, kalsiy va fosforni so'rib olishga yordam beradi."
    },
    {
      "id": 856,
      "input": "O'pka infeksiyasini qanday davolash mumkin?",
      "output": "O'pka infeksiyasini antibiotiklar, nafasni yaxshilovchi dorilar va dam olish orqali davolash mumkin."
    },
    {
      "id": 857,
      "input": "O'zgarishlar yuzaga kelganda oshqozon qanday ishlaydi?",
      "output": "Oshqozon oziq-ovqatni hazm qilish, uni kislotali sharoitda ajratish va so'rib olish uchun javob beradi. O'zgarishlar esa uni samaradorligini pasaytirishi mumkin."
    },
    {
      "id": 858,
      "input": "Homiladorlikda temirni qanday qo'llash kerak?",
      "output": "Homiladorlikda temirni shifokor tavsiyasiga ko'ra qo'llash kerak, chunki bu qon hajmini oshiradi va homilani rivojlantiradi."
    },
    {
      "id": 859,
      "input": "Tananing immun tizimi qanday ishlaydi?",
      "output": "Immun tizimi organizmni zararlangan hujayralardan va infektsiyalardan himoya qiladi, lekin ba'zida tizim ortiqcha ishlashi mumkin."
    },
    {
      "id": 860,
      "input": "Tabiiy stressni kamaytirish usullari qanday?",
      "output": "Tabiiy stressni kamaytirish uchun nafas olish mashqlari, yoga, meditatsiya, tabiatda sayr qilish va ijobiy fikrlar yordam beradi."
    },
    {
      "id": 861,
      "input": "Shakarni ortiqcha iste'mol qilish qanday kasalliklarga olib kelishi mumkin?",
      "output": "Shakarni ortiqcha iste'mol qilish diabet, yurak kasalliklari, semizlik va tish muammolariga olib kelishi mumkin."
    },
    {
      "id": 862,
      "input": "Teri kasalliklarining sabablari qanday?",
      "output": "Teri kasalliklari allergiyalar, infektsiyalar, gormonal o'zgarishlar va atrof-muhit ta'siridan kelib chiqishi mumkin."
    },
    {
      "id": 863,
      "input": "Jigarni qanday tekshirish mumkin?",
      "output": "Jigarni tekshirish uchun qon tahlillari, ultratovush tekshiruvi (US), kompyuter tomografiyasi (KT) yoki biyopsiya ishlatiladi."
    },
    {
      "id": 864,
      "input": "Uyqu buzilishlari qanday davolanadi?",
      "output": "Uyqu buzilishlari uchun melatonin, uyquni yaxshilovchi dorilar, yaxshi uyqu gigienasi va stressni boshqarish muhimdir."
    },
    {
      "id": 865,
      "input": "O'pka saratonining asosiy xavf omillari qanday?",
      "output": "O'pka saratonining asosiy xavf omillari chekish, havodagi ifloslanish, genetik omillar va o'pka kasalliklaridir."
    },
    {
      "id": 866,
      "input": "Shaxsiy gigiena qanday muhim?",
      "output": "Shaxsiy gigiena kasalliklarning oldini olish, toza va sog'lom turmush tarzini saqlash uchun juda muhimdir."
    },
    {
      "id": 867,
      "input": "Jigar kasalliklarining oldini olish uchun qanday maslahatlar mavjud?",
      "output": "Jigar kasalliklarining oldini olish uchun alkogolni kamaytirish, sog'lom ovqatlanish, muntazam jismoniy faollik va yuqori darajadagi toksinlardan saqlanish kerak."
    },
    {
      "id": 868,
      "input": "Qon donorlari qanday bo'lishi kerak?",
      "output": "Qon donorlari sog'lom, 18-65 yosh orasida bo'lishi, qon bosimi va boshqa sog'liq ko'rsatkichlari normal bo'lishi kerak."
    },
    {
      "id": 869,
      "input": "Buyrak kasalliklarini qanday aniqlash mumkin?",
      "output": "Buyrak kasalliklarini qon tahlili, siydik tahlili va ultratovush yordamida aniqlash mumkin."
    },
    {
      "id": 870,
      "input": "Oyoqlarda varikozni qanday davolash mumkin?",
      "output": "Oyoqlarda varikozni davolash uchun kompresion choyshablar, jismoniy faollik, dorilar va ba'zan jarrohlik amaliyotlari qo'llaniladi."
    },
    {
      "id": 871,
      "input": "Astma kasalligi qanday belgilar bilan boshlanadi?",
      "output": "Astma kasalligi yo'tal, nafas qisishi, ko'krakdagi siqilish va qiyin nafas olish bilan boshlanadi."
    },
    {
      "id": 872,
      "input": "Ko'zdagi infektsiyalar qanday davolanadi?",
      "output": "Ko'zdagi infektsiyalar antibiotik ko'z tomchilari yoki dori vositalari bilan davolanadi."
    },
    {
      "id": 873,
      "input": "Yuqumli kasalliklar qanday tarqaladi?",
      "output": "Yuqumli kasalliklar asosan havo orqali, to'g'ridan-to'g'ri aloqa yoki ifloslangan oziq-ovqat orqali tarqalishi mumkin."
    },
    {
      "id": 874,
      "input": "Kaliy tanada qanday rol o'ynaydi?",
      "output": "Kaliy yurak ritmini saqlash, suyuqlik va elektrolitlarni muvozanatda ushlab turish va mushaklarning normal faoliyatini ta'minlashda muhim rol o'ynaydi."
    },
    {
      "id": 875,
      "input": "Ko'ngil aynishining asosiy sabablari qanday?",
      "output": "Ko'ngil aynishining asosiy sabablari oziq-ovqat, gastroenterit, ovqat hazm qilish tizimi kasalliklari, migren yoki stressdan kelib chiqishi mumkin."
    },
    {
      "id": 876,
      "input": "Teri uchun qanday tabiiy parvarish vositalari mavjud?",
      "output": "Teri uchun tabiiy parvarish vositalari orasida asal, zaytun moyi, aloe vera va kokos moyi kabi moddalar mavjud."
    },
    {
      "id": 877,
      "input": "O'simliklarning sog'liqni saqlashdagi roli qanday?",
      "output": "O'simliklar, masalan, sarimsoq, zanjabil, lavanta va ekinezya immun tizimini mustahkamlash, yallig'lanishni kamaytirish va ruhiy holatni yaxshilashda yordam beradi."
    },
    {
      "id": 878,
      "input": "Jismoniy faollikning organizmga ta'siri qanday?",
      "output": "Jismoniy faollik yurak va qon tomir tizimini mustahkamlash, mushaklarni kuchaytirish, stressni kamaytirish va umumiy sog'liqni yaxshilashga yordam beradi."
    },
    {
      "id": 879,
      "input": "Urologik kasalliklar qanday davolanadi?",
      "output": "Urologik kasalliklar antibiotiklar, dori vositalari, fizioterapiya va ba'zan jarrohlik orqali davolanadi."
    },
    {
      "id": 880,
      "input": "Ko'zning quruqligi va alerjiya muammolarini qanday davolash mumkin?",
      "output": "Ko'zning quruqligi va alerjiya muammolarini ko'z tomchilari, antihistaminlar va namlovchi vositalar yordamida davolash mumkin."
    },
    {
      "id": 881,
      "input": "Qon to'kilishining sabablari qanday?",
      "output": "Qon to'kilishining sabablari jarohatlar, qon ivishining buzilishi, ichki qonamalar va qon tomirlarining yorilishi bo'lishi mumkin."
    },
    {
      "id": 882,
      "input": "Endometriozning asosiy belgilari qanday?",
      "output": "Endometriozning belgilari og'ir hayz ko'rish, qorin og'rig'i, qiyin homilador bo'lish va siydik chiqarishdagi muammolar bilan namoyon bo'ladi."
    },
    {
      "id": 883,
      "input": "Avtomobil avariyasida bo'lgan shikastlanishni qanday davolash mumkin?",
      "output": "Avtomobil avariyasida bo'lgan shikastlanishni fizioterapiya, og'riqni kamaytiruvchi dorilar va ba'zan jarrohlik yordamida davolash mumkin."
    },
    {
      "id": 884,
      "input": "Infeksiya qanday tarqaladi va undan qanday himoyalanish mumkin?",
      "output": "Infeksiya havo, to'g'ridan-to'g'ri aloqa yoki ifloslangan oziq-ovqat orqali tarqaladi. Yaxshi gigiena, toza qo'llar, maska kiyish va immun tizimini mustahkamlash muhim."
    },
    {
      "id": 885,
      "input": "Tananing ozuqa moddalarga bo'lgan ehtiyoji qanday aniqlanadi?",
      "output": "Tananing ozuqa moddalarga bo'lgan ehtiyoji qon tahlillari, fiziologik holat va shaxsiy ehtiyojlar asosida aniqlanadi."
    },
    {
      "id": 886,
      "input": "Yirik qon tomirlarining kasalliklari qanday aniqlanadi?",
      "output": "Yirik qon tomirlarining kasalliklari ultratovush tekshiruvi, kompyuter tomografiyasi (KT) va angiografiya yordamida aniqlanadi."
    },
    {
      "id": 887,
      "input": "Vaqtinchalik miya shikastlanishining belgilari qanday?",
      "output": "Vaqtinchalik miya shikastlanishining belgilari bosh og'rig'i, bosh aylanishi, yodlashda qiyinchiliklar va muvozanatni saqlashda qiyinchiliklar bo'lishi mumkin."
    },
    {
      "id": 888,
      "input": "Tiroid bezining kasalliklari qanday alomatlarga olib keladi?",
      "output": "Tiroid bezining kasalliklari charchoq, tez-tez sovuq yoki issiqlikka sezgirlik, teri o'zgarishlari va vazn o'zgarishlari bilan ko'rinadi."
    },
    {
      "id": 889,
      "input": "Yurak xuruji qanday oldini olish mumkin?",
      "output": "Yurak xuruji oldini olish uchun sigaret chekishni tashlash, sog'lom ovqatlanish, muntazam jismoniy faollik va stressni kamaytirish kerak."
    },
    {
      "id": 890,
      "input": "Homiladorlikda bo'lgan ayollarda qanday muammolar yuzaga kelishi mumkin?",
      "output": "Homiladorlikda qon bosimi ko'tarilishi, diabet, homiladorlik toksikozlari va homilalik sabablarga ko'ra og'riqlar yuzaga kelishi mumkin."
    },
    {
      "id": 891,
      "input": "Ko'zdagi glaukoma nima va uni qanday davolash mumkin?",
      "output": "Glaukoma ko'z ichidagi bosimning oshishi tufayli ko'rish qobiliyatining yo'qolishiga olib keladi. Dori-darmonlar, lazer terapiyasi yoki jarrohlik davolash usullari yordamida davolanadi."
    },
    {
      "id": 892,
      "input": "Semizlikning oldini olish uchun qanday maslahatlar mavjud?",
      "output": "Semizlikning oldini olish uchun sog'lom ovqatlanish, jismoniy faollikni oshirish va stressni boshqarish kerak."
    },
    {
      "id": 893,
      "input": "Akseleratsiya sindromi nima va qanday davolanadi?",
      "output": "Akseleratsiya sindromi tez-tez yurak urishlari, bosh og'rig'i va nafas qisishi bilan ko'rinadi, davolashda dori vositalari va dam olish kerak."
    },
    {
      "id": 894,
      "input": "Avtomobil va ishlov beruvchi texnikasida ishlashdan kelib chiqqan travmalarni qanday davolash mumkin?",
      "output": "Avtomobil va texnikalar bilan bog'liq travmalarni jarrohlik, fizioterapiya va og'riqni kamaytiruvchi dorilar bilan davolash mumkin."
    },
    {
      "id": 895,
      "input": "Buyrakdagi toshlar qanday paydo bo'ladi va ularni qanday davolash mumkin?",
      "output": "Buyrakdagi toshlar suyuqlik yetishmasligi va turli xil oziq-ovqatlar tufayli paydo bo'lishi mumkin. Ularni dori-darmonlar, suyuqlikni ko'paytirish va ba'zan jarrohlik yordamida davolash mumkin."
    },
    {
      "id": 896,
      "input": "Migrenni qanday davolash mumkin?",
      "output": "Migrenni davolashda og'riq qoldiruvchi dorilar, qahva ichish va stressni kamaytirish muhim rol o'ynaydi."
    },
    {
      "id": 897,
      "input": "Bosh miya shishini qanday aniqlash mumkin?",
      "output": "Bosh miya shishini magnet-rezonans tomografiyasi (MRT) va kompyuter tomografiyasi (KT) yordamida aniqlash mumkin."
    },
    {
      "id": 898,
      "input": "O'simtalar qanday shakllanadi va ular nima sababdan paydo bo'ladi?",
      "output": "O'simtalar hujayra bo'linishining nosozligi natijasida shakllanadi. Ular genetik, atrof-muhit yoki infektsiyalardan kelib chiqishi mumkin."
    },
    {
      "id": 899,
      "input": "Diabetning belgilari qanday?",
      "output": "Diabetning belgilari tez-tez chanqash, ortiqcha siydik chiqarish, charchoq va ko'rishdagi o'zgarishlar bo'lishi mumkin."
    },
    {
      "id": 900,
      "input": "Temir yetishmasligi qanday alomatlar keltirib chiqaradi?",
      "output": "Temir yetishmasligi charchoq, rangparlik, bosh aylanishi va nafas yetishmovchiligi kabi alomatlarga olib keladi."
    },
    {
      "id": 901,
      "input": "Yalang'och ko'rish qanday davolanadi?",
      "output": "Yalang'och ko'rishni davolashda ko'zga maxsus ishlov berish, vizual terapiya va ba'zan jarrohlik aralashuvi kerak bo'lishi mumkin."
    },
    {
      "id": 902,
      "input": "Tana haroratini o'lchash usullari qanday?",
      "output": "Tana haroratini o'lchash usullari og'iz, qo'ldan, quloqdan yoki rektal o'lchash orqali amalga oshiriladi."
    },
    {
      "id": 903,
      "input": "Astma va bronxit orasidagi farq nima?",
      "output": "Astma nafas olish yo'llarining yallig'lanishi va torayishi bilan xarakterlanadi, bronxit esa o'pka va bronxlarning yallig'lanishi bilan namoyon bo'ladi."
    },
    {
      "id": 904,
      "input": "Gemorroyni qanday davolash mumkin?",
      "output": "Gemorroyni davolashda dori-darmonlar, tibbiy krem va suyuqlikni ko'paytirish, ba'zan esa jarrohlik aralashuvi kerak bo'lishi mumkin."
    },
    {
      "id": 905,
      "input": "Qon quyish jarayoni qanday amalga oshiriladi?",
      "output": "Qon quyish jarayoni qon donori tomonidan olingan qonning zarur miqdorda qabul qilinishidan iborat bo'lib, maxsus shifoxonalarda amalga oshiriladi."
    },
    {
      "id": 906,
      "input": "Yuqumli kasalliklarning oldini olishda vaksinalar qanday rol o'ynaydi?",
      "output": "Vaksinalar yuqumli kasalliklarning oldini olishda immun tizimini mustahkamlashda va kasalliklarga qarshi himoya qilishda muhim rol o'ynaydi."
    },
    {
      "id": 907,
      "input": "Spinal jarohatlar qanday aniqlanadi?",
      "output": "Spinal jarohatlar rentgen tasvirga olish, kompyuter tomografiyasi (KT) yoki magnet-rezonans tomografiya (MRT) orqali aniqlanadi."
    },
    {
      "id": 908,
      "input": "Yangi tug'ilgan chaqaloqlar uchun qanday parvarish tavsiyalari mavjud?",
      "output": "Yangi tug'ilgan chaqaloqlarga muntazam oziqlantirish, gigiena, onaning emizikligi va bolani issiq tutish zarur."
    },
    {
      "id": 909,
      "input": "Uterus fibromalari nima va ular qanday davolanadi?",
      "output": "Uterus fibromalari bachadonning benign o'simtalaridir. Ularni dori-darmonlar, jarrohlik va ba'zan lazer terapiyasi yordamida davolash mumkin."
    },
    {
      "id": 910,
      "input": "Immun tizimi qanday mustahkamlanadi?",
      "output": "Immun tizimi to'g'ri ovqatlanish, muntazam sport, uyquni tiklash, stressni kamaytirish va zarur bo'lsa, vitaminlar yordamida mustahkamlanadi."
    },
    {
      "id": 911,
      "input": "Yallig'lanishga qarshi dori vositalari qanday ishlaydi?",
      "output": "Yallig'lanishga qarshi dorilar (NSAIDlar) og'riqni kamaytiradi, yallig'lanishni pasaytiradi va shishishni kamaytiradi."
    },
    {
      "id": 912,
      "input": "Tananing suv muvozanatini qanday saqlash kerak?",
      "output": "Tananing suv muvozanatini saqlash uchun kuniga etarli miqdorda suyuqlik ichish, quruq havodan saqlanish va jismoniy faollikda doimiy suv iste'mol qilish kerak."
    },
    {
      "id": 913,
      "input": "Kichik charchoqlarni qanday bartaraf etish mumkin?",
      "output": "Kichik charchoqlarni dam olish, oson jismoniy mashqlar, yaxshi uyqu va balansli ovqatlanish orqali bartaraf etish mumkin."
    },
    {
      "id": 914,
      "input": "O'pka to'lib ketishi qanday davolanadi?",
      "output": "O'pka to'lib ketishini davolashda nafas yo'llarini kengaytiruvchi dorilar va kislorod terapiyasi yordam beradi."
    },
    {
      "id": 915,
      "input": "Urologik infektsiyalarni qanday davolash mumkin?",
      "output": "Urologik infektsiyalar antibiotiklar va suyuqlikni ko'paytirish yordamida davolanadi."
    },
    {
      "id": 916,
      "input": "Astma kasalligi qanday oldini olish mumkin?",
      "output": "Astma oldini olish uchun allergiyalardan saqlanish, dori-darmonlar va nafas olish mashqlari tavsiya etiladi."
    },
    {
      "id": 917,
      "input": "Yuzdagi akne kasalligi qanday davolash mumkin?",
      "output": "Yuzdagi akne dori-darmonlar, yuzni toza saqlash va maxsus kremlar yordamida davolash mumkin."
    },
    {
      "id": 918,
      "input": "Cholesterin darajasini qanday nazorat qilish kerak?",
      "output": "Cholesterin darajasini nazorat qilish uchun sog'lom ovqatlanish, jismoniy faollik va zarur hollarda dori-darmonlar qo'llaniladi."
    },
    {
      "id": 919,
      "input": "Stressni qanday boshqarish mumkin?",
      "output": "Stressni boshqarish uchun meditatsiya, yoga, jismoniy faollik va nafas olish mashqlari foydali."
    },
    {
      "id": 920,
      "input": "Xolesterin miqdorini qanday kamaytirish mumkin?",
      "output": "Xolesterin miqdorini kamaytirish uchun sog'lom yog'lar, kam yog'li oziq-ovqatlar va muntazam jismoniy faollik zarur."
    },
    {
      "id": 921,
      "input": "Qon bosimi qanday o'lchanadi?",
      "output": "Qon bosimi shtangada yoki avtomatik o'lchov asboblari yordamida o'lchanadi."
    },
    {
      "id": 922,
      "input": "Allergiyalarga qanday dori vositalari yordam beradi?",
      "output": "Allergiyalarga qarshi antihistaminlar, kortikosteroidlar va dekonjestanlar ishlatiladi."
    },
    {
      "id": 923,
      "input": "Yana qanday usullar orqali immun tizimini mustahkamlash mumkin?",
      "output": "Immun tizimini mustahkamlash uchun muntazam jismoniy faollik, ijobiy fikrlash, to'g'ri uyqu va vitaminlar zarur."
    },
    {
      "id": 924,
      "input": "Ayollarda osteoporozni qanday aniqlash mumkin?",
      "output": "Osteoporozni aniqlash uchun osteodensitometriya (suyaq densitometriya) va qon tahlillari o'tkaziladi."
    },
    {
      "id": 925,
      "input": "Yallig'lanishning asosiy sabablari qanday?",
      "output": "Yallig'lanish infektsiyalar, travmalar, autoimmune kasalliklar va toksinlardan kelib chiqishi mumkin."
    },
    {
      "id": 926,
      "input": "Semizlikning sabablarini qanday aniqlash mumkin?",
      "output": "Semizlikning sabablari tahlillar, genetik omillar va turmush tarzini o'rganish orqali aniqlanadi."
    },
    {
      "id": 927,
      "input": "Homiladorlikda qalqonsimon bezni tekshirish kerakmi?",
      "output": "Ha, homiladorlikda qalqonsimon bezni tekshirish kerak, chunki uning disfunktsiyasi homiladorlikni murakkablashtirishi mumkin."
    },
    {
      "id": 928,
      "input": "O'pka saratoni qanday aniqlanadi?",
      "output": "O'pka saratoni rentgen, kompyuter tomografiyasi (KT) va bronxioskopiya yordamida aniqlanadi."
    },
    {
      "id": 929,
      "input": "Asab tizimining sog'lom ishlashi uchun qanday maslahatlar mavjud?",
      "output": "Asab tizimi uchun yaxshi uyqu, stressni kamaytirish, sog'lom ovqatlanish va jismoniy faollik muhimdir."
    },
    {
      "id": 930,
      "input": "Urushda yoki falokatda zararlangan organizmni qanday davolash mumkin?",
      "output": "Urushda yoki falokatda zararlangan organizmni tezda tibbiy yordam, antibiotiklar va stressni kamaytiruvchi usullar yordamida davolash mumkin."
    },
    {
      "id": 931,
      "input": "Yallig'lanishga qarshi dori vositalarining turi qanday?",
      "output": "Yallig'lanishga qarshi dorilar (NSAIDlar), kortikosteroidlar va biologik dori vositalari mavjud."
    },
    {
      "id": 932,
      "input": "O'zini o'zi tekshirishda qanday xatoliklar bo'lishi mumkin?",
      "output": "O'zini o'zi tekshirishda noto'g'ri texnika, vaqtning noto'g'ri tanlanishi va e'tiborsizlik kabi xatoliklar bo'lishi mumkin."
    },
    {
      "id": 933,
      "input": "Ko'zdagi qurish va qizarish qanday davolash mumkin?",
      "output": "Ko'zdagi qurish va qizarish uchun ko'z tomchilari, namlovchi vositalar va ko'z gigienasiga e'tibor berish kerak."
    },
    {
      "id": 934,
      "input": "Ayollarda og'ir hayz ko'rishining sabablari nimalar?",
      "output": "Ayollarda og'ir hayz ko'rishining sabablari gormonal muvozanat, endometrioz, miyomalar yoki stress bo'lishi mumkin."
    },
    {
      "id": 935,
      "input": "Beshik kasalligi nima va uni qanday davolash mumkin?",
      "output": "Beshik kasalligi o'simliklar yoki zamburug'lar tomonidan keltiriladi va ularni antibiotiklar yoki antifungal dorilar yordamida davolash mumkin."
    },
    {
      "id": 936,
      "input": "Buyrak kasalliklari qanday alomatlar keltiradi?",
      "output": "Buyrak kasalliklari siydikdagi o'zgarishlar, charchoq, shishish va yuqori qon bosimi kabi alomatlar bilan ko'rinadi."
    },
    {
      "id": 937,
      "input": "Miya qon ketishining asosiy sabablari qanday?",
      "output": "Miya qon ketishining sabablari qon tomirlarining yorilishi, jarohatlar yoki yuqumli kasalliklar bo'lishi mumkin."
    },
    {
      "id": 938,
      "input": "O'pka yallig'lanishini qanday oldini olish mumkin?",
      "output": "O'pka yallig'lanishini oldini olish uchun sigaret chekishni tashlash, gripp va pneumokokk vaktsinalarini olish, toza havada nafas olish zarur."
    },
    {
      "id": 939,
      "input": "Spinal jarohatlar qanday paydo bo'ladi?",
      "output": "Spinal jarohatlar yuqori tezlikda harakatlar, avariyalar yoki ortiqcha yuklanish natijasida yuzaga kelishi mumkin."
    },
    {
      "id": 940,
      "input": "Reproduktiv tizim kasalliklarini qanday aniqlash mumkin?",
      "output": "Reproduktiv tizim kasalliklarini ginekologik tekshiruvlar, ultratovush va qon tahlillari yordamida aniqlash mumkin."
    },
    {
      "id": 941,
      "input": "Suyak sindirishning asosiy sabablari qanday?",
      "output": "Suyak sindirishining asosiy sabablari kuchli zarbalar, yiqilishlar yoki osteoporoz kabi suyak kasalliklaridir."
    },
    {
      "id": 942,
      "input": "Miya shikastlanishlarini qanday davolash mumkin?",
      "output": "Miya shikastlanishlarini davolashda jarrohlik, fizioterapiya va dori-darmonlar yordamida asoratlardan qochish mumkin."
    },
    {
      "id": 943,
      "input": "O'pkada yallig'lanish qanday belgilarga ega?",
      "output": "O'pkada yallig'lanish yo'tal, nafas qisishi, isitma, terlash va og'riq bilan ko'rinadi."
    },
    {
      "id": 944,
      "input": "Meningitni qanday davolash mumkin?",
      "output": "Meningitni antibiotiklar, antiviral dori-darmonlar va ba'zan hospitalizatsiya orqali davolash mumkin."
    },
    {
      "id": 945,
      "input": "Ko'zdagi qizil dog'lar va shishlar qanday davolash mumkin?",
      "output": "Ko'zdagi qizil dog'lar va shishlar ko'z tomchilari va antibakterial yoki yallig'lanishga qarshi dori vositalari bilan davolash mumkin."
    },
    {
      "id": 946,
      "input": "Qon shakar darajasini qanday nazorat qilish mumkin?",
      "output": "Qon shakar darajasini nazorat qilish uchun dietaga e'tibor berish, jismoniy faollikni oshirish va insulin yoki dori-darmonlardan foydalanish kerak."
    },
    {
      "id": 947,
      "input": "Jigarni tozalashning samarali usullari qanday?",
      "output": "Jigarni tozalash uchun sog'lom ovqatlanish, ko'p suyuqlik ichish, meva va sabzavotlarni ko'paytirish zarur."
    },
    {
      "id": 948,
      "input": "Yomg'irda uzoq vaqt qolish qanday kasalliklarga olib kelishi mumkin?",
      "output": "Yomg'irda uzoq vaqt qolish gripp, o'pka yallig'lanishi va teri kasalliklariga olib kelishi mumkin."
    },
    {
      "id": 949,
      "input": "O'pka saratonining asosiy sabablari nimalar?",
      "output": "O'pka saratoni ko'pincha chekish, havodagi zararli moddalar va genetik omillar tufayli yuzaga keladi."
    },
    {
      "id": 950,
      "input": "Yangi tug'ilgan chaqaloqlarda emizishning afzalliklari nimalar?",
      "output": "Yangi tug'ilgan chaqaloqlar uchun emizish immun tizimini mustahkamlash, to'liq ozuqa va psixologik rivojlanish uchun foydali."
    },
    {
      "id": 951,
      "input": "Yog'li jigar qanday aniqlanadi?",
      "output": "Yog'li jigar ultratovush tekshiruvi, qon tahlillari va ba'zan jigar biopsiyasi orqali aniqlanadi."
    },
    {
      "id": 952,
      "input": "Bo'g'imlardagi og'riqlarni qanday davolash mumkin?",
      "output": "Bo'g'imlardagi og'riqlarni og'riq qoldiruvchi dorilar, fizioterapiya va issiq yoki sovuq kompresslar yordamida davolash mumkin."
    },
    {
      "id": 953,
      "input": "Yuqumli kasalliklardan himoyalanish uchun qanday chora-tadbirlar ko'rish kerak?",
      "output": "Yuqumli kasalliklardan himoyalanish uchun toza qo'llar, vaksinalar, uzoqdan kontakt qilishdan saqlanish va maske kiyish muhimdir."
    },
    {
      "id": 954,
      "input": "O'pkada qon ketishining sabablari nimalar?",
      "output": "O'pkada qon ketishining sabablari infeksiyalar, o'pka saratoni, yurak kasalliklari yoki ba'zi dori vositalarining yon ta'siri bo'lishi mumkin."
    },
    {
      "id": 955,
      "input": "Cholesterin miqdorini nazorat qilishda qanday ovqatlanish tavsiya etiladi?",
      "output": "Cholesterin miqdorini nazorat qilishda to'yinmagan yog'lar, meva va sabzavotlar, baliq va tovuq go'shti kabi oziq-ovqatlar tavsiya etiladi."
    },
    {
      "id": 956,
      "input": "Shikastlanishdan keyingi reabilitatsiya jarayoni qanday bo'lishi kerak?",
      "output": "Shikastlanishdan keyingi reabilitatsiya jarayoni fizioterapiya, mashqlar va oqilona dam olishni o'z ichiga oladi."
    },
    {
      "id": 957,
      "input": "Astma bilan og'rigan insonlar qanday tozalovchi vositalardan foydalanishi kerak?",
      "output": "Astma bilan og'riganlar nafas olish yo'llarini ochuvchi inhalyatorlar va nebulayzerlar yordamida o'z holatini nazorat qilishlari kerak."
    },
    {
      "id": 958,
      "input": "Diabetni qanday aniqlash mumkin?",
      "output": "Diabetni qon shakar darajasi va qonda glyukoza darajasini o'lchash orqali aniqlash mumkin."
    },
    {
      "id": 959,
      "input": "Yurakni tekshirishda qanday tahlillar o'tkaziladi?",
      "output": "Yurakni tekshirishda EKG, ekokardiografiya, stress testlari va qon tahlillari o'tkaziladi."
    },
    {
      "id": 960,
      "input": "Allergiya bilan bog'liq simptomlarni qanday kamaytirish mumkin?",
      "output": "Allergiya simptomlarini kamaytirish uchun antihistaminlar, burun spreylar va allergiyaga qarshi vaksinalar ishlatiladi."
    },
    {
      "id": 961,
      "input": "Avitaminoz qanday belgilar bilan ko'rinadi?",
      "output": "Avitaminoz belgilariga charchoq, terining qurishi, immunitetning pasayishi va ko'rishdagi o'zgarishlar kiradi."
    },
    {
      "id": 962,
      "input": "Sigaret chekishni tashlashda qanday yordam olish mumkin?",
      "output": "Sigaret chekishni tashlash uchun nikotin almashtiruvchi terapiya, psixologik yordam va qo'llab-quvvatlash guruhlari yordam beradi."
    },
    {
      "id": 963,
      "input": "Gormonal disfunktsiya qanday aniqlanadi?",
      "output": "Gormonal disfunktsiya qon tahlillari, ultratovush tekshiruvlari va ginekologik tekshiruvlar orqali aniqlanadi."
    },
    {
      "id": 964,
      "input": "Mikroskopik hematuriyaa qanday holatda yuzaga keladi?",
      "output": "Mikroskopik hematuriyaa buyrak kasalliklari, yallig'lanish, yoki o'tkir shikastlanish tufayli yuzaga kelishi mumkin."
    },
    {
      "id": 965,
      "input": "Yo'talning turli turlari qanday farqlanadi?",
      "output": "Yo'talning o'rtacha va uzoq muddatli turlari, yengil va jiddiy yo'tal belgilari farqlanadi. Yo'talning sabablari infeksiyalar yoki allergiyalarga bog'liq bo'lishi mumkin."
    },
    {
      "id": 966,
      "input": "Skleroz qanday kasallik va u qanday alomatlar keltiradi?",
      "output": "Skleroz asab tizimining kasalligi bo'lib, nerv tolalarining yallig'lanishi va demans, mushaklarning zaiflashishi kabi alomatlar keltiradi."
    },
    {
      "id": 967,
      "input": "Yallig'lanishga qarshi dorilar qanday ishlaydi?",
      "output": "Yallig'lanishga qarshi dorilar, ayniqsa NSAIDlar, og'riqni kamaytiradi va yallig'lanishni pasaytiradi."
    },
    {
      "id": 968,
      "input": "O'pka saratonidan himoya qilish uchun qanday choralar ko'rish kerak?",
      "output": "O'pka saratonidan himoya qilish uchun chekishdan saqlanish, havodagi zararli moddalar bilan aloqa qilishdan saqlanish va muntazam tekshiruvlar o'tkazish zarur."
    },
    {
      "id": 969,
      "input": "Pankreatit qanday kasallik va qanday davolash mumkin?",
      "output": "Pankreatit oshqozon osti bezining yallig'lanishidir, u dori-darmonlar, dietalar va ba'zan jarrohlik yordamida davolanadi."
    },
    {
      "id": 970,
      "input": "Suyak sinishi qanday davolanadi?",
      "output": "Suyak sinishi immobilizatsiya qilish, tibbiy yordam olish va qayta tiklanish uchun fizioterapiya bilan davolanadi."
    },
    {
      "id": 971,
      "input": "O'zini-o'zi tekshirishda qanday usullar muhimdir?",
      "output": "O'zini-o'zi tekshirishda teri va ko'zlarni tekshirish, qon bosimi, qondagi shakar va xolesterin darajalarini o'lchash muhimdir."
    },
    {
      "id": 972,
      "input": "Semizlikning davolash usullari nimalar?",
      "output": "Semizlikni davolashda sog'lom ovqatlanish, jismoniy faollik, va ba'zan tibbiy yordam yoki jarrohlik usullari qo'llaniladi."
    },
    {
      "id": 973,
      "input": "Yurak xuruji paytida qanday chora-tadbirlar ko'rish kerak?",
      "output": "Yurak xuruji paytida tez yordam chaqirish, nafas olishni to'g'ri boshqarish va salbiy oqibatlarni kamaytirish muhimdir."
    },
    {
      "id": 974,
      "input": "Teri saratoni qanday aniqlanadi?",
      "output": "Teri saratoni terining maxsus tekshiruvlari, biopsiya va dermatologik tekshiruvlar yordamida aniqlanadi."
    },
    {
      "id": 975,
      "input": "Tananing suvsizlanishi qanday alomatlar bilan ko'rinadi?",
      "output": "Tananing suvsizlanishi bosh og'rig'i, teri qurishi, charchoq va quruq og'iz kabi alomatlar bilan ko'rinadi."
    },
    {
      "id": 976,
      "input": "Bog'liq tibbiy kasalliklar va ularni qanday oldini olish mumkin?",
      "output": "Bog'liq tibbiy kasalliklar, masalan, diabet va yurak kasalliklarini sog'lom turmush tarzini olib borish, dietani nazorat qilish va muntazam jismoniy faollik orqali oldini olish mumkin."
    },
    {
      "id": 977,
      "input": "O'pka yallig'lanishidan qanday himoyalanish mumkin?",
      "output": "O'pka yallig'lanishidan himoyalanish uchun toza havada nafas olish, vaksinalar va sigaret chekishni tashlash zarur."
    },
    {
      "id": 978,
      "input": "Teri kasalliklari qanday davolash mumkin?",
      "output": "Teri kasalliklarini to'g'ri tozalash, dori-darmonlar va dermatologik maslahatlar bilan davolash mumkin."
    },
    {
      "id": 979,
      "input": "Mikrobiyomning sog'likka ta'siri qanday?",
      "output": "Mikrobiyom ovqat hazm qilish tizimining muvozanatini saqlashga yordam beradi va immun tizimi uchun zarurdir."
    },
    {
      "id": 980,
      "input": "Avtomobilni haydashdan keyin og'riqni qanday kamaytirish mumkin?",
      "output": "Avtomobilni haydashdan keyin og'riqni davolashda muskulni cho'zish, issiq kompresslar va fizioterapiya yordam beradi."
    },
    {
      "id": 981,
      "input": "Yuqumli kasalliklarni qanday oldini olish mumkin?",
      "output": "Yuqumli kasalliklarni oldini olish uchun gigiena qoidalariga rioya qilish, vaksinalar va muntazam sanitariya choralari muhimdir."
    },
    {
      "id": 982,
      "input": "Oyoqdagi varikozni qanday davolash mumkin?",
      "output": "Oyoqdagi varikozni kompressiya so'ndalar, jarrohlik yoki lazer terapiyasi yordamida davolash mumkin."
    },
    {
      "id": 983,
      "input": "Homiladorlikda qon ketishining sabablari nimalar?",
      "output": "Homiladorlikda qon ketishi tushish xavfi, ektopik homiladorlik yoki boshqa tibbiy muammolar bilan bog'liq bo'lishi mumkin."
    },
    {
      "id": 984,
      "input": "Siqilishdan kelib chiqqan og'riqlarni qanday davolash mumkin?",
      "output": "Siqilishdan kelib chiqqan og'riqlarni issiq kompresslar, fizioterapiya va dori-darmonlar yordamida davolash mumkin."
    },
    {
      "id": 985,
      "input": "Nevrasteniya nima va uning belgilari qanday?",
      "output": "Nevrasteniya asab tizimining zaiflashishi bo'lib, charchoq, bezovtalik, uyqusizlik va bosh og'rig'i kabi alomatlar bilan namoyon bo'ladi."
    },
    {
      "id": 986,
      "input": "Xatoliklar yuz beradigan operatsion jarayonlarda qanday ehtiyot choralari ko'riladi?",
      "output": "Operatsion jarayonlarda ehtiyot choralari sifatida jarrohlar malakasi, sanitariya qoidalariga rioya qilish va anesteziologik monitoring amalga oshiriladi."
    },
    {
      "id": 987,
      "input": "Kattalarda allergiya qanday davolanadi?",
      "output": "Kattalarda allergiya antihistaminlar, kortikosteroidlar, burun spreylari va allergiyaga qarshi in'ektsiyalar yordamida davolash mumkin."
    },
    {
      "id": 988,
      "input": "Gripp va sovuq urishining farqlari qanday?",
      "output": "Grippda isitma, mushaklarda og'riq, kuchli charchoq va yo'tal kuzatiladi, sovuq urishda esa ko'proq burun to'silishi va yo'tal bo'ladi."
    },
    {
      "id": 989,
      "input": "Buyrak kasalliklarini qanday oldini olish mumkin?",
      "output": "Buyrak kasalliklarini oldini olish uchun muntazam ravishda suyuqlik ichish, tuz iste'molini cheklash va jismoniy faollikni saqlash zarur."
    },
    {
      "id": 990,
      "input": "Yangi tug'ilgan chaqaloqlarda emizishning ahamiyati qanday?",
      "output": "Yangi tug'ilgan chaqaloqlarda emizish immun tizimini mustahkamlash, o'sish va rivojlanishni qo'llab-quvvatlash uchun juda muhimdir."
    },
    {
      "id": 991,
      "input": "Ortiqcha vaznni qanday kamaytirish mumkin?",
      "output": "Ortiqcha vaznni kamaytirish uchun to'g'ri ovqatlanish, jismoniy faollik va kerakli hollarda dori-darmonlar yoki jarrohlik usullari qo'llaniladi."
    },
    {
      "id": 992,
      "input": "Diabetni qanday oldini olish mumkin?",
      "output": "Diabetni oldini olish uchun sog'lom turmush tarzi, balansli ovqatlanish, vaznni nazorat qilish va muntazam jismoniy faollik zarur."
    },
    {
      "id": 993,
      "input": "Neft sanoatida ishlovchilarda qanday sog'liq muammolari yuzaga keladi?",
      "output": "Neft sanoatida ishlovchilar kimyoviy moddalar bilan aloqada bo'lib, nafas olish tizimi kasalliklari, teri kasalliklari va allergiyalarni rivojlantirishlari mumkin."
    },
    {
      "id": 994,
      "input": "Qon bosimining yuqoriligi nima va uni qanday nazorat qilish kerak?",
      "output": "Qon bosimining yuqoriligi yurak va qon tomir kasalliklariga olib kelishi mumkin, uni nazorat qilish uchun dorilar, sog'lom turmush tarzi va oziqlanish zarur."
    },
    {
      "id": 995,
      "input": "Semizlikning ta'siri sog'liq uchun qanday?",
      "output": "Semizlik yurak kasalliklari, diabet, qon bosimining oshishi va bo'g'imlardagi muammolarni keltirib chiqarishi mumkin."
    },
    {
      "id": 996,
      "input": "Pankreatit qanday kasallik va uni qanday davolash mumkin?",
      "output": "Pankreatit oshqozon osti bezining yallig'lanishidir va uni dori-darmonlar, antibiotiklar va dietalar yordamida davolash mumkin."
    },
    {
      "id": 997,
      "input": "Ko'zdagi yallig'lanishlarni qanday davolash mumkin?",
      "output": "Ko'zdagi yallig'lanishni antibiotiklar, ko'z tomchilari va maxsus yallig'lanishga qarshi dori vositalari yordamida davolash mumkin."
    },
    {
      "id": 998,
      "input": "Piyodalikka qarshi qanday dori vositalari mavjud?",
      "output": "Piyodalikka qarshi dori vositalari antifungal krem yoki dori-darmonlar yordamida davolanadi."
    },
    {
      "id": 999,
      "input": "O'pka kasalliklarini qanday oldini olish mumkin?",
      "output": "O'pka kasalliklarini oldini olish uchun chekishdan saqlanish, havoni toza saqlash va gripp va pneumokokk vaktsinalarini olish zarur."
    },
    {
      "id": 1000,
      "input": "Urologik kasalliklarni qanday davolash mumkin?",
      "output": "Urologik kasalliklar antibiotiklar, dori-darmonlar va ba'zan jarrohlik amaliyotlari yordamida davolash mumkin."
    },
    {
      "id": 1001,
      "input": "Tananing suvsizlanishini qanday oldini olish mumkin?",
      "output": "Tananing suvsizlanishini oldini olish uchun kun davomida etarlicha suyuqlik ichish va issiq havo sharoitida ehtiyotkorlik bilan faoliyat ko'rsatish zarur."
    },
    {
      "id": 1002,
      "input": "Raqamli texnologiyalar sog'liqni qanday ta'sir qiladi?",
      "output": "Raqamli texnologiyalar, ayniqsa uzoq vaqt davomida kompyuter yoki telefon ekraniga qarash, ko'zning qizarishi, bosh og'rig'i va uyqusizlikka olib kelishi mumkin."
    },
    {
      "id": 1003,
      "input": "Migrenning sabablari qanday?",
      "output": "Migrenning sabablari asosan genetik, muhit omillari, stress, oziq-ovqatlar va gormonal o'zgarishlarga bog'liq."
    },
    {
      "id": 1004,
      "input": "Ko'zning yorqinligini qanday yaxshilash mumkin?",
      "output": "Ko'zning yorqinligini yaxshilash uchun yoritish sharoitlarini to'g'ri sozlash, ko'z dam olish, muvozanatli ovqatlanish zarur."
    },
    {
      "id": 1005,
      "input": "Spinal jarohatlarda qanday reabilitatsiya usullari mavjud?",
      "output": "Spinal jarohatlar uchun reabilitatsiya usullari fizioterapiya, suzish, mushaklarni kuchaytirish va psixologik yordamni o'z ichiga oladi."
    },
    {
      "id": 1006,
      "input": "Jigarni tozalash qanday amalga oshiriladi?",
      "output": "Jigarni tozalash uchun sog'lom oziqlanish, ko'p suyuqlik ichish va maxsus ovqatlar, masalan, limon va zaytun moyi iste'mol qilish foydali."
    },
    {
      "id": 1007,
      "input": "Yaxshi uyqu uchun qanday tavsiyalar mavjud?",
      "output": "Yaxshi uyqu uchun muntazam uyqu rejimi, toza va qulay yotish joyi, ekranlardan uzoqlashish va stressni kamaytirish muhimdir."
    },
    {
      "id": 1008,
      "input": "Kichik bolalarda emizishning eng yaxshi davri qanday?",
      "output": "Kichik bolalarda emizishning eng yaxshi davri tug'ilgandan keyin birinchi 6 oy davomida amalga oshiriladi."
    },
    {
      "id": 1009,
      "input": "Oyoqdagi shishishlar qanday davolash mumkin?",
      "output": "Oyoqdagi shishishlarni issiq kompresslar, ko'tarilgan oyoqlar va yengil jismoniy faollik yordamida davolash mumkin."
    },
    {
      "id": 1010,
      "input": "Ba'zi dorilarni qabul qilishda qanday ehtiyot choralari ko'rish kerak?",
      "output": "Dorilarni qabul qilishda ularning yon ta'siri, dozasi va boshqa dorilar bilan o'zaro ta'sirini hisobga olish zarur."
    },
    {
      "id": 1011,
      "input": "Shifokorlar qaysi tahlillarni olishni maslahat beradilar?",
      "output": "Shifokorlar qon tahlillari, rentgen, EKG, ultratovush va boshqa diagnostik usullarni amalga oshirishni maslahat beradilar."
    },
    {
      "id": 1012,
      "input": "Alergiyaga qarshi vaksinalar qanday ta'sir qiladi?",
      "output": "Alergiyaga qarshi vaksinalar allergik reaktsiyalarni kamaytirish uchun immun tizimini o'zgartiradi va davomiy ta'sir ko'rsatadi."
    },
    {
      "id": 1013,
      "input": "Psixologik yordam qanday kasalliklarni davolashda foydalidir?",
      "output": "Psixologik yordam depressiya, bezovtalik, stress va travma bo'yicha yordam beradi."
    },
    {
      "id": 1014,
      "input": "Yangi tug'ilgan chaqaloqlarda qanday sog'liq tekshiruvlari o'tkaziladi?",
      "output": "Yangi tug'ilgan chaqaloqlarda qon tahlillari, jismoniy tekshiruvlar, va kerakli vaksinalar o'tkaziladi."
    },
    {
      "id": 1015,
      "input": "Kalluslar nima va ularni qanday davolash mumkin?",
      "output": "Kalluslar terining qalinlashgan qismidir, ularni yumshatish uchun sovunli suvda namlash va kerak bo'lsa, maxsus krem yoki pedikür yordamida davolash mumkin."
    },
    {
      "id": 1016,
      "input": "Jigar sirrozi nima va uning davolash usullari qanday?",
      "output": "Jigar sirrozi jigar to'qimasining shikastlanishi va izdan chiqishidir, uni dori-darmonlar, dietalar va ba'zan jarrohlik yordamida davolash mumkin."
    },
    {
      "id": 1017,
      "input": "Yuqori qon bosimining belgilari qanday?",
      "output": "Yuqori qon bosimi bosh og'rig'i, ko'z oldida nuqtalar ko'rish, nafas qisilishi va og'ir charchoq bilan ko'rinishi mumkin."
    },
    {
      "id": 1018,
      "input": "Diabetda qand miqdorini nazorat qilishning muhimligi nimada?",
      "output": "Diabetda qand miqdorini nazorat qilish zarur, chunki bu yurak kasalliklari, buyrak kasalliklari va asab tizimi muammolarining oldini olishga yordam beradi."
    },
    {
      "id": 1019,
      "input": "Astma nima va uning davolash usullari qanday?",
      "output": "Astma nafas olish yo'llarining yallig'lanishi va torayishidan kelib chiqadi, u inhalyatorlar, dori-darmonlar va yallig'lanishga qarshi vositalar yordamida davolanadi."
    },
    {
      "id": 1020,
      "input": "Yuqumli kasalliklarni qanday oldini olish mumkin?",
      "output": "Yuqumli kasalliklarni oldini olish uchun gigiena, muntazam yuvinish, vaksinalar va yaxshi sanitariya sharoitlarini ta'minlash muhimdir."
    },
    {
      "id": 1021,
      "input": "Yurak xuruji paytida qanday yordam ko'rsatish kerak?",
      "output": "Yurak xuruji paytida tez yordam chaqirish, odamni yotqizish va nafas olishni osonlashtirish zarur."
    },
    {
      "id": 1022,
      "input": "Sinishdan keyingi jarohatlarni qanday davolash kerak?",
      "output": "Sinishdan keyingi jarohatni davolash uchun oyoqni ko'tarish, muz qo'yish va jarohatni immobilizatsiya qilish zarur."
    },
    {
      "id": 1023,
      "input": "O'pka saratonining oldini olish uchun qanday choralar ko'rish kerak?",
      "output": "O'pka saratonining oldini olish uchun chekishdan saqlanish, havoni toza saqlash va muntazam ravishda tekshiruvlar o'tkazish zarur."
    },
    {
      "id": 1024,
      "input": "Teri saratoni qanday aniqlanadi?",
      "output": "Teri saratoni terining o'zgarishlari, moles yoki dog'larning o'zgarishi orqali aniqlanadi va dermatolog tomonidan tekshiriladi."
    },
    {
      "id": 1025,
      "input": "Shikastlanishlar uchun qanday og'riqni kamaytirish usullari mavjud?",
      "output": "Shikastlanishlar uchun og'riqni kamaytirish usullari sifatida og'riq qoldiruvchi dorilar, sovuq kompresslar va fizioterapiya ishlatiladi."
    },
    {
      "id": 1026,
      "input": "Yangi tug'ilgan chaqaloqlarni qanday boqish kerak?",
      "output": "Yangi tug'ilgan chaqaloqlarni emizish, qo'llab-quvvatlash va gigienaga e'tibor berish muhimdir."
    },
    {
      "id": 1027,
      "input": "Immunitetni kuchaytirish uchun qanday choralar ko'rish kerak?",
      "output": "Immunitetni kuchaytirish uchun yaxshi ovqatlanish, muntazam sport bilan shug'ullanish, dam olish va stressni kamaytirish zarur."
    }
  ]