[
    {
      "id": 1,
      "input": "San'at va qo'l mehnati o'rtasidagi farq nima?",
      "output": "San'at ijodiy ifodaning bir turi bo'lib, ko'pincha estetik qiymatga ega, qo'l mehnati esa amaliy va funksional maqsadlar uchun bajariladi."
    },
    {
      "id": 2,
      "input": "San'at asarini yaratishda qo'l mehnatining roli qanday?",
      "output": "Qo'l mehnati san'at asarini yaratishda texnik va materiallarni ishlatishda asosiy vosita bo'lib xizmat qiladi, bu asarning sifatiga katta ta'sir ko'rsatadi."
    },
    {
      "id": 3,
      "input": "Qo'l mehnati va san'atni birlashtirgan misollar bormi?",
      "output": "Xalq san'ati va hunarmandchilik, masalan, an'anaviy naqshinkor kiyimlar, keramika, temirchilik va yog'och o'ymakarligi san'at va qo'l mehnatining uyg'unlashgan shakllaridir."
    },
    {
      "id": 4,
      "input": "San'at asarini yaratishda qaysi materiallar eng ko'p ishlatiladi?",
      "output": "Yog'och, metall, gil, to'qimachilik matolar, bo'yoqlar va marmar kabi materiallar san'at asarlarini yaratishda keng tarqalgan."
    },
    {
      "id": 5,
      "input": "Qo'l mehnati qanday ijtimoiy ahamiyatga ega?",
      "output": "Qo'l mehnati ijtimoiy ahamiyatga ega, chunki u ishchilarning bilim va ko'nikmalarini aks ettiradi, hamda madaniyat va tarixni saqlashda yordam beradi."
    },
    {
      "id": 6,
      "input": "San'at va qo'l mehnatining iqtisodiy ahamiyati qanday?",
      "output": "Iqtisodiy jihatdan, san'at va qo'l mehnati sanoatlari turli hunarmandchilik, turizm va savdo sohalarini rivojlantirishga yordam beradi."
    },
    {
      "id": 7,
      "input": "Qo'l mehnati bilan yaratilgan san'at asarlari qanday qiymatga ega?",
      "output": "Bunday asarlar o'zining originaligi, mehnat sarfi va an'anaviy texnikalarga bog'liq bo'lib, ko'pincha noyob va qimmatli san'at asarlari sifatida qadrlanadi."
    },
    {
      "id": 8,
      "input": "San'at asarlari yaratishda texnikaning roli qanday?",
      "output": "Texnika san'at asarining sifatini belgilaydi va ijodkorlik jarayonini yaxshilaydi."
    },
    {
      "id": 9,
      "input": "Qo'l mehnatining zamonaviy san'atda o'rni qanday?",
      "output": "Zamonaviy san'atda qo'l mehnati texnologiya bilan uyg'unlashib, yangi forma va uslublarni yaratishda ishlatiladi."
    },
    {
      "id": 10,
      "input": "San'at asarlarini yaratishda kreativlik qanday rol o'ynaydi?",
      "output": "Kreativlik san'at asarining estetik qiymatini oshiradi va yangi ijodiy yo'nalishlarni ochadi."
    },
    {
      "id": 11,
      "input": "Qo'l mehnati san'atining qanday tarixiy taraqqiyot bosqichlari mavjud?",
      "output": "Tarixiy taraqqiyotda qo'l mehnati avval amaliy ehtiyojlar uchun, keyinchalik esa estetik va san'at asari sifatida rivojlangan."
    },
    {
      "id": 12,
      "input": "Xalq san'ati va qo'l mehnati qanday farqlanadi?",
      "output": "Xalq san'ati an'anaviy uslublarga asoslanib, jamiyatning madaniy an'analarini aks ettirsa, qo'l mehnati esa amaliy mehnatning natijasidir."
    },
    {
      "id": 13,
      "input": "Qo'l mehnati san'atiga o'rgatishning muhimligi nima?",
      "output": "Bu san'atni qadrlash, texnikani o'rganish va an'anaviy hunarlarni saqlashda muhimdir."
    },
    {
      "id": 14,
      "input": "Zamonaviy san'atda qo'l mehnati qanday ishlatiladi?",
      "output": "Zamonaviy san'atda qo'l mehnati texnologiyalar bilan birga yangi shakllar va uslublar yaratishda ishlatiladi."
    },
    {
      "id": 15,
      "input": "San'at va qo'l mehnati o'rtasidagi bog'liqlikni qanday tushunasiz?",
      "output": "Har ikkala soha ijodkorlik va texnikaning uyg'unlashuvi bilan bog'liq bo'lib, san'at asarlari ko'pincha qo'l mehnatining natijasi bo'ladi."
    },
    {
      "id": 16,
      "input": "Qo'l mehnati mahsulotlari qanday materiallardan yaratiladi?",
      "output": "Yog'och, tosh, metall, gil, mato, va boshqa tabiiy materiallar qo'l mehnati mahsulotlarida keng qo'llaniladi."
    },
    {
      "id": 17,
      "input": "San'at asarlari va qo'l mehnati asarlari o'rtasidagi qiymat farqlari qanday?",
      "output": "San'at asarlari ko'proq estetik va intuitiv qiymatga ega, qo'l mehnati esa amaliy va funksional qiymatga ega."
    },
    {
      "id": 18,
      "input": "Xalq hunarmandchiligi qanday san'at shakli sifatida tanilgan?",
      "output": "Xalq hunarmandchiligi o'zining noyob uslubi va an'anaviy texnikalari bilan san'at shakli sifatida qadrlanadi."
    },
    {
      "id": 19,
      "input": "Qo'l mehnatining ahamiyati ijtimoiy rivojlanishda qanday?",
      "output": "Qo'l mehnati ijtimoiy rivojlanishda ish o'rinlarini yaratish, madaniy o'ziga xoslikni saqlash va iqtisodiy o'sishni ta'minlashda muhimdir."
    },
    {
      "id": 20,
      "input": "San'at va qo'l mehnatining iqtisodiy qiymati qanday aniqlanadi?",
      "output": "Ularning iqtisodiy qiymati ularni ishlab chiqarish jarayonidagi mehnat xarajatlari, materiallar va talabga asoslanadi."
    },
    {
      "id": 21,
      "input": "Qo'l mehnatining san'at bilan aloqasi qanday qilib saqlanadi?",
      "output": "Qo'l mehnati san'ati o'zining an'anaviy va madaniy merosini saqlab qolishga yordam beradi."
    },
    {
      "id": 22,
      "input": "San'at va qo'l mehnati asarlarini qanday baholash mumkin?",
      "output": "Baholashda asarning estetik qiymati, yaratilgan materiallar va uning tarixiy yoki madaniy ahamiyati inobatga olinadi."
    },
    {
      "id": 23,
      "input": "Qo'l mehnatining zamonaviy shakllari qanday?",
      "output": "Zamonaviy qo'l mehnati shakllariga ekologik toza materiallar, 3D print va boshqa texnologiyalar kiritiladi."
    },
    {
      "id": 24,
      "input": "San'at asarlari yaratishda qo'llaniladigan eng qadimgi texnikalar qanday?",
      "output": "Eng qadimgi texnikalar orasida naqshinkor ishlov berish, tasviriy san'at va haykaltaroshlik texnikalari mavjud."
    },
    {
      "id": 25,
      "input": "Qo'l mehnatining eng mashhur turlaridan biri nima?",
      "output": "Eng mashhur qo'l mehnat turlaridan biri o'ymakorlik va to'qimachilik san'ati hisoblanadi."
    },
    {
      "id": 26,
      "input": "San'at asarlari va qo'l mehnati asarlari orasidagi farqni qanday tushunasiz?",
      "output": "San'at asarlari estetik maqsadga qaratilgan, qo'l mehnati esa amaliy va foydali funksiyalarni ko'zda tutadi."
    },
    {
      "id": 27,
      "input": "Qo'l mehnati san'ati ishlab chiqarishni qanday o'zgartiradi?",
      "output": "Qo'l mehnati san'ati yangi dizaynlar, uslublar va texnikalarni ishlab chiqarishda innovatsiyalarga olib keladi."
    },
    {
      "id": 28,
      "input": "San'at va qo'l mehnatining ilg'or shakllari qanday rivojlanmoqda?",
      "output": "Ular zamonaviy texnologiyalarni o'zlashtirish orqali innovatsion va ekologik toza mahsulotlarga aylanmoqda."
    },
    {
      "id": 29,
      "input": "Qo'l mehnati mahsulotlari qanday tasviriy san'at asariga aylanishi mumkin?",
      "output": "Qo'l mehnati mahsulotlari o'zining noyobligini va yuqori sifatini san'at asariga aylantirish uchun estetik nuqtai nazardan qayta ishlanadi."
    },
    {
      "id": 30,
      "input": "San'at asarlari va qo'l mehnatining iqtisodiy ta'siri qanday?",
      "output": "Ularning iqtisodiy ta'siri ish o'rinlari yaratish, turizm va savdo sohalarini rivojlantirish orqali o'zini namoyon qiladi."
    },
    {
      "id": 31,
      "input": "San'atni yaratishda qo'l mehnatining qismlarini qanday ajratish mumkin?",
      "output": "San'at asarining texnik jarayonlari, xom ashyo tanlash va dizayn yaratish kabi qismlar qo'l mehnati sifatida ajratiladi."
    },
    {
      "id": 32,
      "input": "Qo'l mehnati san'ati qanday turlarga bo'linadi?",
      "output": "Qo'l mehnati san'ati tasviriy san'at, o'ymakorlik, to'qimachilik, keramika, va boshqa ko'plab turlarga bo'linadi."
    },
    {
      "id": 33,
      "input": "San'at asarlari yaratishda qanday texnologiyalar ishlatiladi?",
      "output": "Bugungi kunda raqamli texnologiyalar, 3D chop etish, va ilg'or dizayn texnikalari san'at yaratishda keng qo'llaniladi."
    },
    {
      "id": 34,
      "input": "Qo'l mehnati va san'atning ta'limdagi o'rni qanday?",
      "output": "Qo'l mehnati va san'at ta'limda ijodkorlik, texnik ko'nikmalar va madaniy merosni o'rgatishda muhim o'rin tutadi."
    },
    {
      "id": 35,
      "input": "San'at asarlari va qo'l mehnati mahsulotlarining sifati qanday baholanadi?",
      "output": "Sifat asarlarning estetik qiymati, ishlov berish texnikasi va materiallarning sifati bilan baholanadi."
    },
    {
      "id": 36,
      "input": "Qo'l mehnatining san'atga qo'shgan hissasi qanday?",
      "output": "Qo'l mehnati san'atga haqiqiy mehnat va ijodiy yondashuvni qo'shadi, uning amaliy va estetik ahamiyatini oshiradi."
    },
    {
      "id": 37,
      "input": "San'at va qo'l mehnati asarlarining zamonaviy talablarga javob berishi qanday?",
      "output": "Zamonaviy talablarga moslashish uchun san'at va qo'l mehnati asarlari ekologik, texnologik va estetik jihatlarni hisobga olib ishlab chiqiladi."
    },
    {
      "id": 38,
      "input": "Qo'l mehnati va san'at qanday qilib yangi avlodga o'tkaziladi?",
      "output": "Yangi avlodga qo'l mehnati va san'atni o'rgatish, ustoz-shogird munosabatlari va ta'lim dasturlari orqali amalga oshiriladi."
    },
    {
      "id": 39,
      "input": "San'at va qo'l mehnatining ekologik ahamiyati qanday?",
      "output": "Ekologik ahamiyat shundaki, qo'l mehnati va san'at mahsulotlari tabiiy materiallar ishlatilganligi sababli ekologik barqarorlikni qo'llab-quvvatlaydi."
    },
    {
      "id": 40,
      "input": "Qo'l mehnati san'atining kelajagi qanday bo'lishi mumkin?",
      "output": "Kelajakka qaratilgan qo'l mehnati san'ati zamonaviy texnologiyalar, ekologik materiallar va raqamli san'at bilan uyg'unlashadi."
    },
    {
      "id": 41,
      "input": "San'at va qo'l mehnati qanday madaniyatlar bilan bog'liq?",
      "output": "San'at va qo'l mehnati o'ziga xos madaniyatlar va xalqlar bilan bog'liq bo'lib, har bir millatning an'anaviy texnikalari va estetikasi orqali o'z ifodasini topadi."
    },
    {
      "id": 42,
      "input": "San'at asarining ijodiy jarayoni qanday boshlanadi?",
      "output": "Ijodiy jarayon g'oya yoki ilhomdan boshlanib, tasviriy rejalar, eskizlar va materiallar tanlash orqali rivojlanadi."
    },
    {
      "id": 43,
      "input": "Qo'l mehnatida qanday yangi texnologiyalar qo'llanilmoqda?",
      "output": "Zamonaviy texnologiyalar, masalan, 3D print, lazer ishlov berish va CNC uskunalari qo'l mehnatida ishlatilmoqda."
    },
    {
      "id": 44,
      "input": "San'atda avangard uslubi va qo'l mehnati o'rtasida qanday aloqalar mavjud?",
      "output": "Avangard uslubi san'atda yangiliklar yaratishga intiladi, qo'l mehnati esa an'anaviy texnikalarni yangilash orqali avangard san'atni yaratishda yordam beradi."
    },
    {
      "id": 45,
      "input": "Qo'l mehnatining iqtisodiy ahamiyati qanday o'smoqda?",
      "output": "Iqtisodiy ahamiyati o'sib bormoqda, chunki qo'l mehnati san'ati va mahsulotlari turizm, savdo va eksportda o'zining muhim o'rnini topmoqda."
    },
    {
      "id": 46,
      "input": "San'at va qo'l mehnatining ta'limdagi o'rni qanday?",
      "output": "Ta'limda san'at va qo'l mehnati ijodiy yondashuvni rivojlantirish, amaliy ko'nikmalarni o'rgatish va madaniy merosni saqlashda muhim ahamiyatga ega."
    },
    {
      "id": 47,
      "input": "San'at va qo'l mehnatining turli shakllari o'rtasidagi bog'liqlik qanday?",
      "output": "Turli shakllar o'rtasidagi bog'liqlik san'at va qo'l mehnatining o'zaro o'zgarib borishiga, texnikalar va materiallar almashishiga asoslanadi."
    },
    {
      "id": 48,
      "input": "San'at asarining tarixiy qiymati qanday aniqlanadi?",
      "output": "Tarixiy qiymat asarning yaratilgan davri, u orqali ifodalangan madaniy-ma'naviy meros va uning jamiyatdagi o'rni orqali aniqlanadi."
    },
    {
      "id": 49,
      "input": "Qo'l mehnati va san'atni raqamli texnologiyalar orqali qanday rivojlantirish mumkin?",
      "output": "Raqamli texnologiyalar qo'l mehnati va san'atni yangi shakllar bilan boyitib, keng auditoriyaga yetkazish imkoniyatlarini yaratadi."
    },
    {
      "id": 50,
      "input": "San'at asarlarida eng ko'p ishlatiladigan ranglar qanday?",
      "output": "Ranglar asarlarning tasviriy kuchini oshiradi, shuning uchun ko'pincha tabiiy, boy va ifodalovchi ranglar ishlatiladi."
    },
    {
      "id": 51,
      "input": "Qo'l mehnati va san'at mahsulotlarining estetikasini qanday baholash mumkin?",
      "output": "Estetika baholanishi ranglar, shakllar, kompozitsiya va ijodiy ifodaning uyg'unligiga asoslanadi."
    },
    {
      "id": 52,
      "input": "San'at asarlari va qo'l mehnatining turlari orasidagi farqni qanday tushunasiz?",
      "output": "San'at asarlari ko'proq tasviriy va estetik maqsadga xizmat qiladi, qo'l mehnati esa amaliy va funksional maqsadlarni ko'zda tutadi."
    },
    {
      "id": 53,
      "input": "Qo'l mehnatining ekologik jihatlari qanday ahamiyatga ega?",
      "output": "Ekologik jihatlar tabiiy materiallar va qayta ishlanadigan resurslardan foydalanishni rag'batlantiradi, shuningdek atrof-muhitni asrashga hissa qo'shadi."
    },
    {
      "id": 54,
      "input": "San'at asarlarini yaratishda qo'l mehnati qanday yordam beradi?",
      "output": "Qo'l mehnati san'at asarlarini texnik jihatdan mukammallashtiradi, materiallarni boshqarishda va uning shaklini aniqlashda muhim rol o'ynaydi."
    },
    {
      "id": 55,
      "input": "Qo'l mehnatining texnikasini o'rgatishda qanday metodlar qo'llaniladi?",
      "output": "Amaliy mashg'ulotlar, ko'rgazmalar, o'quv dasturlari va ustoz-shogird tizimi qo'l mehnati texnikasini o'rgatishda qo'llaniladi."
    },
    {
      "id": 56,
      "input": "San'at asarlarida qanday temalar va motivlar ishlatiladi?",
      "output": "San'at asarlarida insoniyat, tabiat, sevgi, ijtimoiy masalalar va tarixiy hodisalar kabi turli temalar va motivlar ishlatiladi."
    },
    {
      "id": 57,
      "input": "Qo'l mehnatining madaniy ahamiyati qanday?",
      "output": "Madaniy ahamiyat qo'l mehnati san'atining o'ziga xos texnikalari va uslublari orqali jamiyatning an'anaviy qiymatlarini saqlaydi."
    },
    {
      "id": 58,
      "input": "San'at asarlarini yaratishda foydalaniladigan eng qadimgi materiallar nima?",
      "output": "Eng qadimgi materiallar orasida tosh, yog'och, suyak, va qora tuproq (gil) kabi tabiiy materiallar mavjud."
    },
    {
      "id": 59,
      "input": "Qo'l mehnati mahsulotlari va san'at asarlarini qanday ajratish mumkin?",
      "output": "Qo'l mehnati mahsulotlari asosan amaliy ehtiyojlar uchun yaratilgan, san'at asarlari esa estetik va ijodiy maqsadlarga xizmat qiladi."
    },
    {
      "id": 60,
      "input": "San'at va qo'l mehnatining turli uslublari qanday shakllanadi?",
      "output": "Uslublar tarixiy davrlarga, ijtimoiy sharoitlarga va san'atkorlarning shaxsiy yondashuviga bog'liq bo'lib shakllanadi."
    },
    {
      "id": 61,
      "input": "Qo'l mehnati asarlarida qanday an'analar saqlanadi?",
      "output": "An'analar materiallardan foydalanish, dizayn, shakllar va ma'naviy qiymatlarni saqlashda aks etadi."
    },
    {
      "id": 62,
      "input": "San'at va qo'l mehnatining birlashtirilgan shakllari qanday bo'ladi?",
      "output": "Birlashtirilgan shakllarda amaliy va estetik jihatlar uyg'unlashib, yangi ijodiy va innovatsion asarlar yaratiladi."
    },
    {
      "id": 63,
      "input": "Qo'l mehnati asarlari qanday qilib san'at galereyalariga qo'yiladi?",
      "output": "Qo'l mehnati asarlari san'at galereyalarida o'zining estetik qiymati, tarixiy ahamiyati va san'atsal jihatlari bilan namoyish qilinadi."
    },
    {
      "id": 64,
      "input": "San'at asarlarini yaratishda qanday psixologik omillar ta'sir qiladi?",
      "output": "Psixologik omillar ilhom, ichki dunyo, hayot tajribalari va shaxsiy qarashlar orqali san'at asarlarining yaratilishiga ta'sir qiladi."
    },
    {
      "id": 65,
      "input": "San'at va qo'l mehnati o'rtasidagi ijodiy farq nima?",
      "output": "San'atda ijodkorlik ko'proq estetik va ruhiy ifodaga yo'naltirilgan, qo'l mehnatida esa amaliy va funksional jihatlar muhim."
    },
    {
      "id": 66,
      "input": "Qo'l mehnatining rivojlanishi ijtimoiy jarayonda qanday ta'sir ko'rsatadi?",
      "output": "Rivojlanish, hunarmandchilik va mehnat madaniyatini saqlash orqali ijtimoiy rivojlanishga yordam beradi, iqtisodiy va madaniy barqarorlikni ta'minlaydi."
    },
    {
      "id": 67,
      "input": "San'at asarlari yaratishda ishlatiladigan eng zamonaviy materiallar nimalardan iborat?",
      "output": "Zamonaviy materiallar orasida plastik, akril, kompozit materiallar, metall va ekologik toza, qayta ishlanadigan materiallar ishlatiladi."
    },
    {
      "id": 68,
      "input": "Qo'l mehnati mahsulotlarining qiymati qanday o'lchanadi?",
      "output": "Qiymat materiallarning sifatiga, ishchilarning mehnatiga, san'ati va uning ijtimoiy, madaniy ahamiyatiga qarab o'lchanadi."
    },
    {
      "id": 69,
      "input": "San'at asarlari yaratishda qo'l mehnatining ahamiyati qanday?",
      "output": "Qo'l mehnati san'at asarini ishlab chiqarishda texnik nuqtai nazardan juda muhim, bu asarning yaratilishida mehnat va detalga alohida e'tibor qaratiladi."
    },
    {
      "id": 70,
      "input": "San'at va qo'l mehnati asarlarini yaratishdagi innovatsiyalar qanday?",
      "output": "Innovatsiyalar yangi texnologiyalarni qo'llash, yangi materiallardan foydalanish va an'anaviy uslublarga zamonaviy yondashuvni kiritishda namoyon bo'ladi."
    },
    {
      "id": 71,
      "input": "Qo'l mehnatining inson hayotidagi o'rni qanday?",
      "output": "Qo'l mehnati insonning amaliy ehtiyojlarini qondirish, madaniyat va san'atni saqlash, ijodiy fikrlashni rivojlantirishda katta rol o'ynaydi."
    },
    {
      "id": 72,
      "input": "San'atda va qo'l mehnatida xilma-xillik qanday ifodalanadi?",
      "output": "Xilma-xillik texnikalarda, materiallar va dizaynlarda, shuningdek, madaniy va estetik ifodada ko'rinadi."
    },
    {
      "id": 73,
      "input": "San'at asarlarini yaratishda qanday psixologik motivlar mavjud?",
      "output": "Psixologik motivlar, shaxsiy tajribalar, ijtimoiy masalalar va inson ruhiyatining turli holatlarini aks ettirish orqali san'at asarlari yaratiladi."
    },
    {
      "id": 74,
      "input": "Qo'l mehnatida qanday o'zgarishlar yuz berdi?",
      "output": "Tarix davomida qo'l mehnati texnologiyalarning rivojlanishi, materiallar va ishlab chiqarish jarayonlarining o'zgarishi bilan boyidi."
    },
    {
      "id": 75,
      "input": "San'at asarlarining jamoatdagi roli qanday?",
      "output": "San'at asarlari jamoatni tarbiyalash, ijtimoiy muammolarni ko'tarish, madaniy qadriyatlarni shakllantirish va tarixni saqlashda muhim rol o'ynaydi."
    },
    {
      "id": 76,
      "input": "Qo'l mehnati san'ati iqtisodiy o'sishga qanday hissa qo'shadi?",
      "output": "Qo'l mehnati san'ati iqtisodiy o'sishni rivojlantiradi, ish o'rinlarini yaratadi va mahalliy iqtisodiyotga ta'sir qiladi."
    },
    {
      "id": 77,
      "input": "San'at va qo'l mehnatining kelajagi haqida qanday bashoratlar mavjud?",
      "output": "Kelajakda san'at va qo'l mehnati zamonaviy texnologiyalar bilan integratsiya qilib, yangi estetik shakllar va amaliy dizaynlarni ishlab chiqarishda davom etadi."
    },
    {
      "id": 78,
      "input": "Qo'l mehnati va san'atni birlashtirgan mahsulotlarning eng yaxshi misollari nimalar?",
      "output": "Eng yaxshi misollar sifatida naqshinkor hunarmandchilik, bezakli mebellar, xat yozish san'ati va an'anaviy kiyimlarni keltirish mumkin."
    },
    {
      "id": 79,
      "input": "San'at va qo'l mehnatining asarlarini qanday saqlash kerak?",
      "output": "Saqlash uchun maxsus sharoitlar, texnologik vositalar va konservatsiya usullari yordamida asarlarning barqarorligini ta'minlash zarur."
    },
    {
      "id": 80,
      "input": "Qo'l mehnati san'ati va ekologik barqarorlik o'rtasidagi bog'liqlik qanday?",
      "output": "Ekologik barqarorlik qo'l mehnati san'atida tabiiy, qayta ishlanadigan materiallar ishlatish va zararsiz texnikalardan foydalanish orqali ta'minlanadi."
    },
    {
      "id": 81,
      "input": "San'at va qo'l mehnatining turli shakllaridagi vositalar qanday o'zgaradi?",
      "output": "Vositalar yangi texnologiyalar, zamonaviy materiallar va ilg'or ishlab chiqarish usullaridan foydalangan holda o'zgaradi."
    },
    {
      "id": 82,
      "input": "San'at asarlarini yaratishda mexanik vositalar qanday yordam beradi?",
      "output": "Mexanik vositalar san'at asarlarini ishlab chiqarishda ishlov berish jarayonlarini tezlashtiradi, aniqlikni oshiradi va yangi uslublarni yaratishga yordam beradi."
    },
    {
      "id": 83,
      "input": "Qo'l mehnatining ta'limdagi ahamiyati qanday?",
      "output": "Qo'l mehnati ta'limda amaliy ko'nikmalarni rivojlantiradi, ijodiy fikrlashni rag'batlantiradi va o'quvchilarga tarixiy va madaniy merosni o'rgatadi."
    },
    {
      "id": 84,
      "input": "San'at va qo'l mehnatining o'zaro aloqasi qanday rivojlanadi?",
      "output": "O'zaro aloqasi texnika, dizayn va materiallar orqali shakllanib, san'at va qo'l mehnati bir-birini boyitadi va yangilaydi."
    },
    {
      "id": 85,
      "input": "San'atda va qo'l mehnatida qanday maxsus usullar qo'llaniladi?",
      "output": "Maxsus usullar orasida o'ymakorlik, naqshinkor ishlov, to'qish va bog'lash texnikalari mavjud."
    },
    {
      "id": 86,
      "input": "San'at asarlarini yaratishda kimyoviy vositalar qanday ishlatiladi?",
      "output": "Kimyoviy vositalar asarlarni yaratishda bo'yoqlar, laklar, yopishtiruvchi moddalar va saqlash uchun zarur kimyoviy moddalar sifatida qo'llaniladi."
    },
    {
      "id": 87,
      "input": "Qo'l mehnatining iqtisodiy muvaffaqiyatini qanday o'lchash mumkin?",
      "output": "Iqtisodiy muvaffaqiyat asarlarning bozorga chiqishi, savdo va eksportdagi o'sish, shuningdek, ishlab chiqarish va materiallar xarajatlari orqali o'lchanadi."
    },
    {
      "id": 88,
      "input": "San'at asarlari va qo'l mehnatining yuqori sifatini qanday ta'minlash mumkin?",
      "output": "Yuqori sifatli materiallar, ilg'or texnikalar va tajribali ustalar yordamida sifatli asarlarni yaratish mumkin."
    },
    {
      "id": 89,
      "input": "Qo'l mehnatining xalqaro bozorda muvaffaqiyatga erishish uchun qanday strategiyalar kerak?",
      "output": "Mahalliy madaniyatni aks ettiruvchi noyob va sifatli mahsulotlar yaratish, marketing va brendlash strategiyalarini ishlab chiqish kerak."
    },
    {
      "id": 90,
      "input": "San'at va qo'l mehnatining rivojlanishiga ta'sir qiluvchi asosiy omillar nimalar?",
      "output": "Rivojlanishiga ta'sir qiluvchi asosiy omillar texnologiyalar, madaniy o'zgarishlar, ijtimoiy talablar va iqtisodiy sharoitlardir."
    },
    {
      "id": 91,
      "input": "San'at asarlarini yaratishda o'ziga xos uslublar qanday paydo bo'ladi?",
      "output": "Uslublar shaxsiy ijodkorlik, ijtimoiy sharoitlar, tarixiy kontekst va madaniy ta'sirlar natijasida paydo bo'ladi."
    },
    {
      "id": 92,
      "input": "Qo'l mehnatining samaradorligini qanday oshirish mumkin?",
      "output": "Samaradorlikni oshirish uchun texnologik yangiliklardan foydalanish, vaqtni samarali boshqarish va yuqori sifatli materiallardan foydalanish kerak."
    },
    {
      "id": 93,
      "input": "Qo'l mehnatining xalqaro tan olinishi qanday amalga oshadi?",
      "output": "Xalqaro tan olinishi ko'rgazmalar, festivallar va madaniy almashinuvlar orqali amalga oshiriladi."
    },
    {
      "id": 94,
      "input": "San'at va qo'l mehnatining xalqlararo madaniy aloqalarga qanday ta'siri bor?",
      "output": "Xalqlararo madaniy aloqalarda san'at va qo'l mehnati an'analar va ijodiy yondashuvlarni birlashtiradi, madaniy o'zaro tushunishni oshiradi."
    },
    {
      "id": 95,
      "input": "Qo'l mehnati va san'at asarlarining reklama va marketingdagi roli qanday?",
      "output": "San'at va qo'l mehnati mahsulotlari brend yaratish, bozorda farqlanish va ijodiy marketingda muhim rol o'ynaydi."
    },
    {
      "id": 96,
      "input": "San'atda o'ziga xos uslublar qanday taraqqiy etadi?",
      "output": "O'ziga xos uslublar san'atkorlarning shaxsiy tajribalari, madaniy omillar va tarixiy kontekstdan kelib chiqib rivojlanadi."
    },
    {
      "id": 97,
      "input": "Qo'l mehnati asarlari va san'atni saqlashda ekologik texnologiyalar qanday yordam beradi?",
      "output": "Ekologik texnologiyalar qayta ishlanadigan materiallar va energiya samaradorligi bilan san'at va qo'l mehnati asarlarini saqlashda yordam beradi."
    },
    {
      "id": 98,
      "input": "San'at va qo'l mehnati o'rtasidagi o'zaro munosabatlar qanday ijtimoiy o'zgarishlarga olib keladi?",
      "output": "O'zaro munosabatlar ijtimoiy qadriyatlar va estetika yangiliklarini yaratadi, madaniy innovatsiyalar va tarixiy an'analarni uyg'unlashtiradi."
    },
    {
      "id": 99,
      "input": "Qo'l mehnati san'atining psixologik ta'siri qanday?",
      "output": "Qo'l mehnati san'ati ijodkorlikni rivojlantiradi, estetik qoniqishni ta'minlaydi va insonning ichki dunyosiga ta'sir qiladi."
    },
    {
      "id": 100,
      "input": "San'atda o'rganish jarayonida qo'l mehnatining roli qanday?",
      "output": "Qo'l mehnati san'atda texnikani o'rgatish, detalni kuzatish va ijodiy fikrlashni rivojlantirishda muhim rol o'ynaydi."
    },
    {
      "id": 101,
      "input": "San'at va qo'l mehnati o'rtasidagi farqni qanday tushunasiz?",
      "output": "San'atda estetika va shakl birinchi o'rinda bo'lsa, qo'l mehnatida amaliy foydalanuvchanlik va funksiya ustuvor hisoblanadi."
    },
    {
      "id": 102,
      "input": "San'at asarlari va qo'l mehnati to'g'risida kengashlar qanday tashkil etiladi?",
      "output": "Kengashlar mutaxassislar, san'atkorlar va hunarmandlar ishtirokida san'at va qo'l mehnatining rivojlanishi, saqlanishi va yangi tendensiyalarni ishlab chiqish uchun tashkil etiladi."
    },
    {
      "id": 103,
      "input": "Qo'l mehnati mahsulotlarining madaniy ahamiyati qanday ifodalanadi?",
      "output": "Madaniy ahamiyat mahsulotlar orqali xalqning an'anaviy uslublari, mehnatning qiymati va madaniyatga bo'lgan e'tiborini ifodalaydi."
    },
    {
      "id": 104,
      "input": "San'at va qo'l mehnatida qanday ijtimoiy masalalar aks etadi?",
      "output": "Ijtimoiy masalalar orasida ijtimoiy adolat, ekologiya, gender tengligi va inson huquqlari kabi mavzular aks etadi."
    },
    {
      "id": 105,
      "input": "Qo'l mehnati va san'atni ajratish uchun qanday kriteriyalar mavjud?",
      "output": "Ajratish kriteriyalari amaliy va estetik maqsadlar, ishlatilgan materiallar va ishlab chiqarish jarayonlarining xususiyatlariga asoslanadi."
    },
    {
      "id": 106,
      "input": "San'at asarlari va qo'l mehnati orasidagi o'xshashliklar qanday?",
      "output": "O'xshashliklar yaratuvchilik, detallarni e'tiborga olish va an'anaviy texnikalarni zamonaviy talablarga moslashtirishda ko'rinadi."
    },
    {
      "id": 107,
      "input": "San'at asarlari va qo'l mehnatini ishlab chiqarishda qaysi ilmiy asoslar ishlatiladi?",
      "output": "Ilmiy asoslar materialshunoslik, fizika, kimyo va antropologiya kabi sohalarga asoslanadi."
    },
    {
      "id": 108,
      "input": "Qo'l mehnati mahsulotlarida qaysi tasviriy elementlar ko'proq ishlatiladi?",
      "output": "Qo'l mehnatida geometrik shakllar, tabiiy naqshlar va simmetriya ko'proq ishlatiladi."
    },
    {
      "id": 109,
      "input": "San'at va qo'l mehnatida ijodkorlar uchun eng muhim vositalar nimalar?",
      "output": "Ijodkorlar uchun eng muhim vositalar bo'yoqlar, to'qish asboblari, o'yma asboblari va zarur texnologik qurilmalardir."
    },
    {
      "id": 110,
      "input": "Qo'l mehnati mahsulotlarini qanday qilib to'g'ri baholash mumkin?",
      "output": "Baholashda mahsulotning sifatiga, estetik va funksional jihatlariga, hamda ijodkorning texnikasiga qarab baho beriladi."
    },
    {
      "id": 111,
      "input": "San'at va qo'l mehnati mahsulotlarini global bozorda qanday tanishtirish mumkin?",
      "output": "Tanishtirish uchun xalqaro ko'rgazmalar, onlayn platformalar va marketing kampaniyalaridan foydalanish mumkin."
    },
    {
      "id": 112,
      "input": "San'at asarlarini yaratishda tanlangan ranglar qanday psixologik ta'sir qiladi?",
      "output": "Ranglar psixologik jihatdan odamlarning kayfiyatiga ta'sir qiladi: masalan, qizil rang ehtirosni, ko'k rang tinchlikni ifodalaydi."
    },
    {
      "id": 113,
      "input": "San'at asarlari va qo'l mehnati o'rtasida qanday estetik munosabatlar mavjud?",
      "output": "Estetik munosabatlar amaliy va estetik jihatlar o'rtasidagi muvozanatga asoslanadi, har ikkala soha ham insonning go'zallik va funksiyalarga bo'lgan munosabatini ifodalaydi."
    },
    {
      "id": 114,
      "input": "Qo'l mehnatining ijtimoiy rivojlanishdagi roli qanday?",
      "output": "Qo'l mehnati ijtimoiy rivojlanishga hissa qo'shadi, chunki u ish o'rinlari yaratadi va jamiyatning madaniy qadriyatlarini saqlaydi."
    },
    {
      "id": 115,
      "input": "San'at va qo'l mehnati asarlarini qanday qilib ekologik jihatdan toza ishlab chiqarish mumkin?",
      "output": "Ekologik jihatdan toza ishlab chiqarish uchun qayta ishlanadigan materiallar va tabiiy resurslardan foydalanish, kimyoviy moddalarni cheklash kerak."
    },
    {
      "id": 116,
      "input": "San'at asarini yaratishda ilhom manbalaridan biri sifatida tabiiy dunyo qanday rol o'ynaydi?",
      "output": "Tabiiy dunyo san'atkorlarni ranglar, shakllar va kompozitsiyalar uchun ilhomlantiradi, shuningdek, ekologik va ijtimoiy mavzularni ko'rsatadi."
    },
    {
      "id": 117,
      "input": "Qo'l mehnati asarlarini yaratishda yangi texnologiyalar qanday ta'sir qiladi?",
      "output": "Yangi texnologiyalar ishlov berish jarayonini tezlashtiradi, sifatni oshiradi va yaratish imkoniyatlarini kengaytiradi."
    },
    {
      "id": 118,
      "input": "San'at va qo'l mehnati o'rtasida qanday o'zaro bog'liqlik mavjud?",
      "output": "O'zaro bog'liqlik san'at va qo'l mehnatining bir-birini to'ldirishi, amaliy va estetik maqsadlarni birlashtirishda ko'rinadi."
    },
    {
      "id": 119,
      "input": "Qo'l mehnatining psixologik foydalari qanday?",
      "output": "Psixologik foydalari ijodiy stressni kamaytirish, shaxsiy maqsadlarga erishish va o'zini ifodalashni ta'minlashdan iborat."
    },
    {
      "id": 120,
      "input": "San'at asarlari va qo'l mehnati mahsulotlarining yakuniy qiymatini qanday belgilash mumkin?",
      "output": "Yakuniy qiymat asarning texnik xususiyatlari, san'atsal yondashuv va uning jamiyatga ta'siri asosida belgilanadi."
    },
    {
      "id": 121,
      "input": "Qo'l mehnatining iqtisodiy istiqbollari qanday?",
      "output": "Iqtisodiy istiqbollari ko'rgazmalar, eksport va turizm orqali o'sishi mumkin, shuningdek, mahalliy iqtisodiyotni rivojlantirishda muhim rol o'ynaydi."
    },
    {
      "id": 122,
      "input": "San'at va qo'l mehnatining zamonaviy shakllari qanday?",
      "output": "Zamonaviy shakllar raqamli san'at, 3D chop etish va boshqa texnologik yondashuvlar yordamida yaratilib, qo'l mehnatiga yangi imkoniyatlar beradi."
    },
    {
      "id": 123,
      "input": "San'at va qo'l mehnatining ta'limdagi roli qanday?",
      "output": "Ta'limda san'at va qo'l mehnati o'quvchilarga ijodiy fikrlash, texnik ko'nikmalarni rivojlantirish va tarixiy an'analarni o'rgatishda muhim rol o'ynaydi."
    },
    {
      "id": 124,
      "input": "San'at va qo'l mehnatini rivojlantirishda davlatning roli qanday?",
      "output": "Davlat, madaniy merosni himoya qilish, san'at va qo'l mehnati sohalarini qo'llab-quvvatlash, ta'lim tizimlarini yaxshilash orqali rivojlantirishda muhim rol o'ynaydi."
    },
    {
      "id": 125,
      "input": "Qo'l mehnati mahsulotlari yaratishda ijtimoiy mas'uliyat qanday?",
      "output": "Ijtimoiy mas'uliyat ekologik xavfsizlik, mehnat sharoitlarini yaxshilash va odilona iqtisodiy tizimni yaratishga qaratilgan."
    },
    {
      "id": 126,
      "input": "San'atda va qo'l mehnatida sifatni qanday ta'minlash mumkin?",
      "output": "Sifatni ta'minlash uchun yuqori sifatli materiallardan foydalanish, texnikada yangiliklar joriy etish va ustalar malakasini oshirish zarur."
    },
    {
      "id": 127,
      "input": "San'at va qo'l mehnati o'rtasidagi o'zaro aloqalar qanday ijtimoiy qadriyatlarni aks ettiradi?",
      "output": "O'zaro aloqalar ijtimoiy adolat, madaniy o'zlik va tarixiy merosni saqlash, ekologik barqarorlik va inson huquqlarini aks ettiradi."
    },
    {
      "id": 128,
      "input": "Qo'l mehnati mahsulotlarining xalqaro bozordagi raqobatbardoshligi qanday oshiriladi?",
      "output": "Mahsulotlarni sifatli va noyob qilish, innovatsion dizaynlar yaratish va bozor talablariga moslashish orqali raqobatbardoshlik oshiriladi."
    },
    {
      "id": 129,
      "input": "San'at va qo'l mehnatining iqtisodiy ahamiyati qanday?",
      "output": "Iqtisodiy ahamiyati ish o'rinlarini yaratish, madaniy turizmni rivojlantirish va xalqaro savdoni rag'batlantirish orqali ko'rinadi."
    },
    {
      "id": 130,
      "input": "San'at va qo'l mehnatining yosh avlodni tarbiyalashdagi roli qanday?",
      "output": "San'at va qo'l mehnati yosh avlodni ijodiy va mehnatkashlikka, milliy madaniyatni hurmat qilishga, hamda tabiatga g'amxo'rlik qilishga o'rgatadi."
    },
    {
      "id": 131,
      "input": "San'at va qo'l mehnatida zamonaviy texnologiyalar qanday foydalanilmoqda?",
      "output": "Zamonaviy texnologiyalar raqamli dizayn, 3D bosib chiqarish va avtomatlashtirilgan ishlab chiqarish jarayonlarida qo'llanilmoqda."
    },
    {
      "id": 132,
      "input": "San'at asarlarini yaratishda an'anaviy texnikalar qanday saqlanadi?",
      "output": "An'anaviy texnikalar ustalarning malakali o'qituvchilari tomonidan o'rgatiladi, o'quv dasturlari orqali yangi avlodga yetkaziladi."
    },
    {
      "id": 133,
      "input": "Qo'l mehnatining turli xil turlari qanday farqlanadi?",
      "output": "Qo'l mehnati turli xil amaliy va estetik turlarni o'z ichiga oladi, masalan, to'qish, yog'och o'yib ishlash, kulolchilik, teri ishlov berish va boshqalar."
    },
    {
      "id": 134,
      "input": "San'at asarlarini yaratishda ramzlar va simvollar qanday ishlatiladi?",
      "output": "Ramzlar va simvollar san'at asarida tarixiy, madaniy va diniy ma'nolarni ifodalash, insonning ichki dunyosini yoritishda ishlatiladi."
    },
    {
      "id": 135,
      "input": "Qo'l mehnati va san'at asarlarining dizayn jarayonida qanday farqlar bor?",
      "output": "Qo'l mehnatida dizayn funksionallik va amaliyotga yo'naltirilgan bo'lsa, san'atda estetik va hissiy ifoda asosiy ahamiyatga ega."
    },
    {
      "id": 136,
      "input": "San'at asarlarini yaratishda tabiiy materiallar qanday ahamiyatga ega?",
      "output": "Tabiiy materiallar, masalan, daraxt, tosh, g'isht yoki metall, san'at asarining tabiat bilan bog'liqligini ko'rsatadi va ekologik barqarorlikni ta'minlaydi."
    },
    {
      "id": 137,
      "input": "Qo'l mehnati mahsulotlari ishlab chiqarishning ijtimoiy va iqtisodiy oqibatlari qanday?",
      "output": "Ijtimoiy oqibatlar jamiyatda ko'proq ish o'rinlari yaratish va iqtisodiy barqarorlikni ta'minlash, iqtisodiy oqibatlar esa ishlab chiqarishni o'stirish va eksportni rag'batlantirishga qaratilgan."
    },
    {
      "id": 138,
      "input": "San'at va qo'l mehnatini yaratishda lokal madaniyatning roli qanday?",
      "output": "Lokal madaniyat milliy an'analar, madaniyat va tarixni ifodalovchi, shuningdek, san'at va qo'l mehnatining noyob shakllarini yaratishda muhim rol o'ynaydi."
    },
    {
      "id": 139,
      "input": "Qo'l mehnatining ekologik ta'sirini kamaytirish uchun qanday choralar ko'rish mumkin?",
      "output": "Ekologik ta'sirni kamaytirish uchun tabiiy materiallarni ishlatish, chiqindilarni qayta ishlash va energiya tejash texnologiyalarini joriy etish zarur."
    },
    {
      "id": 140,
      "input": "San'at va qo'l mehnatini modernizatsiya qilishda qanday yondashuvlar mavjud?",
      "output": "Modernizatsiya yondashuvlari texnologiyalarning integratsiyasi, yangi materiallardan foydalanish va an'anaviy uslublarga yangi talablarga moslashishdir."
    },
    {
      "id": 141,
      "input": "San'at va qo'l mehnati asarlarining qadriyatlari qanday o'zgaradi?",
      "output": "Qadriyatlar ijtimoiy va madaniy o'zgarishlar, texnologik taraqqiyot va globalizatsiya ta'sirida o'zgarib boradi."
    },
    {
      "id": 142,
      "input": "San'at va qo'l mehnatida ekologik dizayn nima?",
      "output": "Ekologik dizayn tabiiy resurslardan foydalanishni minimallashtirish, qayta ishlanadigan materiallar va energiya samaradorligini ta'minlashga yo'naltirilgan yondashuvdir."
    },
    {
      "id": 143,
      "input": "San'at asarlarining vaqt o'tishi bilan qanday o'zgarishlari kuzatiladi?",
      "output": "Vaqt o'tishi bilan san'at asarlari materiali, rangi va shakli o'zgarishi mumkin, chunki ular tabiiy qoldiqlar yoki havo, yorug'lik va boshqa tashqi omillar ta'sirida parchalanadi."
    },
    {
      "id": 144,
      "input": "Qo'l mehnatida tasviriy san'atning roli qanday?",
      "output": "Tasviriy san'at qo'l mehnatida dekorativ va estetik elementlarni yaratish, mahsulotlarga o'ziga xos shakl va ranglar berish orqali ahamiyat kasb etadi."
    },
    {
      "id": 145,
      "input": "San'at va qo'l mehnati o'rtasidagi bog'liqlikni qanday tushunasiz?",
      "output": "San'at va qo'l mehnati o'rtasidagi bog'liqlik, amaliy va estetik jihatlarning uyg'unlashuvi orqali yaratiladi, bir-birini to'ldiradi."
    },
    {
      "id": 146,
      "input": "Qo'l mehnatining yangi texnologiyalar bilan integratsiyasi qanday amalga oshadi?",
      "output": "Yangi texnologiyalar qo'l mehnatining samaradorligini oshiradi, yangi materiallar va ishlab chiqarish jarayonlarini joriy etish orqali yangiliklar yaratadi."
    },
    {
      "id": 147,
      "input": "San'at va qo'l mehnati o'rtasidagi jamoaviy ishning roli qanday?",
      "output": "Jamoaviy ish ijodiy va texnik jarayonlarda hamkorlikni ta'minlaydi, natijada yuqori sifatli va innovatsion mahsulotlar yaratiladi."
    },
    {
      "id": 148,
      "input": "San'at asarlarini yaratishda milliy uslublar qanday namoyon bo'ladi?",
      "output": "Milliy uslublar san'at asarlarida ranglar, naqshlar, kompozitsiyalar va materiallar orqali o'ziga xoslikni aks ettiradi."
    },
    {
      "id": 149,
      "input": "Qo'l mehnatining tarixi qanday rivojlangan?",
      "output": "Qo'l mehnati tarixi qadimgi davrlardan boshlab, sanoat inqilobi, modernizm va zamonaviy texnologiyalar ta'sirida rivojlanib borgan."
    },
    {
      "id": 150,
      "input": "San'at asarlarini yaratishda o'zini ifodalash usullari qanday rivojlanadi?",
      "output": "O'zini ifodalash usullari san'atkorlarning shaxsiy dunyoqarashi, tajribalari va tasavvurlarini ifodalash orqali rivojlanadi."
    },
    {
      "id": 151,
      "input": "Qo'l mehnatining estetik qimmati qanday tushuniladi?",
      "output": "Qo'l mehnatining estetik qimmati uning yaratilishida qo'llaniladigan materiallar, dizayn va texnikaning go'zalligidan kelib chiqadi."
    },
    {
      "id": 152,
      "input": "San'at asarlarini yaratishda to'qimachilikning roli qanday?",
      "output": "To'qimachilik san'ati ranglar, naqshlar va materiallar orqali o'zini ifodalashni ta'minlaydi, shuningdek, milliy madaniyatni aks ettiradi."
    },
    {
      "id": 153,
      "input": "San'at va qo'l mehnati o'rtasida qanday birlashtiruvchi omillar mavjud?",
      "output": "Birlashtiruvchi omillar kreativlik, texnikalar va jismoniy mehnatning estetik ifodalanishidir."
    },
    {
      "id": 154,
      "input": "Qo'l mehnatining muhim ijtimoiy funksiyalari nimalardan iborat?",
      "output": "Qo'l mehnati jamiyatda iqtisodiy o'sishni qo'llab-quvvatlaydi, madaniy merosni saqlaydi va odamlar o'rtasida hamkorlikni rivojlantiradi."
    },
    {
      "id": 155,
      "input": "San'at asarlarida qadimgi madaniyatlarning tasviri qanday amalga oshiriladi?",
      "output": "Qadimgi madaniyatlar tasviri tarixiy elementlar, an'anaviy ramzlar va uslublar orqali san'at asarlariga kiritiladi."
    },
    {
      "id": 156,
      "input": "Qo'l mehnatining zamonaviy tendensiyalari qanday?",
      "output": "Zamonaviy tendensiyalar raqamli texnologiyalar, ekologik dizayn va innovatsion materiallardan foydalanishni o'z ichiga oladi."
    },
    {
      "id": 157,
      "input": "San'atda ifoda erkinligi qanday ta'minlanadi?",
      "output": "Ifoda erkinligi san'atkorning shaxsiy qarashlari va ijtimoiy, siyosiy mavzularni erkin ravishda ifodalash huquqi bilan ta'minlanadi."
    },
    {
      "id": 158,
      "input": "Qo'l mehnatining narxini belgilashda qanday omillar hisobga olinadi?",
      "output": "Narx belgilanishida materiallar, ishchi kuchi, vaqt va mehnatning murakkabligi kabi omillar hisobga olinadi."
    },
    {
      "id": 159,
      "input": "San'at va qo'l mehnati mahsulotlarining eksporti qanday rivojlanadi?",
      "output": "Eksport mahsulotlari dizaynning yangi tendensiyalarini, sifatni va lokal madaniyatni xorijga olib chiqishda rivojlanadi."
    },
    {
      "id": 160,
      "input": "Qo'l mehnati va san'atda ekologik ta'sirlarni kamaytirish uchun qanday strategiyalar mavjud?",
      "output": "Ekologik ta'sirni kamaytirish uchun qayta ishlanadigan materiallardan foydalanish, chiqindilarni kamaytirish va energiya samaradorligini oshirish zarur."
    },
    {
      "id": 161,
      "input": "San'atda yangi texnologiyalarni qo'llashning afzalliklari nimalar?",
      "output": "Yangi texnologiyalar san'atkorlarga yanada aniqroq va tezkor yaratish imkoniyatini beradi, shuningdek, global bozorda tanilish imkonini yaratadi."
    },
    {
      "id": 162,
      "input": "Qo'l mehnati asarlarini yaratishda madaniyatning roli qanday?",
      "output": "Madaniyat qo'l mehnati asarlarini shakllantirishda estetik yondashuvni, rang va naqshlarni, hamda an'anaviy uslublarni aniqlaydi."
    },
    {
      "id": 163,
      "input": "San'at va qo'l mehnatining jamoa ishlari orqali rivojlanishi qanday amalga oshadi?",
      "output": "Jamoaviy ish orqali tajriba almashish, yangi g'oyalarni yaratish va jismoniy mehnatni samarali boshqarish mumkin."
    },
    {
      "id": 164,
      "input": "San'atda \"minimalizm\" uslubi qanday ifodalanadi?",
      "output": "Minimalizm uslubi soddalik, geometrik shakllar va ranglarning cheklangan palitrasini ishlatish orqali ifodalanadi."
    },
    {
      "id": 165,
      "input": "Qo'l mehnati asarlarini yaratishda amaliy va estetik maqsadlar qanday uyg'unlashadi?",
      "output": "Amaliy maqsadlar funksionallikni ta'minlasa, estetik maqsadlar go'zallik va tasviriy ifodaning balansini yaratadi."
    },
    {
      "id": 166,
      "input": "San'at va qo'l mehnatidagi yangi yo'nalishlar qanday rivojlanmoqda?",
      "output": "Yangi yo'nalishlar ekologik dizayn, 3D printing va interaktiv san'at kabi texnologiyalardan foydalanishni o'z ichiga oladi."
    },
    {
      "id": 167,
      "input": "Qo'l mehnati mahsulotlari qanday qilib o'ziga xos xususiyatlarga ega bo'ladi?",
      "output": "O'ziga xos xususiyatlar mahsulotlarning materiallaridan, ishlab chiqarish texnikasidan va dizaynidan kelib chiqadi."
    },
    {
      "id": 168,
      "input": "San'at va qo'l mehnatining savdo sohasidagi roli qanday?",
      "output": "San'at va qo'l mehnati mahsulotlari savdo sohasida iqtisodiy o'sish, turizm va eksportni rivojlantirishga yordam beradi."
    },
    {
      "id": 169,
      "input": "San'at asarlarining o'ziga xosligini qanday tushunasiz?",
      "output": "O'ziga xoslik san'at asarining yaratuvchisining shaxsiy uslubi, yondashuvi va yaratish texnikasidan kelib chiqadi."
    },
    {
      "id": 170,
      "input": "Qo'l mehnati va san'at asarlarini qanday qilib saqlash va konservatsiya qilish mumkin?",
      "output": "Saqlash va konservatsiya qilish uchun maxsus sharoitlar, texnikalar va materiallar yordamida asarlarning shikastlanishining oldini olish zarur."
    },
    {
      "id": 171,
      "input": "San'at va qo'l mehnatining ekologik ta'sirini kamaytirish uchun qanday ijtimoiy tashabbuslar mavjud?",
      "output": "Ijtimoiy tashabbuslar qayta ishlanadigan materiallardan foydalanish, ekologik toza ishlab chiqarish va barqaror energiya manbalariga o'tishdir."
    },
    {
      "id": 172,
      "input": "San'atda modalar qanday paydo bo'ladi?",
      "output": "Moda san'ati ijtimoiy, siyosiy yoki texnologik o'zgarishlarga javoban paydo bo'lib, odamlarning zamonaga mos qarashlarini aks ettiradi."
    },
    {
      "id": 173,
      "input": "Qo'l mehnatining ijtimoiy adolatga ta'siri qanday?",
      "output": "Qo'l mehnati ijtimoiy adolatni ta'minlashga hissa qo'shadi, chunki u teng imkoniyatlar yaratadi va adolatli mehnat sharoitlarini ta'minlaydi."
    },
    {
      "id": 174,
      "input": "San'at va qo'l mehnatining milliy an'analar bilan bog'liqligi qanday tushuniladi?",
      "output": "San'at va qo'l mehnati milliy an'analar, urf-odatlar va tarixni saqlash, ularni yangi avlodga yetkazishda muhim rol o'ynaydi."
    },
    {
      "id": 175,
      "input": "Qo'l mehnati mahsulotlarini yaratishda kimyoviy moddalar qanday ta'sir qiladi?",
      "output": "Kimyoviy moddalar, masalan, bo'yoqlar va yopishtiruvchi materiallar, mahsulotning sifatini va ekologik ta'sirini belgilaydi."
    },
    {
      "id": 176,
      "input": "San'at va qo'l mehnatida jismoniy mehnatning ahamiyati qanday?",
      "output": "Jismoniy mehnat san'at va qo'l mehnatida asarlarning shaklini yaratishda, materiallarni ishlov berishda va estetik detallarga e'tibor qaratishda muhim rol o'ynaydi."
    },
    {
      "id": 177,
      "input": "San'at asarlarini yaratishda insonning tabiiy muhiti qanday aks ettiriladi?",
      "output": "Insonning tabiiy muhiti san'atda landshaft, tabiat va ekologik muammolar orqali aks ettiriladi."
    },
    {
      "id": 178,
      "input": "Qo'l mehnati mahsulotlarini yaratishda texnologiyalarning roli qanday?",
      "output": "Texnologiyalar qo'l mehnati mahsulotlarini tez va samarali ishlab chiqarishda, sifatni oshirishda va yangi dizaynlarni yaratishda yordam beradi."
    },
    {
      "id": 179,
      "input": "San'at va qo'l mehnatida gender tengligi qanday ifodalanadi?",
      "output": "Gender tengligi san'at va qo'l mehnatida erkak va ayol san'atkorlar uchun teng imkoniyatlar yaratishda aks ettiriladi."
    },
    {
      "id": 180,
      "input": "San'at asarlarining mohiyatini tushunishda tarixiy kontekst qanday ahamiyatga ega?",
      "output": "Tarixiy kontekst san'at asarining yaratilishiga ta'sir ko'rsatgan ijtimoiy, siyosiy va madaniy omillarni tushunishga yordam beradi."
    },
    {
      "id": 181,
      "input": "San'at va qo'l mehnatida kreativ yondashuvlarning roli qanday?",
      "output": "Kreativ yondashuvlar yangi va innovatsion g'oyalar yaratishda, an'anaviy uslublar va texnikalarni o'zgartirishda yordam beradi."
    },
    {
      "id": 182,
      "input": "Qo'l mehnati mahsulotlari yaratishda yangi avlodning roli qanday?",
      "output": "Yangi avlod yangi texnologiyalarni, ekologik yondashuvlarni va zamonaviy dizaynlarni qo'llash orqali qo'l mehnatini rivojlantiradi."
    },
    {
      "id": 183,
      "input": "San'at asarlarini yaratishda hayotdan olingan ilhom qanday rol o'ynaydi?",
      "output": "Hayotdan olingan ilhom san'at asarlarini yanada hissiy va ma'noli qiladi, chunki ular san'atkorning shaxsiy tajribasi va ko'rish nuqtasini aks ettiradi."
    },
    {
      "id": 184,
      "input": "San'at va qo'l mehnati o'rtasidagi bog'liqlik qanday ifodalanadi?",
      "output": "San'at va qo'l mehnati o'rtasidagi bog'liqlik ijodkorlik va texnik ko'nikmalarni birlashtirib, amaliy va estetik qadriyatlarni yaratadi."
    },
    {
      "id": 185,
      "input": "Qo'l mehnatida ekologik toza texnologiyalarni joriy etishning afzalliklari nimalar?",
      "output": "Ekologik toza texnologiyalar tabiiy resurslardan foydalanishni minimallashtiradi, chiqindilarni kamaytiradi va atrof-muhitni saqlaydi."
    },
    {
      "id": 186,
      "input": "San'at va qo'l mehnatida innovatsiyalarni qanday qo'llash mumkin?",
      "output": "Innovatsiyalar yangi texnologiyalar, materiallar va dizayn uslublarini qo'llash orqali mahsulotlarni yaxshilash, samaradorlikni oshirishga yordam beradi."
    },
    {
      "id": 187,
      "input": "San'at asarlarini yaratishda arxitektura va dizaynning o'zaro aloqasi qanday?",
      "output": "Arxitektura va dizayn san'atda makon, shakl va funktsional jihatlarni o'zaro uyg'unlashtirib, estetik va amaliy talablarni qondiradi."
    },
    {
      "id": 188,
      "input": "Qo'l mehnatining an'anaviy usullarini saqlashda qanday qiyinchiliklar yuzaga keladi?",
      "output": "An'anaviy usullarni saqlashda zamonaviy texnologiyalar, yangi materiallar va bozor talablarining o'zgarishi qiyinchiliklar yaratishi mumkin."
    },
    {
      "id": 189,
      "input": "San'at va qo'l mehnatini rivojlantirishda moliyaviy qo'llab-quvvatlash qanday rol o'ynaydi?",
      "output": "Moliyaviy qo'llab-quvvatlash san'at va qo'l mehnatining rivojlanishiga, yangi loyihalar va tadbirlarni amalga oshirishga yordam beradi."
    },
    {
      "id": 190,
      "input": "San'at asarlarini yaratishda materiali va texnologiyalari qanday ahamiyatga ega?",
      "output": "Materiallar va texnologiyalar san'at asarining sifatini, estetik qimmatini va funksional imkoniyatlarini belgilaydi."
    },
    {
      "id": 191,
      "input": "Qo'l mehnati mahsulotlari va san'at asarlarini qanday qilib raqamli muhitda saqlash mumkin?",
      "output": "Raqamli muhitda saqlash uchun san'at va qo'l mehnati asarlarini skanerlash, raqamli formatga o'tkazish va arxivlash usullari mavjud."
    },
    {
      "id": 192,
      "input": "San'at va qo'l mehnatining ijtimoiy integratsiya jarayonidagi roli qanday?",
      "output": "San'at va qo'l mehnati ijtimoiy integratsiyada madaniy merosni hurmat qilish, ijtimoiy adolatni ta'minlash va madaniy differensiyasiyani aks ettirish orqali rol o'ynaydi."
    },
    {
      "id": 193,
      "input": "San'at asarlarini yaratishda innovatsion usullarni qanday joriy etish mumkin?",
      "output": "Innovatsion usullarni joriy etish uchun yangi texnologiyalar, materiallar va dizayn yondashuvlarini tadqiq qilish va amaliyotga joriy etish zarur."
    },
    {
      "id": 194,
      "input": "Qo'l mehnatida ijtimoiy va ekologik mas'uliyatni qanday rivojlantirish mumkin?",
      "output": "Ijtimoiy va ekologik mas'uliyatni rivojlantirish uchun atrof-muhitni saqlash, ishchilarni himoya qilish va qayta ishlash texnologiyalarini qo'llash muhimdir."
    },
    {
      "id": 195,
      "input": "San'at va qo'l mehnatida \"yashil\" texnologiyalar qanday ishlatiladi?",
      "output": "\"Yashil\" texnologiyalar energiya tejash, qayta ishlanadigan materiallar va ekologik jihatlarni hisobga olishni nazarda tutadi."
    },
    {
      "id": 196,
      "input": "San'at va qo'l mehnatidagi texnik yondashuvlar qanday rivojlanmoqda?",
      "output": "Texnik yondashuvlar raqamli texnologiyalar, 3D bosib chiqarish, robototexnika va avtomatlashtirilgan ishlab chiqarish jarayonlarida rivojlanmoqda."
    },
    {
      "id": 197,
      "input": "Qo'l mehnati mahsulotlarining bozor raqobatida qanday ustunliklarga ega bo'lishi mumkin?",
      "output": "Qo'l mehnati mahsulotlari o'ziga xos dizayn, yuqori sifatli materiallar va sifatli ishlab chiqarish jarayoni orqali bozorda ustunlikka ega bo'lishi mumkin."
    },
    {
      "id": 198,
      "input": "San'at asarlarini yaratishda qadriyatlar va estetik me'yorlar qanday shakllanadi?",
      "output": "Qadriyatlar va estetik me'yorlar san'atkorlarning shaxsiy dunyoqarashlari, madaniy meros va jamiyatdagi estetikaning rivojlanishiga asoslanadi."
    },
    {
      "id": 199,
      "input": "Qo'l mehnati mahsulotlarini eksport qilishda qanday qiyinchiliklar mavjud?",
      "output": "Eksport qilishda bozorda talab, sifatni saqlash, logistik xizmatlar va turli mamlakatlardagi me'yorlarga moslashish qiyinchiliklar yaratishi mumkin."
    },
    {
      "id": 200,
      "input": "San'at va qo'l mehnatining o'zgaruvchan ijtimoiy roli qanday?",
      "output": "O'zgaruvchan ijtimoiy rolda san'at va qo'l mehnati jamiyatning madaniy va iqtisodiy ehtiyojlarini qondirishga, yangi qadriyatlarni aks ettirishga yordam beradi."
    },
    {
      "id": 201,
      "input": "Qo'l mehnati mahsulotlarining ekoturizmga ta'siri qanday?",
      "output": "Qo'l mehnati mahsulotlari ekoturizmni rivojlantirishga yordam beradi, chunki ular mahalliy madaniyatni tanitadi va tabiatga hurmatni oshiradi."
    },
    {
      "id": 202,
      "input": "San'at va qo'l mehnati asarlarining ta'lim tizimidagi o'rni qanday?",
      "output": "Ta'lim tizimida san'at va qo'l mehnati ijodkorlikni rivojlantirish, madaniy qadriyatlarni o'rgatish va amaliy ko'nikmalarni shakllantirishda muhim ahamiyatga ega."
    },
    {
      "id": 203,
      "input": "San'at va qo'l mehnati mahsulotlarining brendlashuvi qanday amalga oshiriladi?",
      "output": "Brendlashuv mahsulotning noyobligini, sifatini va tarixiy ahamiyatini aks ettiradigan logotiplar, markalar va reklama materiallari orqali amalga oshiriladi."
    },
    {
      "id": 204,
      "input": "San'at va qo'l mehnatining tarixiy kontekstini tushunish qanday yordam beradi?",
      "output": "Tarixiy kontekstni tushunish san'at va qo'l mehnati asarlarini yaratishdagi ijtimoiy, siyosiy va madaniy sharoitlarni yanada chuqurroq anglashga yordam beradi."
    },
    {
      "id": 205,
      "input": "Qo'l mehnatining zamonaviy dunyoda qanday yangi shakllari mavjud?",
      "output": "Zamonaviy qo'l mehnati shakllari ekologik dizayn, raqamli san'at, modulyar ishlab chiqarish va interaktiv san'atni o'z ichiga oladi."
    },
    {
      "id": 206,
      "input": "San'at va qo'l mehnatidagi madaniy o'zgarishlarni qanday kuzatish mumkin?",
      "output": "Madaniy o'zgarishlarni kuzatish san'at va qo'l mehnatidagi uslublar, ranglar, shakllar va texnikalardagi o'zgarishlar orqali amalga oshiriladi."
    },
    {
      "id": 207,
      "input": "San'at va qo'l mehnatining barqarorligini ta'minlashda qanday choralar ko'rilishi kerak?",
      "output": "Barqarorlikni ta'minlash uchun ekologik materiallar, qayta ishlash, energiya tejash va mehnat sharoitlarini yaxshilash choralarini ko'rish zarur."
    },
    {
      "id": 208,
      "input": "Qo'l mehnati va san'at asarlarini yaratishda davlatning qo'llab-quvvatlashi qanday bo'lishi kerak?",
      "output": "Davlat qo'llab-quvvatlashi grantslar, ta'lim dasturlari, ko'rgazmalar va san'atkorlar uchun infratuzilma yaratish orqali amalga oshiriladi."
    },
    {
      "id": 209,
      "input": "San'at asarlarini yaratishda an'anaviy va zamonaviy uslublarni qanday uyg'unlashtirish mumkin?",
      "output": "An'anaviy va zamonaviy uslublarni uyg'unlashtirish orqali san'atkorlar eski va yangi texnikalarni birlashtirib, yangi estetik shakllar yaratishadi."
    },
    {
      "id": 210,
      "input": "Qo'l mehnatining tarixiy va madaniy ahamiyatini qanday saqlab qolish mumkin?",
      "output": "Tarixiy va madaniy ahamiyatni saqlab qolish uchun avlodlarga o'rgatish, konservatsiya qilish va madaniy merosni targ'ib qilish zarur."
    },
    {
      "id": 211,
      "input": "San'at va qo'l mehnatidagi xususiylashtirishning ijtimoiy ta'siri qanday?",
      "output": "Xususiylashtirish san'at va qo'l mehnatida tijoratlashtirishni kuchaytiradi, ammo ko'plab kichik san'atkorlar va mehnat sohalari uchun imkoniyatlarni cheklaydi."
    },
    {
      "id": 212,
      "input": "Qo'l mehnatida materiallarning ekologik jihatlarini qanday baholash mumkin?",
      "output": "Materiallarning ekologik jihatlari ularning qayta ishlanishi, tabiiy resurslardan foydalanish va ishlab chiqarish jarayonida atrof-muhitga ta'sirini o'rganish orqali baholanadi."
    },
    {
      "id": 213,
      "input": "San'at va qo'l mehnatining mashhur bo'lishi uchun qanday strategiyalar mavjud?",
      "output": "Mashhurlikni oshirish uchun marketing, brend yaratish, ko'rgazmalar tashkil qilish va ijtimoiy media orqali faoliyat yuritish kerak."
    },
    {
      "id": 214,
      "input": "San'at va qo'l mehnatida texnologiyalarni qanday integratsiya qilish mumkin?",
      "output": "Texnologiyalarni integratsiya qilish uchun raqamli dizayn, 3D bosib chiqarish va avtomatlashtirilgan ishlab chiqarishni qo'llash mumkin."
    },
    {
      "id": 215,
      "input": "Qo'l mehnati mahsulotlarini yaratishda ijtimoiy tafovutlarni qanday kamaytirish mumkin?",
      "output": "Ijtimoiy tafovutlarni kamaytirish uchun teng imkoniyatlar yaratish, barcha guruhlarni qo'llab-quvvatlash va adolatli mehnat sharoitlarini ta'minlash zarur."
    },
    {
      "id": 216,
      "input": "San'atda \"interaktivlik\" qanday amalga oshiriladi?",
      "output": "Interaktivlik san'at asariga tomoshabinlarni jalb qilish orqali ularni faol ishtirokchiga aylantiradi, masalan, raqamli texnologiyalar yordamida."
    },
    {
      "id": 217,
      "input": "San'at va qo'l mehnatida asarlarning avangard yondashuvlari qanday?",
      "output": "Avangard yondashuvlar yangi, eksperimentlar, va radikal g'oyalar orqali san'at va qo'l mehnatini yangi shakllar va uslublarga olib keladi."
    },
    {
      "id": 218,
      "input": "Qo'l mehnatida ishchilarning huquqlari qanday himoya qilinadi?",
      "output": "Ishchilarning huquqlari mehnat qonunlari, kasaba uyushmalari, xavfsizlik va sog'liqni saqlash sharoitlari bilan himoya qilinadi."
    },
    {
      "id": 219,
      "input": "San'at asarlarini yaratishda qadimgi uslublarning zamonaviy kontekstdagi roli qanday?",
      "output": "Qadimgi uslublar zamonaviy kontekstda madaniy an'analarning davomiyligini ta'minlaydi va tarixiy bog'lanishlarni aks ettiradi."
    },
    {
      "id": 220,
      "input": "San'atda \"pop-art\" uslubi qanday ta'sir ko'rsatadi?",
      "output": "Pop-art uslubi ommaviy madaniyat, reklama va kundalik hayot predmetlarini san'atsal shakllarda qayta ishlaydi, mashhur madaniyatni o'ziga jalb qiladi."
    },
    {
      "id": 221,
      "input": "Qo'l mehnati va san'at asarlarini yaratishda ijtimoiy tarmoqlar qanday yordam beradi?",
      "output": "Ijtimoiy tarmoqlar san'atkorlarga o'z asarlarini global auditoriyaga taqdim etish, izdoshlari bilan aloqa o'rnatish va yangi imkoniyatlarni yaratish imkonini beradi."
    },
    {
      "id": 222,
      "input": "San'at va qo'l mehnatining madaniy ahamiyatini qanday baholash mumkin?",
      "output": "Madaniy ahamiyatni baholash asarlarning milliy va xalqaro miqyosda qadrlanishi, tarixiy merosni saqlashi va madaniy identifikatsiyani ifodalashga asoslanadi."
    },
    {
      "id": 223,
      "input": "Qo'l mehnati mahsulotlari va san'at asarlari qanday qilib barqaror rivojlantiriladi?",
      "output": "Barqaror rivojlantirish ekologik materiallar, qayta ishlash, energiya samaradorligi va ijtimoiy adolatga asoslanadi."
    },
    {
      "id": 224,
      "input": "San'atda avangard yondashuvlarning ijtimoiy ta'siri qanday?",
      "output": "Avangard yondashuvlar ijtimoiy tafakkur va madaniy normalarni savol ostiga qo'yib, yangilikka va o'zgarishga imkon yaratadi."
    },
    {
      "id": 225,
      "input": "Qo'l mehnati va san'atda ekologik mas'uliyatning roli qanday?",
      "output": "Ekologik mas'uliyat materiallardan samarali foydalanish, chiqindilarni kamaytirish va tabiiy resurslarni tejashni anglatadi."
    },
    {
      "id": 226,
      "input": "San'at va qo'l mehnatida qadriyatlar qanday shakllanadi?",
      "output": "Qadriyatlar san'atkorlarning shaxsiy dunyoqarashi, jamiyatdagi madaniy me'yorlar va global o'zgarishlarga javoban shakllanadi."
    },
    {
      "id": 227,
      "input": "San'at va qo'l mehnatidagi o'zgarishlarga qanday tezkor javob berish mumkin?",
      "output": "O'zgarishlarga javob berish uchun innovatsiyalar, moslashuvchanlik va yangi texnologiyalarni tezda joriy etish kerak."
    },
    {
      "id": 228,
      "input": "San'at va qo'l mehnatida raqamli texnologiyalarning roli qanday?",
      "output": "Raqamli texnologiyalar san'at va qo'l mehnatini yaratishda yangi imkoniyatlar, osonlashtirilgan jarayonlar va kengaytirilgan auditoriyalarni taqdim etadi."
    },
    {
      "id": 229,
      "input": "San'at va qo'l mehnati mahsulotlarining sifatini qanday oshirish mumkin?",
      "output": "Sifatni oshirish uchun yuqori sifatli materiallar, malakali ishchilar, zamonaviy texnikalar va doimiy sifat nazorati talab etiladi."
    },
    {
      "id": 230,
      "input": "San'at va qo'l mehnatidagi gender rollari qanday ifodalanadi?",
      "output": "Gender rollari san'at va qo'l mehnatida ko'pincha shaxsiy yondashuvlar, stilistik tanlovlar va jamiyatdagi gender ta'siridan kelib chiqadi."
    },
    {
      "id": 231,
      "input": "Qo'l mehnati mahsulotlarining turli bozorlar uchun moslashtirilishi qanday amalga oshadi?",
      "output": "Bozor talablarini o'rganish, mahalliy xususiyatlarni inobatga olish va turli madaniy ehtiyojlarni qondirish orqali moslashtirish amalga oshiriladi."
    },
    {
      "id": 232,
      "input": "San'at asarlarini yaratishda ziddiyat va qarama-qarshilik qanday ishlatiladi?",
      "output": "Ziddiyat va qarama-qarshilik san'atda yangi fikrlar, kontrastlar va e'tibor jalb qiluvchi elementlarni yaratadi."
    },
    {
      "id": 233,
      "input": "Qo'l mehnatida yangi texnologiyalarning qo'llanishi qanday o'zgarishlarni keltirib chiqaradi?",
      "output": "Yangi texnologiyalar qo'l mehnatida ishlab chiqarish jarayonlarini tezlashtiradi, sifatni oshiradi va yaratish imkoniyatlarini kengaytiradi."
    },
    {
      "id": 234,
      "input": "San'atda minimalizmning ahamiyati qanday?",
      "output": "Minimalizm soddalikka, funksionallikka va estetik jihatdan toza shakllarga asoslanadi, bu esa tasvirni aniq va ta'sirli qiladi."
    },
    {
      "id": 235,
      "input": "San'at va qo'l mehnatida ekologik dizaynning roli qanday?",
      "output": "Ekologik dizayn tabiatni saqlash, qayta ishlashni rag'batlantirish va energiya samaradorligini oshirishga qaratilgan."
    },
    {
      "id": 236,
      "input": "Qo'l mehnatida an'anaviy va zamonaviy texnikalarni qanday uyg'unlashtirish mumkin?",
      "output": "Uyg'unlashtirish uchun zamonaviy texnologiyalarni an'anaviy uslublarga qo'llash va yangi materiallar bilan sintez qilish mumkin."
    },
    {
      "id": 237,
      "input": "San'at va qo'l mehnatida ishtirok etayotgan yosh avlodning o'rni qanday?",
      "output": "Yosh avlod yangi texnologiyalarni, global tendensiyalarni va ekologik mas'uliyatni ta'minlashga hissa qo'shadi."
    },
    {
      "id": 238,
      "input": "San'at va qo'l mehnatida \"renessans\" uslubi qanday ifodalanadi?",
      "output": "Renessans uslubi insoniyatni, tabiiy dunyoni va ilmiy bilimlarni o'rganishga asoslangan, klassik qadriyatlar va an'anaviy shakllarga qaytishdir."
    },
    {
      "id": 239,
      "input": "Qo'l mehnati mahsulotlarining sifatini qanday tekshirish mumkin?",
      "output": "Sifat tekshiruvi orqali materiallarning sifatini, ishlov berish jarayonlarini va yakuniy mahsulotning funksionallik va estetik jihatlarini baholash mumkin."
    },
    {
      "id": 240,
      "input": "San'at va qo'l mehnatida mahalliy resurslardan foydalanishning ahamiyati qanday?",
      "output": "Mahalliy resurslar ekologik ta'sirni kamaytiradi, iqtisodiy o'sishni rag'batlantiradi va madaniy merosni saqlaydi."
    },
    {
      "id": 241,
      "input": "San'at va qo'l mehnatidagi raqamli san'at qanday rivojlanmoqda?",
      "output": "Raqamli san'at yangi texnologiyalar va raqamli vositalar yordamida yaratilib, san'atkorlarga yangi ifoda usullarini taqdim etadi."
    },
    {
      "id": 242,
      "input": "San'at va qo'l mehnati jarayonida jamiyatning roli qanday?",
      "output": "Jamiyat san'at va qo'l mehnatini qo'llab-quvvatlaydi, uni qadrlaydi va rivojlanishi uchun zarur infratuzilma yaratadi."
    },
    {
      "id": 243,
      "input": "San'at va qo'l mehnatida ekologik mahsulotlar yaratishda qanday innovatsiyalar mavjud?",
      "output": "Ekologik mahsulotlar yaratishda qayta ishlanadigan materiallar, organik pigmentlar va ekologik texnologiyalar qo'llaniladi."
    },
    {
      "id": 244,
      "input": "San'at asarlarini yaratishda abstrakt va realistik yondashuvlar qanday farq qiladi?",
      "output": "Abstrakt san'at shakllarni va ranglarni noan'anaviy tarzda ishlatadi, realistik san'at esa haqiqatga yaqin tasvirlarni yaratadi."
    },
    {
      "id": 245,
      "input": "Qo'l mehnatida innovatsion texnologiyalarni qanday tatbiq etish mumkin?",
      "output": "Innovatsion texnologiyalarni tatbiq etish uchun 3D bosib chiqarish, robototexnika va avtomatlashtirilgan tizimlar yordamida ishlab chiqarish jarayonini yaxshilash mumkin."
    },
    {
      "id": 246,
      "input": "San'at va qo'l mehnatining etnik va madaniy xilma-xilligi qanday aks ettiriladi?",
      "output": "Etnik va madaniy xilma-xillik san'at asarlarida ranglar, shakllar va simvollar orqali ifodalanadi, bu esa har bir madaniyatni o'ziga xos tarzda aks ettiradi."
    },
    {
      "id": 247,
      "input": "Qo'l mehnati mahsulotlarida qat'iy sifat nazorati qanday amalga oshiriladi?",
      "output": "Sifat nazorati ishlab chiqarish jarayonining har bir bosqichida tekshiruvlar, sinovlar va sifatni baholash orqali amalga oshiriladi."
    },
    {
      "id": 248,
      "input": "San'at asarlarini yaratishda zamonaviy materiallar qanday qo'llaniladi?",
      "output": "Zamonaviy materiallar, masalan, plastmassa, kompozitlar va ekologik materiallar san'at asarlarini yaratishda estetik va funksional jihatlarni takomillashtiradi."
    },
    {
      "id": 249,
      "input": "Qo'l mehnatida o'ziga xos dizayn va ijodiy uslublar qanday shakllanadi?",
      "output": "O'ziga xos dizayn va ijodiy uslublar san'atkorning shaxsiy tajribasi, madaniy merosi va zamonaviy ehtiyojlar asosida shakllanadi."
    },
    {
      "id": 250,
      "input": "San'at va qo'l mehnatida zamonaviy dizaynning roli qanday?",
      "output": "Zamonaviy dizayn san'at va qo'l mehnatini funksional va estetik jihatdan innovatsion shakllarda namoyon etadi."
    },
    {
      "id": 251,
      "input": "San'at asarlarini yaratishda ziddiyatli elementlarni qanday ishlatish mumkin?",
      "output": "Ziddiyatli elementlar san'atda kontrastlarni kuchaytirish, yangi fikrlar va hissiyotlarni ochib berish uchun ishlatiladi."
    },
    {
      "id": 252,
      "input": "San'at va qo'l mehnatining ijtimoiy adolatga ta'siri qanday?",
      "output": "San'at va qo'l mehnati ijtimoiy adolatni targ'ib qiladi, odamlar o'rtasida tenglikni va hurmatni oshiradi."
    },
    {
      "id": 253,
      "input": "Qo'l mehnatining xususiyatlari qanday baholanadi?",
      "output": "Qo'l mehnatining xususiyatlari sifat, naqsh, texnika va ijodiy yondashuvlar orqali baholanadi."
    },
    {
      "id": 254,
      "input": "San'at va qo'l mehnatining global bozorda o'rni qanday?",
      "output": "San'at va qo'l mehnatining global bozorda o'rni uning innovatsion dizayni, sifatli ishlab chiqarilishi va madaniy ahamiyatiga bog'liq."
    },
    {
      "id": 255,
      "input": "San'at va qo'l mehnatida ekologik barqarorlikni qanday ta'minlash mumkin?",
      "output": "Ekologik barqarorlikni ta'minlash uchun qayta ishlash, organik materiallar va atrof-muhitga zarar etkazmaydigan texnologiyalarni qo'llash zarur."
    },
    {
      "id": 256,
      "input": "San'at va qo'l mehnatida madaniy merosni saqlashning ahamiyati qanday?",
      "output": "Madaniy merosni saqlash orqali tarixiy va madaniy qadriyatlarni himoya qilish, yangi avlodlarga etkazish va ularni kelajakda qadrlash mumkin."
    },
    {
      "id": 257,
      "input": "Qo'l mehnati mahsulotlarining sifatini qanday oshirish mumkin?",
      "output": "Sifatni oshirish uchun materiallar sifatini tekshirish, texnikalarni yangilash va ishchilarni malakasini oshirish zarur."
    },
    {
      "id": 258,
      "input": "San'at asarlarini yaratishda ekologik mas'uliyat qanday ta'minlanadi?",
      "output": "Ekologik mas'uliyatni ta'minlash uchun resurslarni tejash, chiqindilarni kamaytirish va atrof-muhitga zarar etkazmaydigan materiallarni ishlatish muhimdir."
    },
    {
      "id": 259,
      "input": "San'at va qo'l mehnatining iqtisodiy ahamiyati qanday?",
      "output": "San'at va qo'l mehnati iqtisodiyotga hissa qo'shadi, yangi ish o'rinlarini yaratadi va madaniy sanoatni rivojlantiradi."
    },
    {
      "id": 260,
      "input": "San'at va qo'l mehnatida kasbiy o'sishni qanday ta'minlash mumkin?",
      "output": "Kasbiy o'sish malaka oshirish, yangi texnologiyalarni o'rganish va ijodiy yondashuvlarni rivojlantirish orqali ta'minlanadi."
    },
    {
      "id": 261,
      "input": "San'at va qo'l mehnatida ranglar va shakllarning roli qanday?",
      "output": "Ranglar va shakllar san'at asarlarida hissiyotlarni ifodalash, e'tibor jalb qilish va ma'no yaratish uchun ishlatiladi."
    },
    {
      "id": 262,
      "input": "Qo'l mehnati mahsulotlarini yaratishda zamonaviy texnologiyalarning roli qanday?",
      "output": "Zamonaviy texnologiyalar mahsulotlarni tezda yaratish, ishlab chiqarish jarayonini avtomatlashtirish va sifatni oshirish imkonini beradi."
    },
    {
      "id": 263,
      "input": "San'at va qo'l mehnatida ilmiy yondashuvning ahamiyati qanday?",
      "output": "Ilmiy yondashuv san'at va qo'l mehnatidagi texnikalar, materiallar va jarayonlarni tadqiq etish va takomillashtirishga yordam beradi."
    },
    {
      "id": 264,
      "input": "Qo'l mehnatida ijtimoiy va madaniy qadriyatlarni qanday ifodalash mumkin?",
      "output": "Ijtimoiy va madaniy qadriyatlar qo'l mehnati orqali ranglar, naqshlar va shakllar yordamida jamiyatning turli jihatlarini aks ettiradi."
    },
    {
      "id": 265,
      "input": "San'at asarlarini yaratishda texnologiya va an'anaviy usullarni qanday uyg'unlashtirish mumkin?",
      "output": "Texnologiya va an'anaviy usullarni uyg'unlashtirish orqali yangi shakllar, texnikalar va materiali qo'llaniladi, bu esa yanada innovatsion va estetik asarlar yaratadi."
    },
    {
      "id": 266,
      "input": "San'at va qo'l mehnatida mintaqaviy yondashuvlarning roli qanday?",
      "output": "Mintaqaviy yondashuvlar madaniy meros va an'analarni saqlash, mahalliy resurslardan foydalanish va mintaqa ehtiyojlarini hisobga olishga yordam beradi."
    },
    {
      "id": 267,
      "input": "San'at va qo'l mehnatidagi tasvirlarning simbolizmi qanday ishlatiladi?",
      "output": "Tasvirlarning simbolizmi madaniy, diniy va tarixiy mazmunlarni ifodalashda ishlatiladi, bu esa asarlarga chuqur ma'no va qatlamlar kiritadi."
    },
    {
      "id": 268,
      "input": "San'at va qo'l mehnatidagi tekstil san'ati qanday rivojlanmoqda?",
      "output": "Tekstil san'ati yangi texnikalar va dizaynlar yordamida yangilanadi, shuningdek, ekologik va ijtimoiy mas'uliyatni hisobga oladi."
    },
    {
      "id": 269,
      "input": "San'at va qo'l mehnatidagi mashhur uslublar qanday shakllanadi?",
      "output": "Mashhur uslublar san'atkorlarning innovatsion g'oyalari, jamiyatning ehtiyojlari va madaniy tendensiyalar asosida shakllanadi."
    },
    {
      "id": 270,
      "input": "San'at va qo'l mehnatida ilg'or texnologiyalarni qanday qo'llash mumkin?",
      "output": "Ilg'or texnologiyalarni qo'llash orqali ishlab chiqarish jarayonlarini yaxshilash, yangi materiallar va dizaynlarni yaratish mumkin."
    },
    {
      "id": 271,
      "input": "San'at va qo'l mehnatida yangi avlod san'atkorlarining ahamiyati qanday?",
      "output": "Yangi avlod san'atkorlari innovatsion fikrlar, yangi uslublar va ekologik mas'uliyatni qo'llash orqali san'at va qo'l mehnatini rivojlantiradi."
    },
    {
      "id": 272,
      "input": "San'at va qo'l mehnatida \"dizayn fikrlash\" yondashuvi qanday ishlaydi?",
      "output": "\"Dizayn fikrlash\" yondashuvi ijodiy muammolarni hal qilish, foydalanuvchi ehtiyojlariga mos yechimlarni yaratish va test qilish jarayonini o'z ichiga oladi."
    },
    {
      "id": 273,
      "input": "Qo'l mehnatida \"o'z-o'zini ishlab chiqarish\" konsepti qanday rivojlanmoqda?",
      "output": "O'z-o'zini ishlab chiqarish, ya'ni DIY (Do It Yourself) madaniyati o'z-o'zini yaratish, ijodiy erkinlik va mustaqillikni qo'llab-quvvatlaydi."
    },
    {
      "id": 274,
      "input": "San'at va qo'l mehnatida ekologik dizaynning kelajagi qanday?",
      "output": "Ekologik dizayn kelajakka umid beradi, chunki u barqaror materiallardan foydalanish, chiqindilarni kamaytirish va tabiiy resurslarni saqlashni maqsad qiladi."
    },
    {
      "id": 275,
      "input": "San'at asarlarini yaratishda texnologik innovatsiyalar qanday ta'sir qiladi?",
      "output": "Texnologik innovatsiyalar san'at yaratish jarayonini tezlashtiradi, yangi ifoda usullarini kashf etadi va san'at asarlarini keng auditoriyaga taqdim etishni osonlashtiradi."
    },
    {
      "id": 276,
      "input": "Qo'l mehnati mahsulotlarining narxlari qanday shakllanadi?",
      "output": "Narxlar materiallar, ishlab chiqarish vaqtiga, malakali ishchilarga va bozor talabiga qarab shakllanadi."
    },
    {
      "id": 277,
      "input": "San'at asarlarini yaratishda minimalizmning qanday roli bor?",
      "output": "Minimalizm oddiylik, tozalikka va funksionallikka e'tibor qaratadi, bu esa asarlarni chuqur va ta'sirchan qiladi."
    },
    {
      "id": 278,
      "input": "Qo'l mehnatida global bozorga chiqishning qanday afzalliklari mavjud?",
      "output": "Global bozorga chiqish san'atkorlar va hunarmandlarga keng auditoriyaga erishish, yangi bozorlarni o'rganish va o'z mahsulotlarini yuqori darajada sotish imkonini beradi."
    },
    {
      "id": 279,
      "input": "San'at va qo'l mehnatida innovatsiyalarni qanday amalga oshirish mumkin?",
      "output": "Innovatsiyalarni amalga oshirish yangi texnologiyalarni, materiallarni va dizayn uslublarini o'rganish, shuningdek, yangi yondashuvlar va tajribalarni sinovdan o'tkazish orqali bo'lishi mumkin."
    },
    {
      "id": 280,
      "input": "Qo'l mehnati mahsulotlarini qayta ishlashning ahamiyati qanday?",
      "output": "Mahsulotlarni qayta ishlash atrof-muhitni himoya qiladi, resurslarni tejaydi va chiqindilarni kamaytiradi."
    },
    {
      "id": 281,
      "input": "San'at va qo'l mehnatida ijtimoiy tarmoqlarning roli qanday?",
      "output": "Ijtimoiy tarmoqlar san'atkorlar va hunarmandlar uchun o'z asarlarini namoyish qilish, mijozlar bilan aloqa o'rnatish va global tarmoq yaratish imkoniyatlarini taqdim etadi."
    },
    {
      "id": 282,
      "input": "San'at va qo'l mehnatidagi \"sustainable fashion\" qanday rivojlanmoqda?",
      "output": "\"Sustainable fashion\" (barqaror moda) ekologik toza materiallar, adolatli mehnat sharoitlari va qayta ishlashni o'z ichiga oladi, bu esa modani barqaror qilishga yordam beradi."
    },
    {
      "id": 283,
      "input": "San'at va qo'l mehnatida etnik tasvirlarning roli qanday?",
      "output": "Etnik tasvirlar san'at va qo'l mehnatida madaniy merosni saqlash, an'anaviy qadriyatlarni ifodalash va madaniy xilma-xillikni namoyish qilishda muhim rol o'ynaydi."
    },
    {
      "id": 284,
      "input": "Qo'l mehnati mahsulotlarini yaratishda energiya samaradorligini qanday oshirish mumkin?",
      "output": "Energiya samaradorligini oshirish uchun ekologik energiya manbalaridan foydalanish, ishlab chiqarishni optimallashtirish va energiya tejovchi texnologiyalarni joriy etish mumkin."
    },
    {
      "id": 285,
      "input": "San'at asarlarini yaratishda kolorimetrik yondashuv qanday ishlaydi?",
      "output": "Kolorimetrik yondashuv ranglarning hissiy va psixologik ta'sirini o'rganadi, bu esa san'at asarlarini yaratishda ranglar orqali ma'no va emotsiyani ifodalash imkonini beradi."
    },
    {
      "id": 286,
      "input": "San'at va qo'l mehnatida \"street art\" qanday rivojlanmoqda?",
      "output": "\"Street art\" ko'cha san'ati o'zining ifodalanganligida, o'ziga xosligini saqlashda va global madaniyatni aks ettirishda muhim ahamiyatga ega bo'lib, ijtimoiy va siyosiy xabarlarni yetkazadi."
    },
    {
      "id": 287,
      "input": "Qo'l mehnati va san'at asarlarida simvolizm qanday ishlatiladi?",
      "output": "Simvolizm ma'lum bir mavzu, tushuncha yoki g'oyani tasvirlash uchun tasvirlar va belgilarni ishlatadi, bu esa asarlarga chuqur ma'no va tafsirlash imkonini beradi."
    },
    {
      "id": 288,
      "input": "San'at va qo'l mehnatida ekologik ta'sirni qanday kamaytirish mumkin?",
      "output": "Ekologik ta'sirni kamaytirish uchun qayta ishlanadigan materiallar, energiya samaradorligi va atrof-muhitga zarar etkazmaydigan texnologiyalarni qo'llash mumkin."
    },
    {
      "id": 289,
      "input": "San'at va qo'l mehnatida an'anaviy uslublarning roli qanday?",
      "output": "An'anaviy uslublar tarixiy va madaniy merosni saqlashda, ijtimoiy qadriyatlarni ifodalashda va kelajak avlodlarga o'tkazishda muhim rol o'ynaydi."
    },
    {
      "id": 290,
      "input": "Qo'l mehnatida \"vintage\" dizayn qanday ahamiyatga ega?",
      "output": "\"Vintage\" dizayn eski uslub va estetikani zamonaviy kontekstda tiklash orqali nostalji uyg'otadi va yangi qiymat yaratadi."
    },
    {
      "id": 291,
      "input": "San'at va qo'l mehnatida ko'rgazmalar qanday ahamiyatga ega?",
      "output": "Ko'rgazmalar san'at va qo'l mehnatini keng auditoriyaga taqdim etish, san'atkorlarga o'z asarlarini namoyish etish va yangi bozorlarga kirish imkonini beradi."
    },
    {
      "id": 292,
      "input": "San'at va qo'l mehnatida \"kreativ\" iqtisodiyotning roli qanday?",
      "output": "\"Kreativ\" iqtisodiyot yangi g'oyalar, dizaynlar va texnologiyalar orqali iqtisodiy o'sishga hissa qo'shadi va innovatsiyalarni rag'batlantiradi."
    },
    {
      "id": 293,
      "input": "San'at asarlarini yaratishda \"interaktiv\" texnologiyalar qanday qo'llaniladi?",
      "output": "\"Interaktiv\" texnologiyalar tomoshabinlar bilan bevosita aloqada bo'lish, ular bilan o'zaro faoliyat yuritish va yangi ijodiy tajribalar yaratishda ishlatiladi."
    },
    {
      "id": 294,
      "input": "San'at va qo'l mehnatida \"multidimensional\" yondashuv qanday amalga oshiriladi?",
      "output": "\"Multidimensional\" yondashuv bir nechta san'at shakllarini birlashtirish orqali ko'p qirrali va yangi ma'nolarni yaratishga imkon beradi."
    },
    {
      "id": 295,
      "input": "Qo'l mehnati mahsulotlarida estetik va funksional xususiyatlarning uyg'unligi qanday ta'minlanadi?",
      "output": "Estetik va funksional xususiyatlarning uyg'unligi materiallar, dizayn va ishlov berish jarayonini sinxronlashtirish orqali ta'minlanadi."
    },
    {
      "id": 296,
      "input": "San'at va qo'l mehnatida \"modular\" dizaynning roli qanday?",
      "output": "\"Modular\" dizayn ko'plab qismlardan iborat bo'lib, mahsulotlarni o'zaro moslashtirish, funksional va estetik jihatdan mustahkamlashtirishga imkon beradi."
    },
    {
      "id": 297,
      "input": "San'at va qo'l mehnatida \"performans\" san'atining ahamiyati qanday?",
      "output": "\"Performans\" san'ati san'atkorning bevosita ishtirokida, vaqt va makon bilan bog'liq ijodiy jarayonni aks ettiradi, bu esa tomoshabinga yangi tajriba taqdim etadi."
    },
    {
      "id": 298,
      "input": "San'at va qo'l mehnatida \"digital art\" ning kelajagi qanday?",
      "output": "\"Digital art\" san'ati texnologiyalar yordamida o'zgarib, yangi ifoda usullarini yaratmoqda va san'at dunyosiga yangi imkoniyatlar olib kelmoqda."
    },
    {
      "id": 299,
      "input": "San'at asarlarini yaratishda \"multimedia\" texnologiyalar qanday qo'llaniladi?",
      "output": "\"Multimedia\" texnologiyalar san'at asarlarini video, audio, animatsiya va interaktiv elementlar bilan birlashtiradi, bu esa tomoshabinga yangi tajriba taqdim etadi."
    },
    {
      "id": 300,
      "input": "Qo'l mehnatida organik materiallar qanday ishlatiladi?",
      "output": "Organik materiallar, masalan, yog'och, to'qimachilik materiallari va tabiiy pigmentlar qo'l mehnatida ekologik va estetik jihatdan boy imkoniyatlar yaratadi."
    },
    {
      "id": 301,
      "input": "San'at asarlarini yaratishda minimalizmning qanday ta'siri bor?",
      "output": "Minimalizm oddiy shakllar va minimal ranglardan foydalanadi, bu esa ko'proq ma'no va hissiyotlarni ifodalashga yordam beradi."
    },
    {
      "id": 302,
      "input": "Qo'l mehnatida qadriyatlarni qanday saqlash mumkin?",
      "output": "Qadriyatlarni saqlash uchun an'anaviy uslublarni qo'llash, madaniy merosni yodgorlik sifatida saqlash va kelajak avlodlarga etkazish zarur."
    },
    {
      "id": 303,
      "input": "San'at va qo'l mehnatida \"bio-design\" qanday rivojlanmoqda?",
      "output": "\"Bio-design\" tabiiy tizimlar va biologik jarayonlardan ilhomlanib, atrof-muhitga zarar bermaydigan dizaynlarni yaratishga qaratilgan."
    },
    {
      "id": 304,
      "input": "Qo'l mehnatida \"fair trade\" (adolatli savdo) tamoyillari qanday ishlatiladi?",
      "output": "\"Fair trade\" tamoyillari mahsulotlar ishlab chiqarish jarayonida adolatli ish haqi va yaxshilangan sharoitlarni ta'minlashga yordam beradi."
    },
    {
      "id": 305,
      "input": "San'at va qo'l mehnatida postmodernizm qanday ta'sir qiladi?",
      "output": "Postmodernizm san'atda an'anaviy qiymatlar va uslublarga qarshi chiqadi, yangi va eksperimental yondashuvlarni rivojlantiradi."
    },
    {
      "id": 306,
      "input": "San'at asarlarini yaratishda \"visual storytelling\" qanday ishlatiladi?",
      "output": "\"Visual storytelling\" asarlar orqali hikoya qilish, tasvirlar va ranglar yordamida voqealar va his-tuyg'ularni ifodalashni o'z ichiga oladi."
    },
    {
      "id": 307,
      "input": "Qo'l mehnatida ranglar va shakllarning psixologik ta'siri qanday?",
      "output": "Ranglar va shakllar odamlarning his-tuyg'ulariga ta'sir qiladi, ular tinchlantirish, energiya berish yoki stressni kamaytirish kabi psixologik reaksiyalarni keltirib chiqarishi mumkin."
    },
    {
      "id": 308,
      "input": "San'at va qo'l mehnatida \"cyber art\" qanday shakllanmoqda?",
      "output": "\"Cyber art\" raqamli texnologiyalar va internetdan foydalangan holda yaratiladi, bu esa san'atni yangi, interaktiv va dinamik shakllarda namoyon etadi."
    },
    {
      "id": 309,
      "input": "San'at asarlarini yaratishda \"immersive\" texnologiyalarning roli qanday?",
      "output": "\"Immersive\" texnologiyalar, masalan, VR va AR, tomoshabinlarni san'at asariga to'liq kirish imkoniyatini yaratadi, bu esa yangi tajriba yaratadi."
    },
    {
      "id": 310,
      "input": "Qo'l mehnatida rang-baranglik qanday qo'llaniladi?",
      "output": "Rang-baranglik qo'l mehnatida estetik joziba yaratish, turli xil materiallar va texnikalarni birlashtirish orqali ijodiy ifodani boyitadi."
    },
    {
      "id": 311,
      "input": "San'at va qo'l mehnatida \"sustainable architecture\" qanday ta'sir qiladi?",
      "output": "\"Sustainable architecture\" atrof-muhitni himoya qilish, resurslarni tejash va ekologik barqarorlikni saqlashni maqsad qiladi, bu esa san'at va dizaynga yangi yondashuvlarni olib keladi."
    },
    {
      "id": 312,
      "input": "Qo'l mehnatida \"handmade\" mahsulotlar qanday qadrlanadi?",
      "output": "\"Handmade\" mahsulotlar o'zining unikal dizayni, sifatli ishlov berilishi va qo'l mehnatiga asoslanganligi sababli yuqori qadrlanadi."
    },
    {
      "id": 313,
      "input": "San'at va qo'l mehnatida \"locally sourced\" materiallarning roli qanday?",
      "output": "Mahalliy manbalardan olingan materiallar ekologik jihatdan barqaror va iqtisodiy jihatdan foydali bo'lib, mahalliy ishlab chiqarishni qo'llab-quvvatlaydi."
    },
    {
      "id": 314,
      "input": "San'at va qo'l mehnatida \"design thinking\" yondashuvining ahamiyati qanday?",
      "output": "\"Design thinking\" yondashuvi ijodiy va innovatsion yechimlar yaratish, muammolarni hal qilish va foydalanuvchi ehtiyojlarini hisobga olishda muhim ahamiyatga ega."
    },
    {
      "id": 315,
      "input": "Qo'l mehnatida \"cultural fusion\" (madaniy aralashuv) qanday amalga oshiriladi?",
      "output": "\"Cultural fusion\" madaniyatlararo yondashuvni taqdim etib, bir nechta madaniy elementlarni birlashtirish orqali yangi, o'ziga xos dizaynlarni yaratadi."
    },
    {
      "id": 316,
      "input": "San'at va qo'l mehnatida \"artisanal\" mahsulotlar qanday xarakterlanadi?",
      "output": "\"Artisanal\" mahsulotlar hunarmandlar tomonidan qo'l bilan yaratilgan, sifatli materiallardan foydalanilgan va o'ziga xos dizaynlarga ega bo'lgan mahsulotlardir."
    },
    {
      "id": 317,
      "input": "San'at asarlarini yaratishda \"conceptual art\" qanday ro'l o'ynaydi?",
      "output": "\"Conceptual art\" san'ating asosiy maqsadi g'oya va tushunchalarni ifodalashdir, u shakllar va materiallardan ko'ra ma'no va kontseptlarni yoritishga e'tibor qaratadi."
    },
    {
      "id": 318,
      "input": "San'at va qo'l mehnatida \"augmented reality\" (AR) texnologiyasining roli qanday?",
      "output": "AR texnologiyasi san'at asarlarini interaktiv qilish, tomoshabinlarni yangi darajaga olib chiqish va san'atni jonlantirish imkoniyatini beradi."
    },
    {
      "id": 319,
      "input": "San'at va qo'l mehnatida \"3D printing\" qanday yutuqlarni olib keldi?",
      "output": "\"3D printing\" san'at va qo'l mehnatida murakkab shakllarni yaratishni osonlashtirdi va ularni tezda ishlab chiqarishga imkon berdi."
    },
    {
      "id": 320,
      "input": "San'at asarlarini yaratishda \"cyberpunk\" uslubining roli qanday?",
      "output": "\"Cyberpunk\" uslubi texnologik va futuristik tasvirlarni o'z ichiga oladi, jamiyatning ijtimoiy va texnologik o'zgarishlarini aks ettiradi."
    },
    {
      "id": 321,
      "input": "San'at va qo'l mehnatida \"biomimicry\" (biologik ilhom) qanday qo'llaniladi?",
      "output": "\"Biomimicry\" tabiiy tizimlar va jarayonlardan ilhomlanib, yangi dizaynlar yaratishda tabiiy dunyoni modellashga asoslanadi."
    },
    {
      "id": 322,
      "input": "San'at va qo'l mehnatida \"upcycling\" (qayta ishlash va takomillashtirish) qanday amalga oshiriladi?",
      "output": "\"Upcycling\" eski materiallar va mahsulotlarni qayta ishlash orqali yangi, funksional va estetik jihatdan mukammal asarlar yaratish mumkin."
    },
    {
      "id": 323,
      "input": "Qo'l mehnatida \"craftsmanship\" (hunarmandchilik) qanday qadrlanadi?",
      "output": "\"Craftsmanship\" yuqori sifatli qo'l mehnati, tajriba va san'atchilikni anglatadi, ularni yaratish jarayonida nozik detallar va mukammallikka e'tibor qaratiladi."
    },
    {
      "id": 324,
      "input": "San'at va qo'l mehnatida \"minimalist\" dizaynning ahamiyati qanday?",
      "output": "\"Minimalist\" dizayn oddiylikni, tozaligini va funksionallikni ta'kidlaydi, bu esa san'at asarlarida ma'no va go'zallik yaratishga yordam beradi."
    },
    {
      "id": 325,
      "input": "Qo'l mehnatida \"virtual reality\" (VR) texnologiyalarining roli qanday?",
      "output": "VR texnologiyalari tomoshabinni san'at asariga butunlay boshqacha bir tajriba orqali jalb qiladi, interaktiv va immersiv san'at yaratishga imkon beradi."
    },
    {
      "id": 326,
      "input": "San'at asarlarini yaratishda \"eco-friendly\" yondashuv qanday ta'sir qiladi?",
      "output": "\"Eco-friendly\" yondashuv materiallar va ishlab chiqarish jarayonlarida atrof-muhitga zarar yetkazmaslikni ta'minlaydi, bu esa barqaror san'at va dizaynni rivojlantiradi."
    },
    {
      "id": 327,
      "input": "San'at va qo'l mehnatida \"digital fabrication\" qanday rivojlanmoqda?",
      "output": "\"Digital fabrication\" texnologiyalari, masalan, lazerli kesish va 3D bosib chiqarish, san'at asarlarini yaratish jarayonini tezlashtiradi va yanada aniqroq qilishga yordam beradi."
    },
    {
      "id": 328,
      "input": "San'at va qo'l mehnatida \"modular design\" qanday qo'llaniladi?",
      "output": "\"Modular design\" bir nechta qismlardan tashkil topgan tizimlarni yaratishni nazarda tutadi, bu esa funksionallik va estetikani uyg'unlashtirishga yordam beradi."
    },
    {
      "id": 329,
      "input": "San'at va qo'l mehnatida \"open-source\" yondashuvi qanday ishlaydi?",
      "output": "\"Open-source\" yondashuvi resurslarni umumiy foydalanish uchun ochiq qiladi, bu esa ijodkorlar va san'atkorlar o'rtasida hamkorlikni rivojlantiradi."
    },
    {
      "id": 330,
      "input": "San'at asarlarini yaratishda \"transmedia\" texnologiyalarining roli qanday?",
      "output": "\"Transmedia\" texnologiyalari bir nechta platformalar va formatlar orqali hikoyalarni taqdim etishga imkon beradi, bu esa san'at asarlarini kengroq auditoriyaga taqdim etadi."
    },
    {
      "id": 331,
      "input": "San'at va qo'l mehnatida \"diy\" (Do It Yourself) harakati qanday rivojlanmoqda?",
      "output": "\"DIY\" harakati ijodiy ifoda va o'z-o'zini ishlab chiqarishning qadriyatini ta'kidlaydi, bu esa hunarmandchilikni rivojlantiradi va ijodiy erkinlikni qo'llab-quvvatlaydi."
    },
    {
      "id": 332,
      "input": "San'at asarlarini yaratishda \"immersive experience\" qanday ta'minlanadi?",
      "output": "\"Immersive experience\" texnologiyalar va fizikal interaktivlik orqali tomoshabinni san'at asariga to'liq jalb qilishni ta'minlaydi."
    },
    {
      "id": 333,
      "input": "San'at va qo'l mehnatida \"eco-innovation\" (eko-innovatsiya) qanday ishlatiladi?",
      "output": "\"Eco-innovation\" ekologik jihatdan barqaror yechimlar yaratish orqali yangi materiallar, texnologiyalar va dizaynlarni ishlab chiqishga qaratilgan."
    },
    {
      "id": 334,
      "input": "San'at va qo'l mehnatida \"biodegradable\" materiallar qanday qo'llaniladi?",
      "output": "\"Biodegradable\" materiallar ekologik toza va atrof-muhitga zarar keltirmaydigan mahsulotlar yaratishga imkon beradi, ayniqsa ularni qo'l mehnatida ishlatish foydalidir."
    },
    {
      "id": 335,
      "input": "San'at va qo'l mehnatida \"generative design\" texnologiyasining roli qanday?",
      "output": "\"Generative design\" texnologiyalari kompyuter algoritmlari yordamida dizaynlarni yaratadi, bu esa murakkab shakllar va innovatsion yondashuvlarni yaratishga yordam beradi."
    },
    {
      "id": 336,
      "input": "San'at va qo'l mehnatida \"artificial intelligence\" (AI) qanday ishlatiladi?",
      "output": "\"Artificial intelligence\" san'at va qo'l mehnatida dizayn yaratish, ranglarni tahlil qilish va san'at asarlarini optimallashtirish kabi vazifalarda ishlatiladi."
    },
    {
      "id": 337,
      "input": "Qo'l mehnatida \"upcycled\" materiallarning qanday ahamiyati bor?",
      "output": "\"Upcycled\" materiallar mavjud mahsulotlar va materiallardan yangi va sifatli asarlar yaratishga imkon beradi, shu bilan birga chiqindilarni kamaytiradi."
    },
    {
      "id": 338,
      "input": "San'at va qo'l mehnatida \"craft\" va \"design\" o'rtasidagi farq qanday?",
      "output": "\"Craft\" qo'l mehnatiga asoslangan san'at shakli bo'lib, an'anaviy uslublarni saqlaydi, \"design\" esa ijodiy va estetik yondashuvlarni amalga oshiradi."
    },
    {
      "id": 339,
      "input": "San'at va qo'l mehnatida \"virtual galleries\" qanday ta'sir qiladi?",
      "output": "\"Virtual galleries\" san'at asarlarini global auditoriyaga taqdim etish imkoniyatini beradi va san'atga yangi, interaktiv va innovatsion formatlar kiritadi."
    },
    {
      "id": 340,
      "input": "San'at asarlarini yaratishda \"color theory\" (rang nazariyasi) qanday qo'llaniladi?",
      "output": "\"Color theory\" ranglarning hissiy va psixologik ta'sirini o'rganadi, bu esa san'at asarlarini yaratishda ranglarning ma'no va emotsiyalarni ifodalashiga yordam beradi."
    },
    {
      "id": 341,
      "input": "San'at va qo'l mehnatida \"craftivism\" qanday amalga oshiriladi?",
      "output": "\"Craftivism\" san'atni ijtimoiy, siyosiy va madaniy masalalar bilan bog'lash orqali hunarmandchilik va aktivizmni birlashtiradi."
    },
    {
      "id": 342,
      "input": "San'at va qo'l mehnatida \"augmented reality\" qanday ishlatiladi?",
      "output": "\"Augmented reality\" san'at asarlarini interaktiv qilish, tomoshabinlarni virtual muhitga qo'shish va san'atni yangi darajada taqdim etishda ishlatiladi."
    },
    {
      "id": 343,
      "input": "San'at va qo'l mehnatida \"sculpture\" (haykal) qanday o'zgarishlarga uchramoqda?",
      "output": "\"Sculpture\" yangi materiallar, texnologiyalar va interaktiv elementlar bilan boyitilib, zamonaviy san'atda yangi shakllar va o'lchamlar hosil qilmoqda."
    },
    {
      "id": 344,
      "input": "San'at asarlarini yaratishda \"light art\" (yorug'lik san'ati) qanday qo'llaniladi?",
      "output": "\"Light art\" yorug'lik va ranglarni ishlatib san'at asarlari yaratish orqali makon va vaqtni yangi shakllarda ifodalash imkoniyatini yaratadi."
    },
    {
      "id": 345,
      "input": "San'at va qo'l mehnatida \"robotics\" texnologiyalarining roli qanday?",
      "output": "\"Robotics\" texnologiyalari san'at asarlarini yaratishda avtomatlashtirish, murakkab shakllar yaratish va san'atni yangi texnologiyalar bilan birlashtirishda ishlatiladi."
    },
    {
      "id": 346,
      "input": "San'at va qo'l mehnatida \"interdisciplinary\" yondashuv qanday qo'llaniladi?",
      "output": "\"Interdisciplinary\" yondashuv san'at va dizaynni boshqa sohalar, masalan, ilm-fan, texnologiya va madaniyat bilan birlashtirishni ta'minlaydi."
    },
    {
      "id": 347,
      "input": "San'at va qo'l mehnatida \"textile art\" (matolar san'ati) qanday rivojlanmoqda?",
      "output": "\"Textile art\" matolarni san'at asariga aylantirish orqali yangi ranglar, teksturalar va shakllar yaratish, shuningdek, ekologik toza materiallarni qo'llashda rivojlanmoqda."
    },
    {
      "id": 348,
      "input": "San'at va qo'l mehnatida \"stitching\" (tikuvchilik) texnikasining roli qanday?",
      "output": "\"Stitching\" texnikasi matolarni birlashtirish va san'at asarlarini yaratishda qo'l mehnatini va ijodiy yondashuvni ta'kidlaydi."
    },
    {
      "id": 349,
      "input": "San'at va qo'l mehnatida \"digital embroidery\" (raqamli tikuvchilik) qanday qo'llaniladi?",
      "output": "\"Digital embroidery\" kompyuter yordamida tikuvchilik jarayonlarini avtomatlashtirish va murakkab dizaynlarni yaratishda qo'llaniladi."
    },
    {
      "id": 350,
      "input": "Qo'l mehnatida \"luxury\" mahsulotlar qanday ahamiyatga ega?",
      "output": "\"Luxury\" mahsulotlar yuqori sifatli materiallardan tayyorlanadi, qo'l mehnatiga asoslangan va o'ziga xos dizayni bilan ajralib turadi."
    },
    {
      "id": 351,
      "input": "San'at va qo'l mehnatida \"sound art\" (ovoz san'ati) qanday rivojlanmoqda?",
      "output": "\"Sound art\" musiqa va tovushlardan foydalanib san'at asarlarini yaratish, bu esa san'atning yangi shakllarini yaratishga imkon beradi."
    },
    {
      "id": 352,
      "input": "San'at va qo'l mehnatida \"craft fairs\" (hunarmandchilik yarmarkalari) qanday ro'l o'ynaydi?",
      "output": "\"Craft fairs\" hunarmandlar va san'atkorlar o'z mahsulotlarini ko'rsatish, yangi mijozlar topish va ijodiy tarmoqni kengaytirish uchun muhim maydon hisoblanadi."
    },
    {
      "id": 353,
      "input": "San'at va qo'l mehnatida \"upcycled fashion\" (qayta ishlangan moda) qanday qo'llaniladi?",
      "output": "\"Upcycled fashion\" eski kiyimlar va materiallardan yangi, o'ziga xos va barqaror moda mahsulotlarini yaratishga asoslangan."
    },
    {
      "id": 354,
      "input": "San'at asarlarini yaratishda \"texture\" (tekstura) qanday rol o'ynaydi?",
      "output": "\"Texture\" yuzaning tuzilishi va hisini yaratish orqali san'at asarini yanada jonli, ta'sirchan va ko'rinadigan qiladi."
    },
    {
      "id": 355,
      "input": "San'at va qo'l mehnatida \"intangible cultural heritage\" (nomoddiy madaniy meros) qanday saqlanadi?",
      "output": "\"Intangible cultural heritage\" xalqning an'anaviy bilimlari, san'ati va hunarmandchiligini saqlash va kelajak avlodlarga yetkazish orqali saqlanadi."
    },
    {
      "id": 356,
      "input": "San'at va qo'l mehnatida \"collaboration\" (hamkorlik) qanday ta'sir qiladi?",
      "output": "\"Collaboration\" san'atkorlar va hunarmandlar o'rtasida tajriba va g'oyalar almashinuvi, yangi ijodiy yondashuvlar yaratishga yordam beradi."
    },
    {
      "id": 357,
      "input": "San'at va qo'l mehnatida \"augmented textiles\" (yaxshilangan matolar) qanday qo'llaniladi?",
      "output": "\"Augmented textiles\" matolarga elektronika, sensorlar va boshqa texnologiyalarni integratsiya qilish orqali interaktiv va innovatsion dizaynlar yaratishga imkon beradi."
    },
    {
      "id": 358,
      "input": "San'at asarlarini yaratishda \"installation art\" qanday ishlatiladi?",
      "output": "\"Installation art\" san'at asarlarini butun bir makonda tashkil etish, tomoshabinni atrof-muhitga faol jalb qilishni ta'minlaydi."
    },
    {
      "id": 359,
      "input": "San'at va qo'l mehnatida \"repurposing\" (qayta ishlatish) qanday amalga oshiriladi?",
      "output": "\"Repurposing\" eski va keraksiz materiallarni yangi, foydali va estetik jihatdan qimmatli asarlarga aylantirishga yordam beradi."
    },
    {
      "id": 360,
      "input": "San'at va qo'l mehnatida \"textile sculpture\" (matolar haykali) qanday rivojlanmoqda?",
      "output": "\"Textile sculpture\" matolarni 3D shakllarda ishlatish orqali yangi san'at shakllarini yaratishga imkon beradi."
    },
    {
      "id": 361,
      "input": "San'at asarlarini yaratishda \"light installation\" qanday ishlatiladi?",
      "output": "\"Light installation\" yorug'likni asar elementlariga aylantirish, makon va hissiyotlarni ifodalashda muhim vosita hisoblanadi."
    },
    {
      "id": 362,
      "input": "San'at va qo'l mehnatida \"ethnic art\" (etnik san'at) qanday ta'sir ko'rsatadi?",
      "output": "\"Ethnic art\" xalqning tarixiy, madaniy va an'anaviy elementlarini san'at asarlarida aks ettiradi, madaniy merosni saqlashga yordam beradi."
    },
    {
      "id": 363,
      "input": "San'at va qo'l mehnatida \"bio-based materials\" (biyologik asoslangan materiallar) qanday ishlatiladi?",
      "output": "\"Bio-based materials\" ekologik toza materiallar, masalan, o'simlik tolalari yoki biologik plastmassalardan foydalanish orqali barqaror san'at yaratishga yordam beradi."
    },
    {
      "id": 364,
      "input": "San'at asarlarini yaratishda \"translucent materials\" (shaffof materiallar) qanday qo'llaniladi?",
      "output": "\"Translucent materials\" yorug'likni o'z ichiga olish va taqsimlash orqali estetik va dinamik effektlar yaratadi."
    },
    {
      "id": 365,
      "input": "San'at va qo'l mehnatida \"interactive design\" qanday ta'sir qiladi?",
      "output": "\"Interactive design\" tomoshabinni san'at asariga jalb qilish, ularni yaratishda ishtirok etishga imkon berish orqali san'atni yanada jonlantiradi."
    },
    {
      "id": 366,
      "input": "San'at asarlarini yaratishda \"mixed media\" (aralash media) qanday ishlatiladi?",
      "output": "\"Mixed media\" turli materiallar va texnikalarning kombinatsiyasini qo'llash orqali yangi va murakkab san'at asarlarini yaratadi."
    },
    {
      "id": 367,
      "input": "San'at va qo'l mehnatida \"3D scanning\" (3D skanerlash) qanday qo'llaniladi?",
      "output": "\"3D scanning\" texnologiyasi ob'ektlarning raqamli nusxalarini yaratib, san'at asarlarini saqlash, ko'rsatish yoki modifikatsiya qilish imkoniyatini beradi."
    },
    {
      "id": 368,
      "input": "San'at va qo'l mehnatida \"laser cutting\" (lazerli kesish) texnologiyasining roli qanday?",
      "output": "\"Laser cutting\" texnologiyasi aniqlik va nozik detallarni yaratishda qo'llaniladi, bu esa san'at va dizaynda murakkab shakllar yaratishga imkon beradi."
    },
    {
      "id": 369,
      "input": "San'at va qo'l mehnatida \"virtual art\" (virtual san'at) qanday ishlatiladi?",
      "output": "\"Virtual art\" raqamli texnologiyalar yordamida yaratilgan san'at asarlaridir, ular internetda va virtual muhitda ko'rsatiladi."
    },
    {
      "id": 370,
      "input": "San'at asarlarini yaratishda \"organic design\" (organik dizayn) qanday ta'sir qiladi?",
      "output": "\"Organic design\" tabiiy shakllardan ilhomlanib, insonning tabiiy muhit bilan aloqasini aks ettiradigan dizaynlarni yaratadi."
    },
    {
      "id": 371,
      "input": "San'at va qo'l mehnatida \"precision craftsmanship\" (aniq hunarmandchilik) qanday ishlatiladi?",
      "output": "\"Precision craftsmanship\" yuqori aniqlikda bajarilgan ishlov berishni anglatadi, bu esa yuqori sifatli mahsulotlarni yaratishga yordam beradi."
    },
    {
      "id": 372,
      "input": "San'at va qo'l mehnatida \"eco-art\" (eko-san'at) qanday qo'llaniladi?",
      "output": "\"Eco-art\" ekologik va barqaror yondashuvlarni ta'kidlaydi, bu san'at orqali atrof-muhitni himoya qilishga chaqiradi."
    },
    {
      "id": 373,
      "input": "San'at va qo'l mehnatida \"customization\" (maxsuslashtirish) qanday qo'llaniladi?",
      "output": "\"Customization\" mahsulotlarni yoki asarlarni individual ehtiyojlarga moslashtirish orqali ularning noyobligini ta'minlaydi."
    },
    {
      "id": 374,
      "input": "San'at va qo'l mehnatida \"crowdsourcing\" (yig'ma texnologiya) qanday ishlatiladi?",
      "output": "\"Crowdsourcing\" kreativ g'oyalarni yoki resurslarni ommaviy ravishda yig'ish, san'at va dizaynda innovatsion yondashuvlarni yaratishga yordam beradi."
    },
    {
      "id": 375,
      "input": "San'at asarlarini yaratishda \"immersive installations\" (immersiv o'rnatishlar) qanday ishlatiladi?",
      "output": "\"Immersive installations\" tomoshabinni asar bilan butunlay o'rab olish, ularni hissiy va vizual tarzda jonlantirishni ta'minlaydi."
    },
    {
      "id": 376,
      "input": "San'at va qo'l mehnatida \"crafting technology\" (texnologiya bilan hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Crafting technology\" yangi texnologiyalarni qo'l mehnati bilan uyg'unlashtirib, innovatsion va barqaror asarlar yaratish imkoniyatini beradi."
    },
    {
      "id": 377,
      "input": "San'at asarlarini yaratishda \"multidisciplinary\" yondashuv qanday ishlatiladi?",
      "output": "\"Multidisciplinary\" yondashuv san'atni boshqa sohalar bilan birlashtirish, masalan, ilm-fan va texnologiya orqali yangi yondashuvlar yaratishga imkon beradi."
    },
    {
      "id": 378,
      "input": "San'at va qo'l mehnatida \"kinetic art\" (harakatli san'at) qanday qo'llaniladi?",
      "output": "\"Kinetic art\" san'ati harakatni va vaqtni qo'shgan shakllarni yaratadi, bu esa san'at asarlarini dinamik va jonli qiladi."
    },
    {
      "id": 379,
      "input": "San'at va qo'l mehnatida \"paper art\" (qog'oz san'ati) qanday rivojlanmoqda?",
      "output": "\"Paper art\" qog'ozni o'zgartirish va kesish orqali nozik, murakkab va ijodiy san'at asarlarini yaratishga imkon beradi."
    },
    {
      "id": 380,
      "input": "San'at va qo'l mehnatida \"sustainable fashion\" (barqaror moda) qanday ishlatiladi?",
      "output": "\"Sustainable fashion\" ekologik toza materiallar va ishlab chiqarish jarayonlari orqali barqaror va etika jihatdan to'g'ri moda yaratadi."
    },
    {
      "id": 381,
      "input": "San'at va qo'l mehnatida \"collage art\" (kolaj san'ati) qanday qo'llaniladi?",
      "output": "\"Collage art\" turli materiallar, tasvirlar va matnlarni birlashtirib, yangi san'at asarlarini yaratish usulidir."
    },
    {
      "id": 382,
      "input": "San'at va qo'l mehnatida \"futuristic design\" (kelajak dizayni) qanday rivojlanmoqda?",
      "output": "\"Futuristic design\" yangi texnologiyalar va innovatsion yondashuvlarni qo'llash orqali kelajakni tasavvur etadigan dizaynlarni yaratadi."
    },
    {
      "id": 383,
      "input": "San'at va qo'l mehnatida \"emerging materials\" (paydo bo'layotgan materiallar) qanday ishlatiladi?",
      "output": "\"Emerging materials\" yangi va ekologik toza materiallar bo'lib, ular san'at va dizaynda yangi imkoniyatlar yaratadi."
    },
    {
      "id": 384,
      "input": "San'at va qo'l mehnatida \"replication\" (takrorlash) qanday qo'llaniladi?",
      "output": "\"Replication\" san'at asarlarini takrorlash orqali original asarlarni saqlash, yangilash yoki qayta ishlash imkoniyatini yaratadi."
    },
    {
      "id": 385,
      "input": "San'at va qo'l mehnatida \"digital fabrication\" qanday qo'llaniladi?",
      "output": "\"Digital fabrication\" kompyuter yordamida aniq va murakkab shakllarni yaratish uchun ishlatiladi, bu esa san'at va dizaynda yuqori aniqlikni ta'minlaydi."
    },
    {
      "id": 386,
      "input": "San'at va qo'l mehnatida \"augmented textiles\" qanday ishlatiladi?",
      "output": "\"Augmented textiles\" matolarga interaktiv elementlar va texnologiyalarni qo'shish orqali yangi dizaynlar va funksiyalar yaratadi."
    },
    {
      "id": 387,
      "input": "San'at va qo'l mehnatida \"cultural appropriation\" (madaniy o'zlashtirish) qanday ta'sir ko'rsatadi?",
      "output": "\"Cultural appropriation\" boshqa madaniyatlardan elementlarni noqonuniy yoki hurmat qilmasdan foydalanish san'atda nozik ijtimoiy va madaniy masalalarni keltirib chiqarishi mumkin."
    },
    {
      "id": 388,
      "input": "San'at asarlarini yaratishda \"biomimicry\" (biologik ilhom olish) qanday qo'llaniladi?",
      "output": "\"Biomimicry\" tabiiy jarayonlardan ilhom olib, san'at va dizaynni ekologik va samarali tarzda yaratishda yordam beradi."
    },
    {
      "id": 389,
      "input": "San'at va qo'l mehnatida \"craftsmanship\" (hunarmandchilik mahorati) qanday ahamiyatga ega?",
      "output": "\"Craftsmanship\" yuqori sifatli va detalga e'tibor berilgan qo'l mehnati san'at asarlarini yaratishda asosiysi hisoblanadi."
    },
    {
      "id": 390,
      "input": "San'at va qo'l mehnatida \"permanent vs temporary art\" (doimiy va vaqtincha san'at) qanday farqlanadi?",
      "output": "\"Permanent art\" uzoq muddat davomida saqlanadigan, moddiy jihatdan mustahkam asarlardan iborat bo'lsa, \"temporary art\" vaqtinchalik va o'zgaruvchan san'at shakllarini o'z ichiga oladi."
    },
    {
      "id": 391,
      "input": "San'at va qo'l mehnatida \"art as activism\" (san'atni aktivizm sifatida ishlatish) qanday amalga oshiriladi?",
      "output": "\"Art as activism\" san'atni ijtimoiy, siyosiy yoki madaniy o'zgarishlarni qo'llab-quvvatlash va fikrlarni tarqatish vositasi sifatida ishlatadi."
    },
    {
      "id": 392,
      "input": "San'at asarlarini yaratishda \"upcycled art\" (qayta ishlangan san'at) qanday qo'llaniladi?",
      "output": "\"Upcycled art\" eski va chiqindilardan yangi, estetik jihatdan qiymatli san'at asarlarini yaratishga yordam beradi."
    },
    {
      "id": 393,
      "input": "San'at va qo'l mehnatida \"3D printing\" (3D chop etish) qanday ishlatiladi?",
      "output": "\"3D printing\" texnologiyasi san'at va dizaynda murakkab shakllarni tez va aniq yaratish imkonini beradi."
    },
    {
      "id": 394,
      "input": "San'at va qo'l mehnatida \"functional art\" (funksional san'at) qanday farqlanadi?",
      "output": "\"Functional art\" san'at va dizaynni birlashtiradi, u nafaqat estetik, balki amaliy jihatlarni ham o'z ichiga oladi."
    },
    {
      "id": 395,
      "input": "San'at va qo'l mehnatida \"public art\" (ommaviy san'at) qanday qo'llaniladi?",
      "output": "\"Public art\" keng auditoriyaga, jamoalarga yo'naltirilgan va ko'chalarda, parklar yoki umumiy joylarda namoyish etiladigan san'at shakllaridir."
    },
    {
      "id": 396,
      "input": "San'at va qo'l mehnatida \"contemporary art\" (zamonaviy san'at) qanday rivojlanmoqda?",
      "output": "\"Contemporary art\" yangi texnologiyalar, materiallar va yondashuvlar orqali o'zgarayotgan san'at shakllarini o'z ichiga oladi."
    },
    {
      "id": 397,
      "input": "San'at asarlarini yaratishda \"conceptual art\" (kontseptual san'at) qanday qo'llaniladi?",
      "output": "\"Conceptual art\" san'at asarining asosiy ahamiyati uning g'oyasiga va ma'nosiga, nafaqat vizual ko'rinishiga qaraydi."
    },
    {
      "id": 398,
      "input": "San'at va qo'l mehnatida \"crafting with nature\" (tabiat bilan hunarmandchilik) qanday amalga oshiriladi?",
      "output": "\"Crafting with nature\" tabiiy materiallardan, o'simliklar, toshlar yoki yog'ochlardan san'at asarlarini yaratish orqali ekologik barqarorlikni ta'minlaydi."
    },
    {
      "id": 399,
      "input": "San'at va qo'l mehnatida \"art installations\" (san'at o'rnatishlari) qanday qo'llaniladi?",
      "output": "\"Art installations\" tomoshabinlarni butun makonda o'zgaruvchan va interaktiv san'at asarlari orqali jalb qiladi."
    },
    {
      "id": 400,
      "input": "San'at asarlarini yaratishda \"sound sculptures\" (tovushli haykallar) qanday ishlatiladi?",
      "output": "\"Sound sculptures\" tovushlarni va harakatni qo'shgan haykallar orqali yangi va interaktiv san'at shakllarini yaratadi."
    },
    {
      "id": 401,
      "input": "San'at va qo'l mehnatida \"crafting with technology\" (texnologiya bilan hunarmandchilik) qanday amalga oshiriladi?",
      "output": "\"Crafting with technology\" yangi texnologiyalarni qo'l mehnatiga integratsiya qilish orqali innovatsion va o'ziga xos san'at asarlarini yaratadi."
    },
    {
      "id": 402,
      "input": "San'at va qo'l mehnatida \"minimalism\" (minimalizm) qanday ta'sir ko'rsatadi?",
      "output": "\"Minimalism\" oddiy shakllar, engil dizayn va aniq kompozitsiyalar orqali san'atni soddalashtiradi va uning estetik go'zalligini ta'kidlaydi."
    },
    {
      "id": 403,
      "input": "San'at va qo'l mehnatida \"modernism\" (modernizm) qanday ishlatiladi?",
      "output": "\"Modernism\" yangi texnologiyalar va usullarni qabul qilish, eski an'analarni inkor etish orqali zamonaviy san'atni rivojlantiradi."
    },
    {
      "id": 404,
      "input": "San'at asarlarini yaratishda \"mural art\" (devor san'ati) qanday qo'llaniladi?",
      "output": "\"Mural art\" devorlarga yoki katta yuzalarga chizilgan san'at asarlari, jamoat joylarida katta vizual ta'sir ko'rsatadi."
    },
    {
      "id": 405,
      "input": "San'at va qo'l mehnatida \"wearable art\" (kiyimga o'rnatilgan san'at) qanday ishlatiladi?",
      "output": "\"Wearable art\" san'atni kiyimga yoki aksessuarlarga joylashtirish orqali uning funksionalligi va estetik tasvirini birlashtiradi."
    },
    {
      "id": 406,
      "input": "San'at va qo'l mehnatida \"textile design\" (matolar dizayni) qanday qo'llaniladi?",
      "output": "\"Textile design\" matolarning rang, shakl va tuzilishini yaratishda estetik va amaliy jihatlarni uyg'unlashtiradi."
    },
    {
      "id": 407,
      "input": "San'at asarlarini yaratishda \"found art\" (topilgan san'at) qanday ishlatiladi?",
      "output": "\"Found art\" kundalik hayotdagi ob'ektlarni san'at asariga aylantirib, yangi ma'no va estetik qo'shadi."
    },
    {
      "id": 408,
      "input": "San'at va qo'l mehnatida \"art with a cause\" (maqsadli san'at) qanday ishlatiladi?",
      "output": "\"Art with a cause\" san'atni ijtimoiy yoki siyosiy maqsadlar uchun vosita sifatida ishlatadi, odamlarni ongli qarorlar qabul qilishga undaydi."
    },
    {
      "id": 409,
      "input": "San'at va qo'l mehnatida \"art for sustainability\" (barqarorlik uchun san'at) qanday amalga oshiriladi?",
      "output": "\"Art for sustainability\" ekologik masalalarni yoritish va barqarorlikni qo'llab-quvvatlash uchun san'atdan foydalanadi."
    },
    {
      "id": 410,
      "input": "San'at va qo'l mehnatida \"art and technology fusion\" (san'at va texnologiyani uyg'unlashtirish) qanday qo'llaniladi?",
      "output": "\"Art and technology fusion\" yangi texnologiyalarni san'atga integratsiya qilish orqali yangi san'at shakllarini yaratadi."
    },
    {
      "id": 411,
      "input": "San'at va qo'l mehnatida \"craftsmanship vs mass production\" (hunarmandchilik vs ommaviy ishlab chiqarish) qanday farqlanadi?",
      "output": "\"Craftsmanship\" yuqori sifatli, qo'l mehnatiga asoslangan asarlar yaratishni nazarda tutadi, \"mass production\" esa standartlashtirilgan va keng ko'lamda ishlab chiqarish jarayonini anglatadi."
    },
    {
      "id": 412,
      "input": "San'at va qo'l mehnatida \"color symbolism\" (rang ramzi) qanday ta'sir ko'rsatadi?",
      "output": "\"Color symbolism\" ranglarning ma'nolarini va hissiyotlarni ifodalash orqali san'at asarini yanada chuqurroq va ta'sirchan qiladi."
    },
    {
      "id": 413,
      "input": "San'at asarlarini yaratishda \"digital art\" (raqamli san'at) qanday qo'llaniladi?",
      "output": "\"Digital art\" raqamli vositalar yordamida yaratilgan san'at asarlarini o'z ichiga oladi, bu esa yangi san'at shakllarini va imkoniyatlarini yaratadi."
    },
    {
      "id": 414,
      "input": "San'at va qo'l mehnatida \"found object art\" (topilgan ob'ekt san'ati) qanday qo'llaniladi?",
      "output": "\"Found object art\" san'atkorlar mavjud ob'ektlarni topib, ularni yangi san'at shakllariga aylantirish orqali ijodiy asarlar yaratadi."
    },
    {
      "id": 415,
      "input": "San'at asarlarini yaratishda \"analog art\" (analog san'at) qanday ishlatiladi?",
      "output": "\"Analog art\" raqamli texnologiyalar o'rniga an'anaviy san'at usullari, masalan, rasm chizish yoki skulptura yaratish bilan amalga oshiriladi."
    },
    {
      "id": 416,
      "input": "San'at va qo'l mehnatida \"artisanal craftsmanship\" (hunarmandchilik mahorati) qanday ahamiyatga ega?",
      "output": "\"Artisanal craftsmanship\" mahsulotlarga noziklik, yuqori sifat va individual yondashuvni kiritish orqali san'atni ta'riflaydi."
    },
    {
      "id": 417,
      "input": "San'at va qo'l mehnatida \"functional sculptures\" (funksional haykallar) qanday ishlatiladi?",
      "output": "\"Functional sculptures\" estetik va amaliy jihatlarni birlashtirib, kundalik hayotda foydalanuvchi uchun ishlatiladigan san'at asarlarini yaratadi."
    },
    {
      "id": 418,
      "input": "San'at va qo'l mehnatida \"globalization\" (globalizatsiya) san'atchilikka qanday ta'sir qiladi?",
      "output": "\"Globalization\" san'atni global darajada tarqatish, madaniyatlararo almashinuvni va xalqaro tasavvurlarni rivojlantirishga yordam beradi."
    },
    {
      "id": 419,
      "input": "San'at asarlarini yaratishda \"art as therapy\" (san'atni terapiya sifatida ishlatish) qanday qo'llaniladi?",
      "output": "\"Art as therapy\" san'atni insonning hissiy va psixologik holatini yaxshilash uchun ishlatish orqali terapevtik maqsadlarga xizmat qiladi."
    },
    {
      "id": 420,
      "input": "San'at va qo'l mehnatida \"recycled materials\" (qayta ishlangan materiallar) qanday qo'llaniladi?",
      "output": "\"Recycled materials\" tabiatni himoya qilish va chiqindilarni kamaytirish maqsadida san'atda ishlatiladi."
    },
    {
      "id": 421,
      "input": "San'at va qo'l mehnatida \"multimedia art\" (multimediya san'ati) qanday ishlatiladi?",
      "output": "\"Multimedia art\" san'atchilar turli texnologiyalarni, masalan, video, musiqa, va interaktiv elementlarni qo'shib, yangi san'at shakllarini yaratadi."
    },
    {
      "id": 422,
      "input": "San'at va qo'l mehnatida \"stone carving\" (toshga o'yma) qanday amalga oshiriladi?",
      "output": "\"Stone carving\" tasviriy san'atda an'anaviy yondashuv bo'lib, toshni o'yib san'at asarlari yaratish orqali ijodiy fikrni ifodalaydi."
    },
    {
      "id": 423,
      "input": "San'at va qo'l mehnatida \"textile art\" (matolar san'ati) qanday rivojlanmoqda?",
      "output": "\"Textile art\" matolarni san'atga aylantirishda ranglar, tuzilmalar va tasvirlar orqali ijodiy yondashuvlarni qo'llaydi."
    },
    {
      "id": 424,
      "input": "San'at va qo'l mehnatida \"collage technique\" (kolaj texnikasi) qanday qo'llaniladi?",
      "output": "\"Collage technique\" turli materiallar va tasvirlarni birlashtirib yangi asar yaratish jarayonini o'z ichiga oladi."
    },
    {
      "id": 425,
      "input": "San'at va qo'l mehnatida \"vintage art\" (nostaljik san'at) qanday ahamiyatga ega?",
      "output": "\"Vintage art\" tarixiy uslublar va eski san'at shakllarini yangilash orqali estetik qadriyatlarni yangilaydi."
    },
    {
      "id": 426,
      "input": "San'at asarlarini yaratishda \"surrealism\" (srrealizm) qanday ishlatiladi?",
      "output": "\"Surrealism\" g'ayrioddiy, xayoliy va ruhiy tajribalarni ifodalovchi san'at uslubidir."
    },
    {
      "id": 427,
      "input": "San'at va qo'l mehnatida \"pottery\" (keramika) qanday ishlatiladi?",
      "output": "\"Pottery\" loydan idishlar, haykallar yoki bezaklarni yaratish orqali san'atning amaliy va estetik jihatlarini uyg'unlashtiradi."
    },
    {
      "id": 428,
      "input": "San'at va qo'l mehnatida \"upcycling\" (qayta ishlash) qanday amalga oshiriladi?",
      "output": "\"Upcycling\" eski yoki isrof bo'lgan materiallarni yangi va ijodiy mahsulotlarga aylantirish san'atida ishlatiladi."
    },
    {
      "id": 429,
      "input": "San'at va qo'l mehnatida \"street art\" (ko'cha san'ati) qanday ta'sir ko'rsatadi?",
      "output": "\"Street art\" jamoat joylarida ifodalangan san'at shakllaridir, u ijtimoiy, siyosiy va madaniy fikrlarni ommaga etkazadi."
    },
    {
      "id": 430,
      "input": "San'at va qo'l mehnatida \"handmade art\" (qo'lda yaratilgan san'at) qanday afzalliklarga ega?",
      "output": "\"Handmade art\" mahsulotlar o'ziga xoslik, sifat va san'atkorning individual yondashuvini taqdim etadi."
    },
    {
      "id": 431,
      "input": "San'at va qo'l mehnatida \"installation\" (o'rnatish) qanday amalga oshiriladi?",
      "output": "\"Installation\" makonning o'ziga xosligidan foydalanib, tomoshabinlar bilan o'zaro aloqada bo'lgan san'at asarlarini yaratadi."
    },
    {
      "id": 432,
      "input": "San'at va qo'l mehnatida \"modern craftsmanship\" (zamonaviy hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Modern craftsmanship\" zamonaviy texnologiyalar va usullarni qo'llab, an'anaviy hunarmandchilikni yangilashni anglatadi."
    },
    {
      "id": 433,
      "input": "San'at va qo'l mehnatida \"resin art\" (rezin san'ati) qanday ishlatiladi?",
      "output": "\"Resin art\" turli materiallar va bo'yoqlarni qatlamlarga joylashtirish orqali estetik va funksional asarlar yaratadi."
    },
    {
      "id": 434,
      "input": "San'at asarlarini yaratishda \"pop art\" (pop san'ati) qanday ta'sir ko'rsatadi?",
      "output": "\"Pop art\" keng ko'lamdagi ommaviy madaniyat va reklama elementlaridan ilhom olib, san'atni ommaviy va tushunarli qiladi."
    },
    {
      "id": 435,
      "input": "San'at va qo'l mehnatida \"fiber art\" (tolali san'at) qanday ishlatiladi?",
      "output": "\"Fiber art\" mato, ip va boshqa tolalar orqali yaratilgan san'at asarlari, ko'pincha nafaqat estetik, balki amaliy ahamiyatga ham ega."
    },
    {
      "id": 436,
      "input": "San'at va qo'l mehnatida \"urban art\" (shahar san'ati) qanday rivojlanmoqda?",
      "output": "\"Urban art\" shahar muhitida yaratilgan san'at asarlarini o'z ichiga oladi, bu esa jamoa va ijtimoiy aloqalar bilan bog'liq."
    },
    {
      "id": 437,
      "input": "San'at va qo'l mehnatida \"ceramics as art\" (keramika san'ati sifatida) qanday qo'llaniladi?",
      "output": "\"Ceramics as art\" keramika mahsulotlarini estetik jihatdan yuksaltirish va ularni san'at shakllariga aylantirish orqali ijodiy ifoda beradi."
    },
    {
      "id": 438,
      "input": "San'at va qo'l mehnatida \"sculpture\" (haykaltaroshlik) qanday ishlatiladi?",
      "output": "\"Sculpture\" materiallardan (tosh, yog'och, metall) foydalanib, 3D shakllarda san'at asarlarini yaratish jarayonidir."
    },
    {
      "id": 439,
      "input": "San'at va qo'l mehnatida \"crafting for social change\" (ijtimoiy o'zgarish uchun hunarmandchilik) qanday amalga oshiriladi?",
      "output": "\"Crafting for social change\" san'at va qo'l mehnati orqali jamiyatdagi ijtimoiy masalalarni yoritish va o'zgartirishga xizmat qiladi."
    },
    {
      "id": 440,
      "input": "San'at va qo'l mehnatida \"land art\" (yer san'ati) qanday qo'llaniladi?",
      "output": "\"Land art\" tabiatni san'at asariga aylantirgan holda, yerda yoki tabiiy muhitda yaratilgan san'at shaklidir."
    },
    {
      "id": 441,
      "input": "San'at va qo'l mehnatida \"visual storytelling\" (vizual hikoyachilik) qanday ishlatiladi?",
      "output": "\"Visual storytelling\" tasvirlar, ranglar va shakllar yordamida hikoya qilish orqali tomoshabinlarni jalb etadi va ma'no yaratadi."
    },
    {
      "id": 442,
      "input": "San'at va qo'l mehnatida \"art in public spaces\" (ommaviy joylardagi san'at) qanday rivojlanmoqda?",
      "output": "\"Art in public spaces\" san'atni keng jamoatchilikka taqdim etish orqali ijtimoiy va madaniy aloqalarni rivojlantiradi."
    },
    {
      "id": 443,
      "input": "San'at va qo'l mehnatida \"immersive art\" (qamrab oluvchi san'at) qanday qo'llaniladi?",
      "output": "\"Immersive art\" tom"
    },
    {
      "id": 444,
      "input": "San'at va qo'l mehnatida \"interactive art\" (interaktiv san'at) qanday ishlatiladi?",
      "output": "\"Interactive art\" tomoshabinlarni san'at asariga jalb qilib, ular bilan o'zaro aloqada bo'lishni ta'minlaydi."
    },
    {
      "id": 445,
      "input": "San'at va qo'l mehnatida \"art and environment\" (san'at va atrof-muhit) qanday qo'llaniladi?",
      "output": "\"Art and environment\" san'at asarlarini yaratishda tabiiy resurslardan va atrof-muhitdan ilhom olish orqali ekologik masalalarni yoritadi."
    },
    {
      "id": 446,
      "input": "San'at va qo'l mehnatida \"performance art\" (ijro san'ati) qanday qo'llaniladi?",
      "output": "\"Performance art\" san'atkorlarning jismoniy harakatlari, nutqi yoki harakatlarini tomoshabinlar oldida ijro etish orqali yaratiladi."
    },
    {
      "id": 447,
      "input": "San'at asarlarini yaratishda \"street performance\" (ko'cha ijrosi) qanday ishlatiladi?",
      "output": "\"Street performance\" ko'cha va jamoat joylarida amalga oshirilgan san'at shakli bo'lib, keng auditoriyaga yo'naltirilgan ijrolarni o'z ichiga oladi."
    },
    {
      "id": 448,
      "input": "San'at va qo'l mehnatida \"minimal art\" (minimal san'at) qanday ta'sir ko'rsatadi?",
      "output": "\"Minimal art\" shakllarning soddaligini, murakkablikdan voz kechishni va bo'sh joydan foydalanishni ta'kidlaydi."
    },
    {
      "id": 449,
      "input": "San'at va qo'l mehnatida \"luxury craftsmanship\" (luxus hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Luxury craftsmanship\" yuqori sifatli materiallar va nozik ishlov berish orqali unikal va qimmatbaho mahsulotlar yaratadi."
    },
    {
      "id": 450,
      "input": "San'at va qo'l mehnatida \"art history\" (san'at tarixi) qanday ahamiyatga ega?",
      "output": "\"Art history\" san'at asarlarini o'rganish va ularga tarixiy kontekstda baho berish orqali san'atning rivojlanish jarayonini tushunishga yordam beradi."
    },
    {
      "id": 451,
      "input": "San'at va qo'l mehnatida \"art as a mirror of society\" (san'at jamiyatning oynasi sifatida) qanday ishlatiladi?",
      "output": "\"Art as a mirror of society\" san'at jamiyatdagi muammolarni va holatlarni aks ettirib, ijtimoiy o'zgarishlarga turtki bo'ladi."
    },
    {
      "id": 452,
      "input": "San'at va qo'l mehnatida \"cultural heritage\" (madaniy meros) qanday saqlanadi?",
      "output": "\"Cultural heritage\" madaniy merosni asrab-avaylash, uni yangi avlodlarga yetkazish va saqlash orqali amalga oshiriladi."
    },
    {
      "id": 453,
      "input": "San'at va qo'l mehnatida \"gender in art\" (san'atda jinsiy identitet) qanday ta'sir qiladi?",
      "output": "\"Gender in art\" san'atda jinsiy identitet, tenglik va stereotiplarga qarshi kurashish orqali ijtimoiy xabarlarga o'zgartirish kiritadi."
    },
    {
      "id": 454,
      "input": "San'at va qo'l mehnatida \"art and science fusion\" (san'at va ilmni uyg'unlashtirish) qanday ishlatiladi?",
      "output": "\"Art and science fusion\" san'at va ilmiy yondashuvlarning birlashuvi orqali yangi texnologiyalar va ilmiy yutuqlarni san'atda ifodalashni anglatadi."
    },
    {
      "id": 455,
      "input": "San'at va qo'l mehnatida \"public art interventions\" (ommaviy san'at aralashuvi) qanday amalga oshiriladi?",
      "output": "\"Public art interventions\" jamoat joylarida san'at asarlari orqali ijtimoiy, siyosiy yoki madaniy mavzularni yoritish uchun ishlatiladi."
    },
    {
      "id": 456,
      "input": "San'at va qo'l mehnatida \"material exploration\" (materiallarni o'rganish) qanday ta'sir ko'rsatadi?",
      "output": "\"Material exploration\" yangi materiallar va texnologiyalarni qo'llash orqali san'atda yangi shakllar va usullarni kashf etishga yordam beradi."
    },
    {
      "id": 457,
      "input": "San'at va qo'l mehnatida \"art for change\" (o'zgarish uchun san'at) qanday amalga oshiriladi?",
      "output": "\"Art for change\" san'atni ijtimoiy va siyosiy o'zgarishlarni qo'llab-quvvatlash vositasi sifatida ishlatadi."
    },
    {
      "id": 458,
      "input": "San'at va qo'l mehnatida \"craft and identity\" (hunarmandchilik va identitet) qanday bog'lanadi?",
      "output": "\"Craft and identity\" hunarmandchilik san'atkorning shaxsiy va madaniy identitetini ifodalashda muhim rol o'ynaydi."
    },
    {
      "id": 459,
      "input": "San'at va qo'l mehnatida \"traditional techniques in modern art\" (zamonaviy san'atda an'anaviy texnikalar) qanday qo'llaniladi?",
      "output": "\"Traditional techniques in modern art\" zamonaviy san'atchilar an'anaviy texnikalarni yangi va innovatsion usullar bilan uyg'unlashtiradi."
    },
    {
      "id": 460,
      "input": "San'at va qo'l mehnatida \"art as a political tool\" (san'at siyosiy vosita sifatida) qanday ishlatiladi?",
      "output": "\"Art as a political tool\" san'atni siyosiy fikrlarni tarqatish va jamoatni ongli qarorlar qabul qilishga undash uchun ishlatadi."
    },
    {
      "id": 461,
      "input": "San'at va qo'l mehnatida \"technology in craftsmanship\" (hunarmandchilikda texnologiya) qanday ta'sir qiladi?",
      "output": "\"Technology in craftsmanship\" texnologiyaning yordami bilan hunarmandchilikda yangi imkoniyatlar va aniq natijalar olish mumkin."
    },
    {
      "id": 462,
      "input": "San'at va qo'l mehnatida \"art and politics\" (san'at va siyosat) qanday bog'lanadi?",
      "output": "\"Art and politics\" san'at siyosiy voqealarni va jamiyatdagi o'zgarishlarni aks ettirishda va yoritishda kuchli vosita sifatida ishlatiladi."
    },
    {
      "id": 463,
      "input": "San'at va qo'l mehnatida \"arts education\" (san'at ta'limi) qanday muhimdir?",
      "output": "\"Arts education\" san'atni o'rganish va rivojlantirish, shuningdek, ijodiy fikrlash va muammolarni hal qilish qobiliyatlarini shakllantirishga yordam beradi."
    },
    {
      "id": 464,
      "input": "San'at va qo'l mehnatida \"digital collage\" (raqamli kolaj) qanday amalga oshiriladi?",
      "output": "\"Digital collage\" raqamli vositalar yordamida turli tasvirlar va materiallarni birlashtirib, yangi san'at asarlarini yaratishni anglatadi."
    },
    {
      "id": 465,
      "input": "San'at va qo'l mehnatida \"new media art\" (yangi media san'ati) qanday ishlatiladi?",
      "output": "\"New media art\" san'ati raqamli texnologiyalar, video, internet va interaktiv san'at shakllarini o'z ichiga oladi."
    },
    {
      "id": 466,
      "input": "San'at va qo'l mehnatida \"eco-art\" (eko-sanat) qanday qo'llaniladi?",
      "output": "\"Eco-art\" ekologik masalalarni yoritib, tabiiy resurslarni saqlash va himoya qilishni ta'kidlaydi."
    },
    {
      "id": 467,
      "input": "San'at va qo'l mehnatida \"digital photography\" (raqamli fotografiya) qanday ishlatiladi?",
      "output": "\"Digital photography\" zamonaviy texnologiyalar yordamida suratga olish va tasvirlarni yaratish orqali san'atda yangi usullarni qo'llashni anglatadi."
    },
    {
      "id": 468,
      "input": "San'at va qo'l mehnatida \"crafting in community\" (jamiyatda hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Crafting in community\" hunarmandchilikni jamiyat bilan birgalikda yaratish orqali ijtimoiy aloqalarni rivojlantiradi va qo'llab-quvvatlaydi."
    },
    {
      "id": 469,
      "input": "San'at va qo'l mehnatida \"exhibition design\" (ko'rgazma dizayni) qanday amalga oshiriladi?",
      "output": "\"Exhibition design\" san'at asarlarini ko'rgazmalarda ko'rsatish uchun makonni va vizual ta'sirlarni eng yaxshi tarzda tashkil etishni anglatadi."
    },
    {
      "id": 470,
      "input": "San'at va qo'l mehnatida \"art and psychology\" (san'at va psixologiya) qanday bog'lanadi?",
      "output": "\"Art and psychology\" san'atni inson psixikasini tushunish va hissiy tajribalarni ifodalash vositasi sifatida ishlatadi."
    },
    {
      "id": 471,
      "input": "San'at va qo'l mehnatida \"crafting for healing\" (davolash uchun hunarmandchilik) qanday amalga oshiriladi?",
      "output": "\"Crafting for healing\" san'atni va qo'l mehnatini stressni kamaytirish va ruhiy holatni yaxshilash uchun ishlatadi."
    },
    {
      "id": 472,
      "input": "San'at va qo'l mehnatida \"art installations in nature\" (tabiatda san'at o'rnatish) qanday amalga oshiriladi?",
      "output": "\"Art installations in nature\" tabiat muhitida san'at asarlarini yaratish orqali ekologik va estetik qiymatlarni uyg'unlashtiradi."
    },
    {
      "id": 473,
      "input": "San'at va qo'l mehnatida \"craftsmanship in architecture\" (arxitektura va hunarmandchilik) qanday bog'lanadi?",
      "output": "\"Craftsmanship in architecture\" binolarni yaratishda yuqori sifatli materiallar va nozik ishlov berishni ta'minlaydi."
    },
    {
      "id": 474,
      "input": "San'at va qo'l mehnatida \"artistic expression through fashion\" (moda orqali san'at ifodasi) qanday qo'llaniladi?",
      "output": "\"Artistic expression through fashion\" dizaynerlar kiyimlarni san'at asarlariga aylantirib, shaxsiy va madaniy ifodani ko'rsatadi."
    },
    {
      "id": 475,
      "input": "San'at va qo'l mehnatida \"art in rural communities\" (qishloq jamoalarida san'at) qanday amalga oshiriladi?",
      "output": "\"Art in rural communities\" qishloq hududlarida san'atni rivojlantirish orqali jamiyatni birlashtiradi va madaniy aloqalarni kuchaytiradi."
    },
    {
      "id": 476,
      "input": "San'at va qo'l mehnatida \"contemporary indigenous art\" (zamonaviy mahalliy san'at) qanday ahamiyatga ega?",
      "output": "\"Contemporary indigenous art\" mahalliy xalqlarning madaniyatini va tarixini zamonaviy san'at shakllari orqali aks ettiradi."
    },
    {
      "id": 477,
      "input": "San'at va qo'l mehnatida \"handcrafted jewelry\" (qo'lda tayyorlangan zargarlik buyumlari) qanday ishlatiladi?",
      "output": "\"Handcrafted jewelry\" har bir buyumni noyob va san'at asari sifatida yaratish orqali qo'lda zargarlik san'ati shakllanadi."
    },
    {
      "id": 478,
      "input": "San'at va qo'l mehnatida \"art in digital age\" (raqamli asrdagi san'at) qanday rivojlanmoqda?",
      "output": "\"Art in digital age\" raqamli texnologiyalarni san'atga kiritish, interaktiv va virtual san'at shakllarini yaratish orqali yangi yondashuvlar paydo bo'ladi."
    },
    {
      "id": 479,
      "input": "San'at va qo'l mehnatida \"portrait painting\" (potret rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Portrait painting\" inson yuzini yoki tasvirini aniq va estetik tarzda tasvirlash orqali san'atning klassik shakllaridan biridir."
    },
    {
      "id": 480,
      "input": "San'at va qo'l mehnatida \"sustainability in art\" (san'atda barqarorlik) qanday qo'llaniladi?",
      "output": "\"Sustainability in art\" ekologik toza materiallar va usullarni qo'llash orqali san'atni tabiatni himoya qilishga yo'naltiradi."
    },
    {
      "id": 481,
      "input": "San'at va qo'l mehnatida \"botanical art\" (o'simlik san'ati) qanday ishlatiladi?",
      "output": "\"Botanical art\" o'simliklar va tabiatni tasvirlash orqali biologik va ekologik tushunchalarni san'atiy tarzda ifodalaydi."
    },
    {
      "id": 482,
      "input": "San'at va qo'l mehnatida \"art therapy for trauma\" (travma uchun san'at terapiyasi) qanday amalga oshiriladi?",
      "output": "\"Art therapy for trauma\" san'atni travma bilan kurashishda yordam berish, hissiy holatlarni ifodalash va davolash vositasi sifatida ishlatadi."
    },
    {
      "id": 483,
      "input": "San'at va qo'l mehnatida \"natural dyes in textiles\" (matolarda tabiiy bo'yoqlar) qanday qo'llaniladi?",
      "output": "\"Natural dyes in textiles\" o'simliklar, hayvonlar va minerallardan olingan tabiiy bo'yoqlar bilan matolarni ranglash orqali ekologik jihatdan toza va sog'lom mahsulotlar yaratadi."
    },
    {
      "id": 484,
      "input": "San'at va qo'l mehnatida \"art in healing spaces\" (davolash joylarida san'at) qanday ishlatiladi?",
      "output": "\"Art in healing spaces\" san'atni salomatlikni yaxshilash va davolash jarayoniga yordam beruvchi muhit yaratish uchun qo'llaydi."
    },
    {
      "id": 485,
      "input": "San'at va qo'l mehnatida \"art movements of the 20th century\" (20-asr san'at harakatlari) qanday ta'sir ko'rsatdi?",
      "output": "\"Art movements of the 20th century\" modernizm, kubizm, ekspressionizm kabi yirik san'at harakatlari orqali san'atni yangilash va yangi tasavvurlarni kiritishdi."
    },
    {
      "id": 486,
      "input": "San'at va qo'l mehnatida \"mixed media art\" (aralash media san'ati) qanday ishlatiladi?",
      "output": "\"Mixed media art\" turli materiallar va texnikalarni birlashtirib, san'at asarlarini yanada murakkab va interaktiv qilishga yordam beradi."
    },
    {
      "id": 487,
      "input": "San'at va qo'l mehnatida \"eco-friendly crafting\" (ekologik toza hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Eco-friendly crafting\" tabiiy resurslarni tejash va atrof-muhitni himoya qilish uchun ekologik toza materiallar va usullarni ishlatadi."
    },
    {
      "id": 488,
      "input": "San'at va qo'l mehnatida \"art for empowerment\" (quvvatlantirish uchun san'at) qanday amalga oshiriladi?",
      "output": "\"Art for empowerment\" san'atni odamlarning o'zligini anglash, o'zgarishlar qilish va ijtimoiy adolat uchun vosita sifatida ishlatadi."
    },
    {
      "id": 489,
      "input": "San'at va qo'l mehnatida \"creative reuse\" (ijodiy qayta ishlatish) qanday amalga oshiriladi?",
      "output": "\"Creative reuse\" isrof bo'lgan materiallarni qayta ishlash va ular orqali yangi va innovatsion san'at asarlarini yaratish usulidir."
    },
    {
      "id": 490,
      "input": "San'at va qo'l mehnatida \"visual poetry\" (vizual she'riyat) qanday qo'llaniladi?",
      "output": "\"Visual poetry\" so'zlarni va tasvirlarni birlashtirib, matn va rasmning uyg'unligini yaratish orqali yangi she'riyat shakllarini yuzaga keltiradi."
    },
    {
      "id": 491,
      "input": "San'at va qo'l mehnatida \"art in public spaces\" (ommaviy joylarda san'at) qanday ta'sir ko'rsatadi?",
      "output": "\"Art in public spaces\" san'atni keng jamoatchilikka taqdim etish orqali estetik qiymatlarni va ijtimoiy fikrlarni oshiradi."
    },
    {
      "id": 492,
      "input": "San'at va qo'l mehnatida \"animation art\" (animatsiya san'ati) qanday ishlatiladi?",
      "output": "\"Animation art\" harakatlanuvchi rasmlar va tasvirlar orqali san'at yaratish, bu esa hikoya qilishning yangi shakllarini yaratadi."
    },
    {
      "id": 493,
      "input": "San'at va qo'l mehnatida \"public art projects\" (ommaviy san'at loyihalari) qanday qo'llaniladi?",
      "output": "\"Public art projects\" keng jamoatni san'atga jalb qilish va ijtimoiy yoki madaniy mavzularni yoritish uchun amalga oshiriladi."
    },
    {
      "id": 494,
      "input": "San'at va qo'l mehnatida \"eco-art movements\" (eko-sanat harakatlari) qanday rivojlanmoqda?",
      "output": "\"Eco-art movements\" atrof-muhitni himoya qilish va ekologik muammolarga e'tibor qaratish uchun san'atni vosita sifatida ishlatadi."
    },
    {
      "id": 495,
      "input": "San'at va qo'l mehnatida \"digital installations\" (raqamli o'rnatishlar) qanday qo'llaniladi?",
      "output": "\"Digital installations\" raqamli texnologiyalar yordamida makon yaratish va tomoshabinlarni interaktiv tarzda san'atga jalb etishni ta'minlaydi."
    },
    {
      "id": 496,
      "input": "San'at va qo'l mehnatida \"art in the age of technology\" (texnologiya asrida san'at) qanday ta'sir ko'rsatadi?",
      "output": "\"Art in the age of technology\" texnologiyaning rivojlanishi orqali san'atni yangi shakllar va imkoniyatlar bilan boyitadi."
    },
    {
      "id": 497,
      "input": "San'at va qo'l mehnatida \"art education in schools\" (maktablarda san'at ta'limi) qanday rivojlanmoqda?",
      "output": "\"Art education in schools\" talabalarga ijodiy fikrlashni rivojlantirish va san'atni o'rganish imkoniyatlarini taqdim etadi."
    },
    {
      "id": 498,
      "input": "San'at va qo'l mehnatida \"the role of art in society\" (jamiyatdagi san'at roli) qanday ahamiyatga ega?",
      "output": "\"The role of art in society\" san'at jamiyatdagi madaniy, siyosiy va hissiy o'zgarishlarni aks ettirib, jamoatchilikni birlashtiradi."
    },
    {
      "id": 499,
      "input": "San'at va qo'l mehnatida \"art and technology integration\" (san'at va texnologiyaning integratsiyasi) qanday amalga oshiriladi?",
      "output": "\"Art and technology integration\" san'atda texnologiyalarni qo'llash orqali yangi imkoniyatlar yaratish, masalan, raqamli san'at va interaktiv dizaynlar."
    },
    {
      "id": 500,
      "input": "San'at va qo'l mehnatida \"sculpture techniques\" (haykaltaroshlik texnikalari) qanday qo'llaniladi?",
      "output": "\"Sculpture techniques\" turli materiallar (temir, marmar, yog'och) yordamida haykallar yaratish, shakl va strukturalarni aniq ifodalashni anglatadi."
    },
    {
      "id": 501,
      "input": "San'at va qo'l mehnatida \"creative collaborations\" (ijodiy hamkorliklar) qanday amalga oshiriladi?",
      "output": "\"Creative collaborations\" san'atkorlar, dizaynerlar va ilmiy mutaxassislar o'rtasidagi hamkorlik orqali yangi va innovatsion g'oyalarni yaratishni ta'minlaydi."
    },
    {
      "id": 502,
      "input": "San'at va qo'l mehnatida \"recycled art\" (qayta ishlangan san'at) qanday qo'llaniladi?",
      "output": "\"Recycled art\" isrof bo'lgan materiallarni san'at asariga aylantirish orqali atrof-muhitni himoya qilishga yordam beradi."
    },
    {
      "id": 503,
      "input": "San'at va qo'l mehnatida \"conceptual art\" (kontseptual san'at) qanday ishlatiladi?",
      "output": "\"Conceptual art\" asarlarning mohiyati va g'oyasi shakllaridan ko'ra muhimroq ekanini ta'kidlaydi."
    },
    {
      "id": 504,
      "input": "San'at va qo'l mehnatida \"textile art\" (mato san'ati) qanday qo'llaniladi?",
      "output": "\"Textile art\" matolarni san'at asari sifatida ishlatish, to'qish, tikish va boshqa texnikalar orqali ijodiy ifodalarni yaratadi."
    },
    {
      "id": 505,
      "input": "San'at va qo'l mehnatida \"abstract art\" (abstrakt san'at) qanday ta'sir ko'rsatadi?",
      "output": "\"Abstract art\" tasvirlarni yoki shakllarni oddiy geometrik yoki rangli kompozitsiyalarga aylantirib, hissiy va estetik tajribalarni ifodalaydi."
    },
    {
      "id": 506,
      "input": "San'at va qo'l mehnatida \"urban art\" (shahar san'ati) qanday amalga oshiriladi?",
      "output": "\"Urban art\" ko'cha san'ati va grafiti kabi shakllar orqali shahar hayoti va madaniyatini aks ettiradi."
    },
    {
      "id": 507,
      "input": "San'at va qo'l mehnatida \"architectural sculpture\" (arxitektura haykallari) qanday ishlatiladi?",
      "output": "\"Architectural sculpture\" binolarda yoki jamoat joylarida joylashgan haykallar yordamida estetik va funktsional elementlar yaratiladi."
    },
    {
      "id": 508,
      "input": "San'at va qo'l mehnatida \"art in healthcare\" (sog'liqni saqlashda san'at) qanday qo'llaniladi?",
      "output": "\"Art in healthcare\" san'atni davolash va sog'liqni tiklash jarayonlarini yaxshilash uchun ishlatish, ruhiy holatni ko'taradi."
    },
    {
      "id": 509,
      "input": "San'at va qo'l mehnatida \"immersive art\" (sho'ng'ish san'ati) qanday amalga oshiriladi?",
      "output": "\"Immersive art\" tomoshabinni san'at asariga to'liq tortib olib, ular bilan bevosita aloqada bo'lishni ta'minlaydi."
    },
    {
      "id": 510,
      "input": "San'at va qo'l mehnatida \"installation art\" (o'rnatish san'ati) qanday qo'llaniladi?",
      "output": "\"Installation art\" makon va materiallarni san'at asariga aylantirib, tomoshabinni o'zaro aloqaga undaydi."
    },
    {
      "id": 511,
      "input": "San'at va qo'l mehnatida \"fiber art\" (ip san'ati) qanday amalga oshiriladi?",
      "output": "\"Fiber art\" ip va to'qimachilik materiallari yordamida san'at asarlarini yaratadi, ko'pincha uning rangi va tuzilishiga urg'u beradi."
    },
    {
      "id": 512,
      "input": "San'at va qo'l mehnatida \"virtual reality art\" (virtual haqiqat san'ati) qanday ishlatiladi?",
      "output": "\"Virtual reality art\" raqamli texnologiyalar yordamida tomoshabinlarni virtual makonlarda san'at asarlarini tajriba qilish imkoniyatini beradi."
    },
    {
      "id": 513,
      "input": "San'at va qo'l mehnatida \"minimalism in art\" (san'atda minimalizm) qanday qo'llaniladi?",
      "output": "\"Minimalism in art\" soddalik va oddiy shakllar orqali san'atda yangi estetikani yaratish usulidir."
    },
    {
      "id": 514,
      "input": "San'at va qo'l mehnatida \"public art education\" (ommaviy san'at ta'limi) qanday amalga oshiriladi?",
      "output": "\"Public art education\" san'atni keng jamoatchilikka taqdim etish, ularni san'at bilan tanishtirish va estetik qadrni oshirishni maqsad qiladi."
    },
    {
      "id": 515,
      "input": "San'at va qo'l mehnatida \"art and technology convergence\" (san'at va texnologiyaning birlashuvi) qanday ta'sir ko'rsatadi?",
      "output": "\"Art and technology convergence\" texnologiyaning san'at yaratish jarayonidagi roli va uning yangi shakllarini yuzaga keltiradi."
    },
    {
      "id": 516,
      "input": "San'at va qo'l mehnatida \"collaborative art\" (hamkorlikda san'at) qanday amalga oshiriladi?",
      "output": "\"Collaborative art\" bir nechta san'atchilar o'rtasida hamkorlik orqali birgalikda yaratilgan asarlar hosil qiladi."
    },
    {
      "id": 517,
      "input": "San'at va qo'l mehnatida \"modern sculpture techniques\" (zamonaviy haykaltaroshlik texnikalari) qanday qo'llaniladi?",
      "output": "\"Modern sculpture techniques\" zamonaviy materiallar va texnologiyalar yordamida haykallar yaratishda yangicha yondashuvlar va usullarni o'z ichiga oladi."
    },
    {
      "id": 518,
      "input": "San'at va qo'l mehnatida \"eclectic art\" (eklektik san'at) qanday amalga oshiriladi?",
      "output": "\"Eclectic art\" turli san'at uslublarini birlashtirib, yangi va noyob asarlarni yaratadi."
    },
    {
      "id": 519,
      "input": "San'at va qo'l mehnatida \"art in the digital world\" (raqamli dunyoda san'at) qanday rivojlanmoqda?",
      "output": "\"Art in the digital world\" san'atning raqamli platformalarda tarqalishi va virtual makonlarda yangi shakllar yaratishi orqali o'zgaradi."
    },
    {
      "id": 520,
      "input": "San'at va qo'l mehnatida \"art for social justice\" (ijtimoiy adolat uchun san'at) qanday qo'llaniladi?",
      "output": "\"Art for social justice\" san'atni ijtimoiy tenglik, huquqlar va adolatni targ'ib qilish uchun ishlatadi."
    },
    {
      "id": 521,
      "input": "San'at va qo'l mehnatida \"crafting with recycled materials\" (qayta ishlangan materiallar bilan hunarmandchilik) qanday amalga oshiriladi?",
      "output": "\"Crafting with recycled materials\" atrof-muhitni himoya qilishni maqsad qilib, qayta ishlangan materiallardan foydalangan holda san'at asarlari yaratish."
    },
    {
      "id": 522,
      "input": "San'at va qo'l mehnatida \"artistic photography\" (san'atsal fotografiya) qanday ishlatiladi?",
      "output": "\"Artistic photography\" fotografiya orqali ijodiy va estetik qarashlarni ifodalashni ta'minlaydi."
    },
    {
      "id": 523,
      "input": "San'at va qo'l mehnatida \"artistic design in interior\" (ichki dizaynda san'at dizayni) qanday qo'llaniladi?",
      "output": "\"Artistic design in interior\" interyerni san'at asarlari va estetik elementlar bilan bezash orqali makonning jozibadorligini oshiradi."
    },
    {
      "id": 524,
      "input": "San'at va qo'l mehnatida \"cross-cultural art\" (madaniyatlararo san'at) qanday ishlatiladi?",
      "output": "\"Cross-cultural art\" turli madaniyatlarning elementlarini birlashtirib, san'atingiz orqali global ahamiyatga ega g'oyalarni ifodalaydi."
    },
    {
      "id": 525,
      "input": "San'at va qo'l mehnatida \"art as activism\" (san'atni faollik sifatida ishlatish) qanday amalga oshiriladi?",
      "output": "\"Art as activism\" san'atni jamiyatdagi muammolarni hal qilish va faollikni qo'llab-quvvatlash vositasi sifatida ishlatadi."
    },
    {
      "id": 526,
      "input": "San'at va qo'l mehnatida \"art and identity\" (san'at va identitet) qanday bog'lanadi?",
      "output": "\"Art and identity\" san'at insonning shaxsiy yoki madaniy identitetini ifodalashda muhim rol o'ynaydi."
    },
    {
      "id": 527,
      "input": "San'at va qo'l mehnatida \"performance-based art\" (ijro asosidagi san'at) qanday amalga oshiriladi?",
      "output": "\"Performance-based art\" san'atkorlar o'z asarlarini tomoshabinlar oldida jismoniy harakatlar orqali ijro etadi."
    },
    {
      "id": 528,
      "input": "San'at va qo'l mehnatida \"art in public schools\" (ommaviy maktablarda san'at) qanday amalga oshiriladi?",
      "output": "\"Art in public schools\" san'at ta'limini o'quvchilarga estetik va ijodiy fikrlashni rivojlantirish uchun taqdim etadi."
    },
    {
      "id": 529,
      "input": "San'at va qo'l mehnatida \"art as cultural critique\" (san'at madaniy tanqid sifatida) qanday ishlatiladi?",
      "output": "\"Art as cultural critique\" san'at jamiyatdagi madaniy qadriyatlarni tahlil qilish va tanqid qilish uchun ishlatiladi."
    },
    {
      "id": 530,
      "input": "San'at va qo'l mehnatida \"independent art spaces\" (mustaqil san'at makonlari) qanday rivojlanmoqda?",
      "output": "\"Independent art spaces\" mustaqil san'atchilar va guruhlar uchun san'atni yaratish va namoyish etish uchun erkin maydon yaratadi."
    },
    {
      "id": 531,
      "input": "San'at va qo'l mehnatida \"digital sculpture\" (raqamli haykallar) qanday ishlatiladi?",
      "output": "\"Digital sculpture\" raqamli texnologiyalar yordamida virtual yoki fizikal shaklda yaratilgan haykallardir."
    },
    {
      "id": 532,
      "input": "San'at va qo'l mehnatida \"color theory\" (rang nazariyasi) qanday ahamiyatga ega?",
      "output": "\"Color theory\" san'atda ranglarni estetik va hissiy ta'sir yaratish uchun to'g'ri kombinatsiyalashni o'rganadi."
    },
    {
      "id": 533,
      "input": "San'at va qo'l mehnatida \"feminist art\" (feministik san'at) qanday ishlatiladi?",
      "output": "\"Feminist art\" ayollar huquqlari va tenglikni qo'llab-quvvatlash uchun san'at asarlarini yaratish usulidir."
    },
    {
      "id": 534,
      "input": "San'at va qo'l mehnatida \"traditional crafts\" (an'anaviy hunarmandchilik) qanday ahamiyatga ega?",
      "output": "\"Traditional crafts\" avlodlar davomida o'zlashtirilgan va madaniyatni saqlash uchun muhim bo'lgan hunar va usullarni anglatadi."
    },
    {
      "id": 535,
      "input": "San'at va qo'l mehnatida \"art as a means of protest\" (san'atni norozilik vositasi sifatida ishlatish) qanday amalga oshiriladi?",
      "output": "\"Art as a means of protest\" san'at muammolarni va noxush holatlarni ko'rsatish va ijtimoiy o'zgarishlarni rag'batlantirish vositasi sifatida ishlatiladi."
    },
    {
      "id": 536,
      "input": "San'at va qo'l mehnatida \"art in virtual galleries\" (virtual galereyalarda san'at) qanday qo'llaniladi?",
      "output": "\"Art in virtual galleries\" internet platformalarida san'at asarlarini namoyish qilish va keng auditoriyaga taqdim etish imkonini beradi."
    },
    {
      "id": 537,
      "input": "San'at va qo'l mehnatida \"light art\" (yorug'lik san'ati) qanday ishlatiladi?",
      "output": "\"Light art\" yorug'lik va uning dinamikasidan foydalanib, vizual tajriba yaratadi, ko'pincha interaktiv bo'ladi."
    },
    {
      "id": 538,
      "input": "San'at va qo'l mehnatida \"community-based art\" (hamjamiyatga asoslangan san'at) qanday amalga oshiriladi?",
      "output": "\"Community-based art\" jamoalar bilan birgalikda yaratilgan san'at asarlarini qo'llash orqali ijtimoiy birlikni kuchaytiradi."
    },
    {
      "id": 539,
      "input": "San'at va qo'l mehnatida \"eco-art\" (eko-sanat) qanday rivojlanmoqda?",
      "output": "\"Eco-art\" tabiatni va atrof-muhitni himoya qilish uchun ekologik jihatdan barqaror materiallar va g'oyalar yordamida yaratiladi."
    },
    {
      "id": 540,
      "input": "San'at va qo'l mehnatida \"outdoor art\" (ochiq havoda san'at) qanday qo'llaniladi?",
      "output": "\"Outdoor art\" ommaviy joylarda joylashgan san'at asarlari orqali jamoatning e'tiborini tortadi va estetik qiymat yaratadi."
    },
    {
      "id": 541,
      "input": "San'at va qo'l mehnatida \"art and healing\" (san'at va davolash) qanday amalga oshiriladi?",
      "output": "\"Art and healing\" san'atni stressni kamaytirish, ruhiy holatni yaxshilash va shifo berish vositasi sifatida ishlatadi."
    },
    {
      "id": 542,
      "input": "San'at va qo'l mehnatida \"visual storytelling\" (vizual hikoya qilish) qanday ishlatiladi?",
      "output": "\"Visual storytelling\" san'at orqali hikoya qilish, tasvirlar va ranglar yordamida ma'lumot va his-tuyg'ularni ifodalashni ta'minlaydi."
    },
    {
      "id": 543,
      "input": "San'at va qo'l mehnatida \"street art\" (ko'cha san'ati) qanday ta'sir ko'rsatadi?",
      "output": "\"Street art\" shahar muhitida ko'cha san'ati yordamida ijtimoiy, siyosiy yoki madaniy xabarlarni tarqatadi."
    },
    {
      "id": 544,
      "input": "San'at va qo'l mehnatida \"multi-sensory art\" (ko'p sezgili san'at) qanday ishlatiladi?",
      "output": "\"Multi-sensory art\" tomoshabinlarga nafaqat vizual, balki eshitish, hidlash va boshqalar kabi sezgi tajribalarini taqdim etadi."
    },
    {
      "id": 545,
      "input": "San'at va qo'l mehnatida \"art as self-expression\" (san'atni o'z ifodasi sifatida ishlatish) qanday qo'llaniladi?",
      "output": "\"Art as self-expression\" san'at orqali odamlar o'z ichki dunyosini, his-tuyg'ularini va fikrlarini ifodalaydi."
    },
    {
      "id": 546,
      "input": "San'at va qo'l mehnatida \"art and politics\" (san'at va siyosat) qanday bog'lanadi?",
      "output": "\"Art and politics\" san'atni siyosiy fikrlarni targ'ib qilish, jamiyatdagi ijtimoiy muammolarni yoritish uchun ishlatadi."
    },
    {
      "id": 547,
      "input": "San'at va qo'l mehnatida \"surrealism in art\" (san'atda surrealizm) qanday amalga oshiriladi?",
      "output": "\"Surrealism in art\" ong osti, tushlar va fantastik elementlarni san'atda ifodalash orqali realizmdan chetga chiqadi."
    },
    {
      "id": 548,
      "input": "San'at va qo'l mehnatida \"art for education\" (ta'lim uchun san'at) qanday ishlatiladi?",
      "output": "\"Art for education\" san'atni o'quv jarayoniga qo'shib, ijodiy fikrlashni rivojlantiradi va o'quvchilarga yangi tushunchalarni o'rgatadi."
    },
    {
      "id": 549,
      "input": "San'at va qo'l mehnatida \"crafting with nature\" (tabiat bilan hunarmandchilik) qanday qo'llaniladi?",
      "output": "\"Crafting with nature\" tabiiy materiallar, masalan, gulli barglar, daraxt novdalari, toshlar yordamida san'at asarlari yaratishdir."
    },
    {
      "id": 550,
      "input": "San'at va qo'l mehnatida \"performance art\" (ijro san'ati) qanday ishlatiladi?",
      "output": "\"Performance art\" san'atkorlar tomonidan tomoshabinlarga ijro etilgan san'at shaklidir, odatda harakatlar va vokal ishlatiladi."
    },
    {
      "id": 551,
      "input": "San'at va qo'l mehnatida \"reclaimed wood art\" (qayta ishlangan yog'och san'ati) qanday amalga oshiriladi?",
      "output": "\"Reclaimed wood art\" eski yoki tashlandiq yog'och materiallarni san'at asariga aylantirish orqali ekologik jihatdan barqaror san'at yaratish."
    },
    {
      "id": 552,
      "input": "San'at va qo'l mehnatida \"social media and art\" (ijtimoiy tarmoqlar va san'at) qanday bog'lanadi?",
      "output": "\"Social media and art\" san'at asarlarini onlayn platformalarda tarqatish, san'atni keng auditoriyaga taqdim etish va yangi muhokamalar yaratish uchun ishlatiladi."
    },
    {
      "id": 553,
      "input": "San'at va qo'l mehnatida \"sound art\" (ovoza san'ati) qanday amalga oshiriladi?",
      "output": "\"Sound art\" ovozlar va tovushlarni san'at asariga aylantiradi, bu san'at shakli tomoshabinga yangi tajriba beradi."
    },
    {
      "id": 554,
      "input": "San'at va qo'l mehnatida \"mobile art\" (mobil san'at) qanday qo'llaniladi?",
      "output": "\"Mobile art\" san'at asarlarini harakatlanuvchi, ko'chma yoki vaqtinchalik formatda yaratish orqali dinamik va interaktiv tajriba taqdim etadi."
    },
    {
      "id": 555,
      "input": "San'at va qo'l mehnatida \"text-based art\" (matn asosidagi san'at) qanday amalga oshiriladi?",
      "output": "\"Text-based art\" matn va so'zlarni san'at asari sifatida ishlatib, tushunchalarni va ma'lumotlarni estetik tarzda ifodalaydi."
    },
    {
      "id": 556,
      "input": "San'at va qo'l mehnatida \"collage art\" (kolaj san'ati) qanday qo'llaniladi?",
      "output": "\"Collage art\" turli materiallar, rasmlar yoki matnlarni birlashtirib yangi san'at asarini yaratish usulidir."
    },
    {
      "id": 557,
      "input": "San'at va qo'l mehnatida \"art in nature\" (tabiatdagi san'at) qanday amalga oshiriladi?",
      "output": "\"Art in nature\" tabiatdagi tabiiy resurslardan foydalanib, san'at asarlarini yaratish orqali atrof-muhitga hurmat ko'rsatadi."
    },
    {
      "id": 558,
      "input": "San'at va qo'l mehnatida \"art and nostalgia\" (san'at va nostalji) qanday qo'llaniladi?",
      "output": "\"Art and nostalgia\" eski xotiralarni va tarixni san'at orqali tiklash va yangi avlodlarga taqdim etish vositasi sifatida ishlatiladi."
    },
    {
      "id": 559,
      "input": "San'at va qo'l mehnatida \"ceramic art\" (keramika san'ati) qanday qo'llaniladi?",
      "output": "\"Ceramic art\" turli g'isht va keramika materiallaridan foydalangan holda san'at asarlari yaratadi, asosan idishlar yoki haykallar sifatida."
    },
    {
      "id": 560,
      "input": "San'at va qo'l mehnatida \"graffiti art\" (grafiti san'ati) qanday ishlatiladi?",
      "output": "\"Graffiti art\" ko'cha san'ati shakli bo'lib, devorlarda yoki jamoat joylarida tasvirlar va yozuvlar orqali ijtimoiy fikrlarni ifodalaydi."
    },
    {
      "id": 561,
      "input": "San'at va qo'l mehnatida \"found object art\" (topilgan predmetlar san'ati) qanday qo'llaniladi?",
      "output": "\"Found object art\" eskirgan yoki tashlangan obyektlardan foydalanib, yangi san'at asarlari yaratish orqali ularni yangicha ma'no bilan taqdim etadi."
    },
    {
      "id": 562,
      "input": "San'at va qo'l mehnatida \"textile sculpture\" (matodan haykallar) qanday ishlatiladi?",
      "output": "\"Textile sculpture\" matolarni shakllar yaratish va tuzish orqali uch o'lchovli san'at asarlarini yaratish uchun ishlatadi."
    },
    {
      "id": 563,
      "input": "San'at va qo'l mehnatida \"digital painting\" (raqamli rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Digital painting\" raqamli vositalar yordamida, masalan, grafik planshetlar va kompyuter dasturlari orqali rasm chizish jarayonidir."
    },
    {
      "id": 564,
      "input": "San'at va qo'l mehnatida \"handmade pottery\" (qo'lda ishlab chiqarilgan sopol buyumlar) qanday qo'llaniladi?",
      "output": "\"Handmade pottery\" qo'lda yaratilgan sopol idishlar, idish-tovoqlar va dekorativ buyumlarni ishlab chiqarishni o'z ichiga oladi."
    },
    {
      "id": 565,
      "input": "San'at va qo'l mehnatida \"glass art\" (shisha san'ati) qanday qo'llaniladi?",
      "output": "\"Glass art\" rangli va shaffof shisha materiallarini ishlatib, san'at asarlari yaratish, masalan, vitraj va shisha haykallar yaratish."
    },
    {
      "id": 566,
      "input": "San'at va qo'l mehnatida \"land art\" (landshaft san'ati) qanday amalga oshiriladi?",
      "output": "\"Land art\" tabiatda, ko'pincha ochiq maydonlarda, yerni san'at asariga aylantirish orqali yaratiladi."
    },
    {
      "id": 567,
      "input": "San'at va qo'l mehnatida \"portrait art\" (portret san'ati) qanday ishlatiladi?",
      "output": "\"Portrait art\" insonlarning yuzlarini yoki butun shaxsini tasvirlash orqali ularning xarakterini yoki ruhiy holatini ifodalaydi."
    },
    {
      "id": 568,
      "input": "San'at va qo'l mehnatida \"surrealist sculpture\" (surrealist haykaltaroshlik) qanday amalga oshiriladi?",
      "output": "\"Surrealist sculpture\" tasavvur va haqiqiyatni birlashtirgan shakllar yaratadi, odatda mutlaqo fantastik yoki tushli obrazlarga asoslangan."
    },
    {
      "id": 569,
      "input": "San'at va qo'l mehnatida \"social practice art\" (ijtimoiy amaliyot san'ati) qanday amalga oshiriladi?",
      "output": "\"Social practice art\" jamoat bilan bevosita aloqada bo'lib, san'at orqali ijtimoiy o'zgarishlarni amalga oshirishga qaratilgan."
    },
    {
      "id": 570,
      "input": "San'at va qo'l mehnatida \"recycled sculpture\" (qayta ishlangan materiallardan haykallar) qanday qo'llaniladi?",
      "output": "\"Recycled sculpture\" eski yoki tashlangan materiallardan (masalan, temir, plastmassa) foydalanib haykallar yaratish usulidir."
    },
    {
      "id": 571,
      "input": "San'at va qo'l mehnatida \"kinetic art\" (kinetik san'at) qanday ishlatiladi?",
      "output": "\"Kinetic art\" harakatni, masalan, mexanik harakatlarni san'at asarining bir qismi sifatida qo'llaydi."
    },
    {
      "id": 572,
      "input": "San'at va qo'l mehnatida \"body art\" (tanani san'at sifatida ishlatish) qanday amalga oshiriladi?",
      "output": "\"Body art\" inson tanasini san'at asari sifatida ishlatish, masalan, tatuirovkalar yoki tana bo'yoqlari orqali."
    },
    {
      "id": 573,
      "input": "San'at va qo'l mehnatida \"geometric art\" (geometrik san'at) qanday qo'llaniladi?",
      "output": "\"Geometric art\" shakllar, chiziqlar va burchaklar yordamida yaratilgan san'at asarlari, geometrik naqshlar va kompozitsiyalarni o'z ichiga oladi."
    },
    {
      "id": 574,
      "input": "San'at va qo'l mehnatida \"art and memory\" (san'at va xotira) qanday bog'lanadi?",
      "output": "\"Art and memory\" san'at orqali shaxsiy yoki kollektiv xotiralarni saqlash va eslatib turish uchun ishlatiladi."
    },
    {
      "id": 575,
      "input": "San'at va qo'l mehnatida \"interactive art\" (interaktiv san'at) qanday amalga oshiriladi?",
      "output": "\"Interactive art\" tomoshabinlarni asar bilan bevosita aloqada bo'lishga undaydi, masalan, sensorlar yoki ovozli o'zgarishlar yordamida."
    },
    {
      "id": 576,
      "input": "San'at va qo'l mehnatida \"abstract expressionism\" (abstrakt ekspressionizm) qanday qo'llaniladi?",
      "output": "\"Abstract expressionism\" tasviriy san'atda shakl va rang orqali ichki hissiyotlarni va emosiyalarni ifodalashni maqsad qiladi."
    },
    {
      "id": 577,
      "input": "San'at va qo'l mehnatida \"mixed media art\" (aralash materiallar san'ati) qanday qo'llaniladi?",
      "output": "\"Mixed media art\" bir nechta san'at usullarini va materiallarini birlashtirib, noyob asarlarni yaratish jarayonidir."
    },
    {
      "id": 578,
      "input": "San'at va qo'l mehnatida \"collaborative installation\" (hamkorlikda o'rnatish) qanday amalga oshiriladi?",
      "output": "\"Collaborative installation\" bir nechta san'atchilar tomonidan birgalikda yaratilgan o'rnatish asaridir."
    },
    {
      "id": 579,
      "input": "San'at va qo'l mehnatida \"public art installation\" (ommaviy san'at o'rnatish) qanday qo'llaniladi?",
      "output": "\"Public art installation\" jamoat joylarida o'rnatilgan san'at asarlari, odatda keng auditoriya uchun yaratilgan."
    },
    {
      "id": 580,
      "input": "San'at va qo'l mehnatida \"bio-art\" (biologik san'at) qanday ishlatiladi?",
      "output": "\"Bio-art\" biologik materiallardan (masalan, o'simliklar, hujayralar) foydalanib san'at asarlarini yaratish jarayonidir."
    },
    {
      "id": 581,
      "input": "San'at va qo'l mehnatida \"performance installation\" (ijro o'rnatish) qanday amalga oshiriladi?",
      "output": "\"Performance installation\" o'rnatish san'ati va jonli ijro san'atining birlashmasi bo'lib, tomoshabinlar bilan o'zaro ta'sirni ta'minlaydi."
    },
    {
      "id": 582,
      "input": "San'at va qo'l mehnatida \"neon art\" (neon san'ati) qanday qo'llaniladi?",
      "output": "\"Neon art\" neon yorug'liklarni san'at asariga aylantirib, jonli va yorqin ranglarni ishlatadi."
    },
    {
      "id": 583,
      "input": "San'at va qo'l mehnatida \"light and shadow art\" (yorug'lik va soyalar san'ati) qanday qo'llaniladi?",
      "output": "\"Light and shadow art\" yorug'lik va soyalar yordamida vizual kompozitsiyalar yaratish, bu san'ati uchun yangi o'lchovlarni ochadi."
    },
    {
      "id": 584,
      "input": "San'at va qo'l mehnatida \"artistic activism\" (san'atni faollik sifatida ishlatish) qanday amalga oshiriladi?",
      "output": "\"Artistic activism\" san'atni jamiyatdagi o'zgarishlar va faolliklarni qo'llab-quvvatlash uchun vosita sifatida ishlatadi."
    },
    {
      "id": 585,
      "input": "San'at va qo'l mehnatida \"pop art\" (pop san'ati) qanday ishlatiladi?",
      "output": "\"Pop art\" kundalik hayotdan olingan tasvirlar va mass-kulturaning elementlarini san'at asariga aylantirish orqali yaratiladi."
    },
    {
      "id": 586,
      "input": "San'at va qo'l mehnatida \"avant-garde art\" (avangard san'ati) qanday qo'llaniladi?",
      "output": "\"Avant-garde art\" yangi va tajribaviy san'at shakllarini sinovdan o'tkazib, an'anaviy san'at usullaridan chetlanadi."
    },
    {
      "id": 587,
      "input": "San'at va qo'l mehnatida \"ecological art\" (eko-sanat) qanday amalga oshiriladi?",
      "output": "\"Ecological art\" atrof-muhit va tabiiy resurslarni himoya qilish uchun san'at orqali ekologik xabarlar yuboradi."
    },
    {
      "id": 588,
      "input": "San'at va qo'l mehnatida \"conceptual art\" (kontseptual san'at) qanday qo'llaniladi?",
      "output": "\"Conceptual art\" asarlarning g'oyasi va ma'nosi asosiy e'tiborni jalb qiladi, vizual yoki material jihatlari esa ikkinchi darajali bo'ladi."
    },
    {
      "id": 589,
      "input": "San'at va qo'l mehnatida \"textile design\" (matolarni loyihalash) qanday ishlatiladi?",
      "output": "\"Textile design\" matolarni bezash va ularni turli to'qimachilik mahsulotlarida ishlatish uchun estetik dizayn yaratadi."
    },
    {
      "id": 590,
      "input": "San'at va qo'l mehnatida \"multimedia art\" (multimediya san'ati) qanday qo'llaniladi?",
      "output": "\"Multimedia art\" turli san'at shakllarini (rasm, video, ovoz, va boshqalar) birlashtirib, ko'p jihatdan boy tajriba yaratadi."
    },
    {
      "id": 591,
      "input": "San'at va qo'l mehnatida \"motion graphics\" (harakatli grafikalar) qanday ishlatiladi?",
      "output": "\"Motion graphics\" animatsiya va grafika dizaynini birlashtirib, vizual xabarlar va hikoyalarni yaratadi."
    },
    {
      "id": 592,
      "input": "San'at va qo'l mehnatida \"collage painting\" (kolaj rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Collage painting\" turli materiallar, rasmlar va bo'yoqlarni birlashtirgan rasm san'ati shaklidir."
    },
    {
      "id": 593,
      "input": "San'at va qo'l mehnatida \"minimalism\" (minimalizm) qanday qo'llaniladi?",
      "output": "\"Minimalism\" oddiy va toza shakllar orqali minimal elementlardan foydalanib san'at asarlari yaratadi."
    },
    {
      "id": 594,
      "input": "San'at va qo'l mehnatida \"artistic direction\" (san'at yo'nalishi) qanday amalga oshiriladi?",
      "output": "\"Artistic direction\" san'at asarining umumiy ko'rinishi va uslubini boshqaradi, san'atkorlarning ijodiy vizyonini shakllantiradi."
    },
    {
      "id": 595,
      "input": "San'at va qo'l mehnatida \"street photography\" (ko'cha fotografiyasi) qanday ishlatiladi?",
      "output": "\"Street photography\" jamoat joylaridagi haqiqiy va tabiiy hayotni tasvirlashga qaratilgan san'at shaklidir."
    },
    {
      "id": 596,
      "input": "San'at va qo'l mehnatida \"pattern design\" (naqsh dizayni) qanday qo'llaniladi?",
      "output": "\"Pattern design\" tasvirlar va naqshlarni takrorlash orqali vizual kompozitsiyalar yaratadi, matolar va boshqa yuzalar uchun ishlatiladi."
    },
    {
      "id": 597,
      "input": "San'at va qo'l mehnatida \"interactive media art\" (interaktiv media san'ati) qanday amalga oshiriladi?",
      "output": "\"Interactive media art\" tomoshabinlar bilan o'zaro aloqada bo'lib, ularni san'at asari jarayoniga jalb qiladi."
    },
    {
      "id": 598,
      "input": "San'at va qo'l mehnatida \"photo manipulation\" (fotografiyani manipulyatsiya qilish) qanday ishlatiladi?",
      "output": "\"Photo manipulation\" fotosuratlar ustida tahrir ishlari olib, yangi va ajralib turadigan vizual effektlar yaratadi."
    },
    {
      "id": 599,
      "input": "San'at va qo'l mehnatida \"fiber art\" (tolali san'at) qanday amalga oshiriladi?",
      "output": "\"Fiber art\" to'qimachilik va iplar yordamida san'at asarlari yaratadi, asosan yumshoq materiallar bilan ishlaydi."
    },
    {
      "id": 600,
      "input": "San'at va qo'l mehnatida \"portrait photography\" (portret fotografiyasi) qanday ishlatiladi?",
      "output": "\"Portrait photography\" insonlarning yuzini yoki butun tanasini tasvirlash orqali xarakter va hissiyotlarni aks ettiradi."
    },
    {
      "id": 601,
      "input": "San'at va qo'l mehnatida \"stained glass art\" (rangli shisha san'ati) qanday qo'llaniladi?",
      "output": "\"Stained glass art\" rangli shishalardan tashkil topgan vitrajlar orqali san'at yaratadi, asosan cherkovlar va jamoat joylarida ishlatiladi."
    },
    {
      "id": 602,
      "input": "San'at va qo'l mehnatida \"digital collage\" (raqamli kolaj) qanday amalga oshiriladi?",
      "output": "\"Digital collage\" turli raqamli tasvirlarni birlashtirib yangi kompozitsiyalar yaratish jarayonidir."
    },
    {
      "id": 603,
      "input": "San'at va qo'l mehnatida \"art therapy\" (san'at terapiyasi) qanday ishlatiladi?",
      "output": "\"Art therapy\" san'at orqali ruhiy va hissiy holatlarni yaxshilashga yordam beradi, odatda psixoterapiya vositasi sifatida ishlatiladi."
    },
    {
      "id": 604,
      "input": "San'at va qo'l mehnatida \"art installation\" (san'at o'rnatilishi) qanday qo'llaniladi?",
      "output": "\"Art installation\" san'at asarlarini o'rnatish orqali tomoshabinlarga yangi fazoviy va estetik tajriba yaratadi."
    },
    {
      "id": 605,
      "input": "San'at va qo'l mehnatida \"sound sculpture\" (ovozli haykal) qanday ishlatiladi?",
      "output": "\"Sound sculpture\" harakatni va ovozlarni san'at asariga aylantirgan, eshitish va ko'rishni birlashtirgan shakldir."
    },
    {
      "id": 606,
      "input": "San'at va qo'l mehnatida \"industrial design\" (sanoat dizayni) qanday qo'llaniladi?",
      "output": "\"Industrial design\" funksional va estetik jihatdan muhandislik va ishlab chiqarish jarayonlari bilan bog'liq dizaynni anglatadi."
    },
    {
      "id": 607,
      "input": "San'at va qo'l mehnatida \"origami art\" (origami san'ati) qanday ishlatiladi?",
      "output": "\"Origami art\" qog'ozni egish orqali turli shakllar yaratish, masalan, hayvonlar yoki geometrik shakllar."
    },
    {
      "id": 608,
      "input": "San'at va qo'l mehnatida \"paint pouring\" (bo'yoq quyish san'ati) qanday amalga oshiriladi?",
      "output": "\"Paint pouring\" bo'yoqlarni tomizish orqali abstrakt va rang-barang san'at asarlarini yaratish usulidir."
    },
    {
      "id": 609,
      "input": "San'at va qo'l mehnatida \"digital art\" (raqamli san'at) qanday qo'llaniladi?",
      "output": "\"Digital art\" kompyuter dasturlari yordamida san'at yaratishni anglatadi, rasm, animatsiya va dizayn kabi shakllarda."
    },
    {
      "id": 610,
      "input": "San'at va qo'l mehnatida \"photorealism\" (fotorealizm) qanday ishlatiladi?",
      "output": "\"Photorealism\" san'atda tasvirlarni imkon qadar haqiqiy, fotosuratga o'xshash tarzda yaratish usulidir."
    },
    {
      "id": 611,
      "input": "San'at va qo'l mehnatida \"temporary art\" (vaqtinchalik san'at) qanday amalga oshiriladi?",
      "output": "\"Temporary art\" vaqtinchalik materiallar va usullar yordamida yaratilgan san'at asarlaridir, odatda vaqt otishi bilan yoqoladi."
    },
    {
      "id": 612,
      "input": "San'at va qo'l mehnatida \"video art\" (video san'ati) qanday ishlatiladi?",
      "output": "\"Video art\" videokameralar yordamida yaratilgan san'at shakli bo'lib, ko'pincha tajriba va eksperimentlarga asoslangan."
    },
    {
      "id": 613,
      "input": "San'at va qo'l mehnatida \"geometric abstraction\" (geometrik abstraktsionizm) qanday qo'llaniladi?",
      "output": "\"Geometric abstraction\" tasvirlarni geometrik shakllar va ranglar orqali ifodalashga asoslangan san'at shaklidir."
    },
    {
      "id": 614,
      "input": "San'at va qo'l mehnatida \"urban art\" (shahar san'ati) qanday amalga oshiriladi?",
      "output": "\"Urban art\" shahar muhitida, devorlar, ko'cha va jamoat joylarida yaratilgan san'at asarlari bo'lib, ko'pincha grafiti va boshqa ko'cha san'ati shakllarini o'z ichiga oladi."
    },
    {
      "id": 615,
      "input": "San'at va qo'l mehnatida \"pencil drawing\" (qarash rasm chizish) qanday qo'llaniladi?",
      "output": "\"Pencil drawing\" qalam yordamida yuqori aniqlikdagi rasm chizish, asosan portretlar va detallarni tasvirlash uchun ishlatiladi."
    },
    {
      "id": 616,
      "input": "San'at va qo'l mehnatida \"calligraphy\" (xattotlik san'ati) qanday ishlatiladi?",
      "output": "\"Calligraphy\" chiroyli va aniq yozuvlarni yaratish san'ati bo'lib, matn va naqshlarni bezashda ishlatiladi."
    },
    {
      "id": 617,
      "input": "San'at va qo'l mehnatida \"photographic realism\" (fotografik realizm) qanday qo'llaniladi?",
      "output": "\"Photographic realism\" san'ati rasmni haqiqiy fotosuratga o'xshatib yaratishni maqsad qiladi, yuqori darajadagi detallar va aniqlik bilan."
    },
    {
      "id": 618,
      "input": "San'at va qo'l mehnatida \"calligraphy art\" (xattotlik san'ati) qanday amalga oshiriladi?",
      "output": "\"Calligraphy art\" chiroyli va o'ziga xos yozuvlar yaratish orqali matnni san'at asariga aylantirishdir."
    },
    {
      "id": 619,
      "input": "San'at va qo'l mehnatida \"paper mache\" (qog'ozdan tayyorlanadigan material) qanday ishlatiladi?",
      "output": "\"Paper mache\" qog'ozni yopishtiruvchi moddalar bilan birlashtirib, haykallar yoki boshqa shakllar yaratish uchun ishlatiladi."
    },
    {
      "id": 620,
      "input": "San'at va qo'l mehnatida \"sumi-e\" (yaponcha siyohli rasm chizish san'ati) qanday qo'llaniladi?",
      "output": "\"Sumi-e\" yaponcha bo'yoq va siyoh yordamida minimalistik va an'anaviy rasm chizish san'ati hisoblanadi."
    },
    {
      "id": 621,
      "input": "San'at va qo'l mehnatida \"3D printing art\" (3D bosib chiqarish san'ati) qanday ishlatiladi?",
      "output": "\"3D printing art\" kompyuter yordamida yaratilgan modellarni 3D printer orqali fizik shakllarga aylantirish jarayonidir."
    },
    {
      "id": 622,
      "input": "San'at va qo'l mehnatida \"performance art\" (ijro san'ati) qanday qo'llaniladi?",
      "output": "\"Performance art\" san'atkorning jonli ijrosini, harakatlarini va tomoshabinlar bilan aloqasini san'at shakli sifatida ishlatadi."
    },
    {
      "id": 623,
      "input": "San'at va qo'l mehnatida \"mixed media\" (aralash materiallar) qanday amalga oshiriladi?",
      "output": "\"Mixed media\" turli materiallar (rasm, qog'oz, bo'yoq va boshqa narsalar) birlashtirilgan san'at asarlarini yaratish usulidir."
    },
    {
      "id": 624,
      "input": "San'at va qo'l mehnatida \"body painting\" (tana bo'yash san'ati) qanday ishlatiladi?",
      "output": "\"Body painting\" inson tanasini bo'yash orqali san'at asarlari yaratish usulidir."
    },
    {
      "id": 625,
      "input": "San'at va qo'l mehnatida \"motion art\" (harakat san'ati) qanday qo'llaniladi?",
      "output": "\"Motion art\" harakatni san'at asarining bir qismi sifatida qo'llash, odatda kinetik yoki animatsion shakllarda amalga oshiriladi."
    },
    {
      "id": 626,
      "input": "San'at va qo'l mehnatida \"fresco\" (freska san'ati) qanday ishlatiladi?",
      "output": "\"Fresco\" devorlarga toza ohak yoki ranglar bilan chizilgan tasvirlar bo'lib, asosan katta miqyosdagi tasvirlarni yaratishda ishlatiladi."
    },
    {
      "id": 627,
      "input": "San'at va qo'l mehnatida \"street installation\" (ko'cha o'rnatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Street installation\" ko'cha muhitida yaratilingan san'at asarlaridir, odatda jamoat joylarida joylashtiriladi."
    },
    {
      "id": 628,
      "input": "San'at va qo'l mehnatida \"urban sketching\" (shahar skretchi) qanday qo'llaniladi?",
      "output": "\"Urban sketching\" shahar va uning jamoat joylarining tasvirlarini tezda chizish orqali ijodiy ishlanadi."
    },
    {
      "id": 629,
      "input": "San'at va qo'l mehnatida \"ceramic sculpture\" (keramika haykallari) qanday amalga oshiriladi?",
      "output": "\"Ceramic sculpture\" sopol va keramika materiallaridan haykallar yaratish orqali san'at asarlarini ifodalaydi."
    },
    {
      "id": 630,
      "input": "San'at va qo'l mehnatida \"geometric patterns\" (geometrik naqshlar) qanday qo'llaniladi?",
      "output": "\"Geometric patterns\" chiziqlar, shakllar va burchaklar orqali tasvirlarni yaratish va ularni san'at asarlariga aylantirishda ishlatiladi."
    },
    {
      "id": 631,
      "input": "San'at va qo'l mehnatida \"stencil art\" (shablon san'ati) qanday qo'llaniladi?",
      "output": "\"Stencil art\" shablonlar yordamida rasmlar yoki yozuvlarni yaratish jarayonidir, odatda tez va samarali tarzda ishlanadi."
    },
    {
      "id": 632,
      "input": "San'at va qo'l mehnatida \"interactive sculpture\" (interaktiv haykal) qanday amalga oshiriladi?",
      "output": "\"Interactive sculpture\" haykalni tomoshabinlar bilan o'zaro aloqada bo'lish uchun yaratiladi, odatda sensorlar yoki mexanizmlar yordamida."
    },
    {
      "id": 633,
      "input": "San'at va qo'l mehnatida \"tattoo art\" (tatuirovka san'ati) qanday ishlatiladi?",
      "output": "\"Tattoo art\" tana ustiga turli rasm va naqshlarni bo'yash orqali ijodiy ifodalanadi."
    },
    {
      "id": 634,
      "input": "San'at va qo'l mehnatida \"collaborative art\" (hamkorlikdagi san'at) qanday amalga oshiriladi?",
      "output": "\"Collaborative art\" bir nechta san'atchilarning birgalikda ishlashini talab qiladigan san'at shaklidir."
    },
    {
      "id": 635,
      "input": "San'at va qo'l mehnatida \"digital sculpture\" (raqamli haykal) qanday qo'llaniladi?",
      "output": "\"Digital sculpture\" kompyuter dasturlari yordamida 3D shakllar yaratish va ularni raqamli vositalarda ishlatish san'atidir."
    },
    {
      "id": 636,
      "input": "San'at va qo'l mehnatida \"typography\" (tipografiya san'ati) qanday amalga oshiriladi?",
      "output": "\"Typography\" harflar va so'zlarning san'ati, ularni estetik jihatdan yaratish va dizaynlash jarayonidir."
    },
    {
      "id": 637,
      "input": "San'at va qo'l mehnatida \"art installation\" (san'at o'rnatish) qanday qo'llaniladi?",
      "output": "\"Art installation\" asarlarining o'rnatilishi va joylashtirilishi orqali tomoshabinlarga yangi vizual tajriba yaratish usulidir."
    },
    {
      "id": 638,
      "input": "San'at va qo'l mehnatida \"glitch art\" (glitch san'ati) qanday amalga oshiriladi?",
      "output": "\"Glitch art\" raqamli texnologiyalar orqali xato yoki buzilgan tasvirlardan san'at yaratish usulidir."
    },
    {
      "id": 639,
      "input": "San'at va qo'l mehnatida \"textile art\" (matolar san'ati) qanday qo'llaniladi?",
      "output": "\"Textile art\" matolarni ishlatib san'at asarlari yaratish, masalan, to'qimachilik, tikuvchilik va kashta bilan."
    },
    {
      "id": 640,
      "input": "San'at va qo'l mehnatida \"animation art\" (animatsion san'at) qanday ishlatiladi?",
      "output": "\"Animation art\" harakatlanuvchi tasvirlarni yaratish va hikoyalar orqali vizual san'atni ifodalash jarayonidir."
    },
    {
      "id": 641,
      "input": "San'at va qo'l mehnatida \"installations with light\" (yorug'lik bilan o'rnatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Installations with light\" yorug'lik va o'zgaruvchan yoritish vositalari yordamida o'rnatilgan san'at asarlari yaratishdir."
    },
    {
      "id": 642,
      "input": "San'at va qo'l mehnatida \"audio-visual art\" (audio-vizual san'at) qanday qo'llaniladi?",
      "output": "\"Audio-visual art\" ovoz va tasvirlarni birlashtirib san'at asarlari yaratadi, masalan, video va musiqani birlashtirish orqali."
    },
    {
      "id": 643,
      "input": "San'at va qo'l mehnatida \"photomontage\" (fotomontaj) qanday amalga oshiriladi?",
      "output": "\"Photomontage\" bir nechta fotosuratlarni birlashtirib yangi tasvirlar yaratish jarayonidir."
    },
    {
      "id": 644,
      "input": "San'at va qo'l mehnatida \"sound design\" (ovoz dizayni) qanday qo'llaniladi?",
      "output": "\"Sound design\" film, teatr va boshqa san'at shakllarida ovozlarni yaratish va ularni atmosferaga moslashtirish jarayonidir."
    },
    {
      "id": 645,
      "input": "San'at va qo'l mehnatida \"digital painting\" (raqamli rasm chizish) qanday qo'llaniladi?",
      "output": "\"Digital painting\" kompyuter dasturlari yordamida rasm chizish, bo'yoq va qalamlardan foydalanishni taqlid qiladi."
    },
    {
      "id": 646,
      "input": "San'at va qo'l mehnatida \"pottery\" (keramika) qanday amalga oshiriladi?",
      "output": "\"Pottery\" g'isht yoki sopoldan idishlar, haykallar yoki boshqa shakllar yaratish uchun ishlatiladi."
    },
    {
      "id": 647,
      "input": "San'at va qo'l mehnatida \"abstract expressionism\" (abstrakt ekspressionizm) qanday qo'llaniladi?",
      "output": "\"Abstract expressionism\" ranglar, shakllar va harakatlar orqali hissiyotlarni ifodalovchi san'at usulidir."
    },
    {
      "id": 648,
      "input": "San'at va qo'l mehnatida \"public art\" (jamoat san'ati) qanday amalga oshiriladi?",
      "output": "\"Public art\" ochiq joylarda yoki jamoat maydonlarida yaratilib, keng jamoatchilikka taqdim etilgan san'at asarlarini anglatadi."
    },
    {
      "id": 649,
      "input": "San'at va qo'l mehnatida \"graffiti\" (grafiti san'ati) qanday qo'llaniladi?",
      "output": "\"Graffiti\" devorlarga yoki boshqa yuzalarga bo'yoqlar bilan yozilgan yoki chizilgan san'at shaklidir, odatda shahar muhitida uchraydi."
    },
    {
      "id": 650,
      "input": "San'at va qo'l mehnatida \"ceramic glaze\" (keramika qoplamasi) qanday qo'llaniladi?",
      "output": "\"Ceramic glaze\" keramika buyumlariga porlash va himoya qilish uchun ishlatiladigan suyuq qoplama materialidir."
    },
    {
      "id": 651,
      "input": "San'at va qo'l mehnatida \"hyperrealism\" (giperrealizm) qanday qo'llaniladi?",
      "output": "\"Hyperrealism\" tasvirlarni maksimal darajada haqiqiy va jonli ko'rinishda yaratishga qaratilgan san'at usulidir."
    },
    {
      "id": 652,
      "input": "San'at va qo'l mehnatida \"land art\" (land art san'ati) qanday amalga oshiriladi?",
      "output": "\"Land art\" tabiiy manzaralarni va landshaftlarni san'at asariga aylantirish, yer ustida yoki ichida yaratilgan asarlarni o'z ichiga oladi."
    },
    {
      "id": 653,
      "input": "San'at va qo'l mehnatida \"photogram\" (fotogramma) qanday qo'llaniladi?",
      "output": "\"Photogram\" surat olish uchun ob'ektlarni to'g'ridan-to'g'ri fotosensitiv qog'oz ustiga joylashtirish orqali yaratilgan rasm."
    },
    {
      "id": 654,
      "input": "San'at va qo'l mehnatida \"conceptual photography\" (kontseptual fotografiya) qanday amalga oshiriladi?",
      "output": "\"Conceptual photography\" ma'lum bir g'oya yoki tasavvurni ifodalash uchun rejalashtirilgan, yaxshilab ijro etilgan fotosuratlar yaratish."
    },
    {
      "id": 655,
      "input": "San'at va qo'l mehnatida \"collaborative design\" (hamkorlikdagi dizayn) qanday qo'llaniladi?",
      "output": "\"Collaborative design\" san'atkorlar yoki dizaynerlar birgalikda ishlash orqali birgalikda yangi mahsulot yoki san'at asarlarini yaratish."
    },
    {
      "id": 656,
      "input": "San'at va qo'l mehnatida \"laser art\" (lazer san'ati) qanday qo'llaniladi?",
      "output": "\"Laser art\" lazer nurlari yordamida yaratilgan san'at asarlaridir, ularni harakatlantirish va o'zgaruvchan effektlar yaratish uchun ishlatish mumkin."
    },
    {
      "id": 657,
      "input": "San'at va qo'l mehnatida \"charcoal drawing\" (ko'mir bilan rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Charcoal drawing\" ko'mir va o'rgatilgan materiallar yordamida tasvirlar yaratish, yumshoq va boy tuslarni ifodalashda ishlatiladi."
    },
    {
      "id": 658,
      "input": "San'at va qo'l mehnatida \"kinetic art\" (harakatli san'at) qanday qo'llaniladi?",
      "output": "\"Kinetic art\" san'at asarlarining harakatini va dinamizmni ta'kidlaydi, ko'pincha mexanik harakatlar orqali amalga oshiriladi."
    },
    {
      "id": 659,
      "input": "San'at va qo'l mehnatida \"silk painting\" (ipekda rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Silk painting\" ipak matosiga bo'yoqlarni qo'llab, rangli va boy tasvirlar yaratish san'ati hisoblanadi."
    },
    {
      "id": 660,
      "input": "San'at va qo'l mehnatida \"stained wood art\" (rangli yog'och san'ati) qanday qo'llaniladi?",
      "output": "\"Stained wood art\" yog'ochni ranglash orqali yangi ranglar va effektlar yaratish, yog'ochning tabiiy teksturasi va go'zalligini ta'kidlash."
    },
    {
      "id": 661,
      "input": "San'at va qo'l mehnatida \"video installation\" (video o'rnatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Video installation\" videolarni ko'plab ekranlar yoki bir nechta qurilmalarda o'rnatish orqali yaratilib, tomoshabinlar bilan interaktiv aloqada bo'lishi mumkin."
    },
    {
      "id": 662,
      "input": "San'at va qo'l mehnatida \"text art\" (matn san'ati) qanday qo'llaniladi?",
      "output": "\"Text art\" matn yoki so'zlarni san'at asariga aylantirib, vizual va hissiy xabarni ifodalashni maqsad qiladi."
    },
    {
      "id": 663,
      "input": "San'at va qo'l mehnatida \"mixed media collage\" (aralash materiallar kolaji) qanday amalga oshiriladi?",
      "output": "\"Mixed media collage\" turli materiallar, suratlar va bo'yoqlarni birlashtirgan rasm shaklini yaratish."
    },
    {
      "id": 664,
      "input": "San'at va qo'l mehnatida \"digital sculpture\" (raqamli haykal) qanday qo'llaniladi?",
      "output": "\"Digital sculpture\" kompyuter yordamida 3D modellar yaratish va ularni virtual yoki haqiqiy shakllarda chiqarish."
    },
    {
      "id": 665,
      "input": "San'at va qo'l mehnatida \"mosaic\" (mozaika san'ati) qanday amalga oshiriladi?",
      "output": "\"Mosaic\" kichik toshlar, shisha yoki boshqa materiallarni birlashtirib, tasvirlar yoki naqshlar yaratish san'ati."
    },
    {
      "id": 666,
      "input": "San'at va qo'l mehnatida \"embroidery\" (kashta tikish) qanday qo'llaniladi?",
      "output": "\"Embroidery\" mato ustiga ip yoki iplar yordamida naqshlar yoki tasvirlarni tikish san'ati."
    },
    {
      "id": 667,
      "input": "San'at va qo'l mehnatida \"mobile art\" (harakatli san'at) qanday amalga oshiriladi?",
      "output": "\"Mobile art\" harakatga keltiriladigan san'at asarlari bo'lib, ular odatda havoda yoki muhitda o'zgaradigan shaklda yaratiladi."
    },
    {
      "id": 668,
      "input": "San'at va qo'l mehnatida \"video mapping\" (video xaritalash) qanday qo'llaniladi?",
      "output": "\"Video mapping\" yuzalar yoki obyektlarga video materiallarni joylashtirib, vizual effektlar yaratish san'ati."
    },
    {
      "id": 669,
      "input": "San'at va qo'l mehnatida \"virtual reality art\" (virtual reallik san'ati) qanday qo'llaniladi?",
      "output": "\"Virtual reality art\" raqamli texnologiyalar yordamida 3D virtual dunyo yaratish va unda san'at asarlarini taqdim etish."
    },
    {
      "id": 670,
      "input": "San'at va qo'l mehnatida \"string art\" (ip san'ati) qanday amalga oshiriladi?",
      "output": "\"String art\" iplar yordamida geometrik naqshlar yoki rasm shakllarini yaratish san'ati."
    },
    {
      "id": 671,
      "input": "San'at va qo'l mehnatida \"metal sculpture\" (metall haykallari) qanday qo'llaniladi?",
      "output": "\"Metal sculpture\" metall materiallarni ishlatib, turli haykallar yoki ob'ektlar yaratish."
    },
    {
      "id": 672,
      "input": "San'at va qo'l mehnatida \"photography installation\" (fotografik o'rnatish) qanday amalga oshiriladi?",
      "output": "\"Photography installation\" fotosuratlarni o'rnatish orqali yangi san'at asari yaratish va tomoshabinlar bilan aloqada bo'lish."
    },
    {
      "id": 673,
      "input": "San'at va qo'l mehnatida \"3D modeling\" (3D model yaratish) qanday qo'llaniladi?",
      "output": "\"3D modeling\" raqamli texnologiyalar yordamida uch o'lchamli obyektlarni yaratish va ular orqali san'at asarlarini tasvirlash."
    },
    {
      "id": 674,
      "input": "San'at va qo'l mehnatida \"sculptural installation\" (haykal o'rnatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Sculptural installation\" haykallarni o'zgaruvchan va interaktiv tarzda o'rnatib, muhit bilan uyg'unlashtirish san'ati."
    },
    {
      "id": 675,
      "input": "San'at va qo'l mehnatida \"fashion design\" (moda dizayni) qanday qo'llaniladi?",
      "output": "\"Fashion design\" kiyim-kechak va aksessuarlarni yaratishda san'at va estetikani qo'llash jarayonidir."
    },
    {
      "id": 676,
      "input": "San'at va qo'l mehnatida \"color theory\" (rang nazariyasi) qanday ishlatiladi?",
      "output": "\"Color theory\" ranglarni bir-biri bilan uyg'unlashtirish, kontrast va kompozitsiya yaratishda qo'llaniladi."
    },
    {
      "id": 677,
      "input": "San'at va qo'l mehnatida \"illustration\" (illyustratsiya) qanday amalga oshiriladi?",
      "output": "\"Illustration\" kitoblar, jurnallar, reklama va boshqa vizual materiallar uchun rasm yoki tasvir yaratish san'ati."
    },
    {
      "id": 678,
      "input": "San'at va qo'l mehnatida \"architectural drawing\" (arxitektura chizmalari) qanday qo'llaniladi?",
      "output": "\"Architectural drawing\" binolar va boshqa arxitektura obyektlarining texnik va estetik loyihalarini chizishda ishlatiladi."
    },
    {
      "id": 679,
      "input": "San'at va qo'l mehnatida \"monotype printing\" (monotip bosib chiqarish) qanday amalga oshiriladi?",
      "output": "\"Monotype printing\" faqat bitta nusxani olish uchun rasm yoki tasvirni bosib chiqarish usulidir."
    },
    {
      "id": 680,
      "input": "San'at va qo'l mehnatida \"origami\" (yaponcha qog'oz san'ati) qanday qo'llaniladi?",
      "output": "\"Origami\" qog'ozni an'anaviy usullar bilan egish orqali turli shakllar va hayvonlarni yaratish san'ati."
    },
    {
      "id": 681,
      "input": "San'at va qo'l mehnatida \"minimalism\" (minimalizm) qanday amalga oshiriladi?",
      "output": "\"Minimalism\" oddiy va toza shakllar, minimal ranglar va detallar bilan san'at asarlarini yaratishdir."
    },
    {
      "id": 682,
      "input": "San'at va qo'l mehnatida \"lithography\" (litografiya) qanday qo'llaniladi?",
      "output": "\"Lithography\" tosh yuzasida tasvirlarni yaratib, ularni bosib chiqarish texnikasi."
    },
    {
      "id": 683,
      "input": "San'at va qo'l mehnatida \"pop art\" (pop san'ati) qanday amalga oshiriladi?",
      "output": "\"Pop art\" ommaviy madaniyat, reklama va kundalik hayot elementlarini san'atda aks ettirish usulidir."
    },
    {
      "id": 684,
      "input": "San'at va qo'l mehnatida \"futurism\" (futurizm) qanday qo'llaniladi?",
      "output": "\"Futurism\" texnologiya, tezlik va kelajakning yangi tasvirlarini yaratishga qaratilgan san'at harakati."
    },
    {
      "id": 685,
      "input": "San'at va qo'l mehnatida \"tapestry\" (to'quv san'ati) qanday amalga oshiriladi?",
      "output": "\"Tapestry\" matolarni to'qish orqali san'at asarlarini yaratish, ranglar va naqshlar yordamida ifodalash."
    },
    {
      "id": 686,
      "input": "San'at va qo'l mehnatida \"stained glass\" (rangli shisha san'ati) qanday qo'llaniladi?",
      "output": "\"Stained glass\" rangli shishalardan yasalgan tasvirlar yoki naqshlar yordamida yaratiladigan san'at shaklidir."
    },
    {
      "id": 687,
      "input": "San'at va qo'l mehnatida \"sound installation\" (ovoz o'rnatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Sound installation\" ovozlarni muhitga joylashtirib, interaktiv yoki pasif tarzda san'at yaratish."
    },
    {
      "id": 688,
      "input": "San'at va qo'l mehnatida \"kintsugi\" (yaponcha oltin bilan tiklash san'ati) qanday qo'llaniladi?",
      "output": "\"Kintsugi\" buzilgan keramika buyumlarini oltin yoki boshqa qimmatbaho moddalar bilan tiklash san'ati."
    },
    {
      "id": 689,
      "input": "San'at va qo'l mehnatida \"art nouveau\" (san'at yeni) qanday amalga oshiriladi?",
      "output": "\"Art nouveau\" organik shakllar, o'simlik naqshlari va tekis chiziqlar bilan yaratilgan san'at usulidir."
    },
    {
      "id": 690,
      "input": "San'at va qo'l mehnatida \"assemblage\" (to'plam san'ati) qanday qo'llaniladi?",
      "output": "\"Assemblage\" turli materiallar va obyektlarni birlashtirib, yangi san'at asarlarini yaratish usulidir."
    },
    {
      "id": 691,
      "input": "San'at va qo'l mehnatida \"plein air painting\" (ochiq havoda rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Plein air painting\" tashqi makonda tabiatni bevosita tasvirlash orqali rasm chizish san'ati."
    },
    {
      "id": 692,
      "input": "San'at va qo'l mehnatida \"watercolor\" (akvarel) qanday qo'llaniladi?",
      "output": "\"Watercolor\" suvga eriydigan bo'yoqlar yordamida yengil va shaffof ranglarni yaratish san'ati."
    },
    {
      "id": 693,
      "input": "San'at va qo'l mehnatida \"digital collages\" (raqamli kolajlar) qanday amalga oshiriladi?",
      "output": "\"Digital collages\" turli rasmlar va tasvirlarni kompyuterda birlashtirish orqali san'at asari yaratish."
    },
    {
      "id": 694,
      "input": "San'at va qo'l mehnatida \"graphic novel\" (grafik romanning san'ati) qanday qo'llaniladi?",
      "output": "\"Graphic novel\" hikoyani rasm va matn yordamida tasvirlash, san'at va adabiyotning uyg'unlashuvi."
    },
    {
      "id": 695,
      "input": "San'at va qo'l mehnatida \"surrealism\" (syurrealizm) qanday amalga oshiriladi?",
      "output": "\"Surrealism\" ong va tush ko'rinishidagi bo'linmalarni birlashtirib, realizm va norealizmni uyg'unlashtirgan san'at harakati."
    },
    {
      "id": 696,
      "input": "San'at va qo'l mehnatida \"concept art\" (kontseptual san'at) qanday qo'llaniladi?",
      "output": "\"Concept art\" kinolar, video o'yinlar yoki boshqa media loyihalarining vizual kontseptsiyalarini yaratish san'ati."
    },
    {
      "id": 697,
      "input": "San'at va qo'l mehnatida \"vintage art\" (antika san'ati) qanday amalga oshiriladi?",
      "output": "\"Vintage art\" eski uslubda yaratilgan san'at asarlari, tarixiy va nostaljik elementlar bilan ijod qilish."
    },
    {
      "id": 698,
      "input": "San'at va qo'l mehnatida \"fresco painting\" (freska chizish) qanday qo'llaniladi?",
      "output": "\"Fresco painting\" devorlarga yoki plafonlarga rangli bo'yoqlar bilan chizilgan tasvirlar, odatda pishgan ohakda ishlanadi."
    },
    {
      "id": 699,
      "input": "San'at va qo'l mehnatida \"hand lettering\" (qo'lda yozish san'ati) qanday amalga oshiriladi?",
      "output": "\"Hand lettering\" maxsus yozuv stilini qo'lda yaratish va vizual jozibali ifoda qilish san'ati."
    },
    {
      "id": 700,
      "input": "San'at va qo'l mehnatida \"urban photography\" (shahar fotografiyasi) qanday qo'llaniladi?",
      "output": "\"Urban photography\" shahar hayotining dinamikasini va kundalik sahnalarni suratga olish orqali san'at yaratish."
    },
    {
      "id": 701,
      "input": "San'at va qo'l mehnatida \"eco art\" (ekologik san'at) qanday amalga oshiriladi?",
      "output": "\"Eco art\" tabiiy resurslardan foydalanish va ekologik masalalarga e'tibor qaratish orqali san'at yaratish."
    },
    {
      "id": 702,
      "input": "San'at va qo'l mehnatida \"portrait painting\" (portret rasm chizish) qanday qo'llaniladi?",
      "output": "\"Portrait painting\" insonning yuzini va ifodalarini bo'yoqlar yordamida tasvirlash san'ati."
    },
    {
      "id": 703,
      "input": "San'at va qo'l mehnatida \"animation design\" (animatsion dizayn) qanday amalga oshiriladi?",
      "output": "\"Animation design\" harakatlanuvchi tasvirlarni yaratish, videolarni va interaktiv effektlarni dizaynlash."
    },
    {
      "id": 704,
      "input": "San'at va qo'l mehnatida \"pixel art\" (piksel san'ati) qanday qo'llaniladi?",
      "output": "\"Pixel art\" raqamli tasvirlarni juda kichik piksel o'lchamlari yordamida yaratish san'ati."
    },
    {
      "id": 705,
      "input": "San'at va qo'l mehnatida \"documentary photography\" (hujjatli fotografiya) qanday amalga oshiriladi?",
      "output": "\"Documentary photography\" ijtimoiy va tarixiy hodisalarni tasvirlash orqali haqiqatni hujjatlashtirish san'ati."
    },
    {
      "id": 706,
      "input": "San'at va qo'l mehnatida \"3D printing\" (3D bosib chiqarish) qanday qo'llaniladi?",
      "output": "\"3D printing\" raqamli modelni fizik shaklga aylantirishda, san'at asarlari va dizaynlar yaratishda ishlatiladi."
    },
    {
      "id": 707,
      "input": "San'at va qo'l mehnatida \"textile art\" (mato san'ati) qanday amalga oshiriladi?",
      "output": "\"Textile art\" matolarni to'qish, tikish va boshqa texnikalar yordamida san'at asarlarini yaratish."
    },
    {
      "id": 708,
      "input": "San'at va qo'l mehnatida \"installation art\" (o'rnatish san'ati) qanday qo'llaniladi?",
      "output": "\"Installation art\" ko'pincha o'rnatilgan yoki joylashgan materiallar orqali muhitni o'zgartirish va tomoshabinni jalb qilishga qaratilgan."
    },
    {
      "id": 709,
      "input": "San'at va qo'l mehnatida \"pottery wheel\" (keramika g'ildiragi) qanday ishlatiladi?",
      "output": "\"Pottery wheel\" keramika buyumlarini shakllantirish uchun ishlatiladi, xususan idishlar va haykallar yaratishda."
    },
    {
      "id": 710,
      "input": "San'at va qo'l mehnatida \"framing\" (ramkalash) qanday amalga oshiriladi?",
      "output": "\"Framing\" san'at asarlarini himoya qilish va ularni estetik jihatdan ko'rsatish uchun ramkalar bilan o'rab qo'yish."
    },
    {
      "id": 711,
      "input": "San'at va qo'l mehnatida \"performance art\" (ijro san'ati) qanday qo'llaniladi?",
      "output": "\"Performance art\" tomoshabinlar bilan to'g'ridan-to'g'ri muloqotda bo'lib, vaqtinchalik san'at asarlarini yaratishni anglatadi."
    },
    {
      "id": 712,
      "input": "San'at va qo'l mehnatida \"collage\" (kolaj san'ati) qanday amalga oshiriladi?",
      "output": "\"Collage\" turli materiallarni, suratlar yoki qismlarni birlashtirib, yangi san'at asarini yaratish texnikasidir."
    },
    {
      "id": 713,
      "input": "San'at va qo'l mehnatida \"dyeing\" (ranglash) qanday qo'llaniladi?",
      "output": "\"Dyeing\" matolarni yoki boshqa materiallarni rang berish uchun ishlatiladigan usuldir, ranglarni yaratish uchun kimyoviy moddalar qo'llaniladi."
    },
    {
      "id": 714,
      "input": "San'at va qo'l mehnatida \"mural painting\" (devor rasmlari) qanday amalga oshiriladi?",
      "output": "\"Mural painting\" devorlarga katta o'lchamdagi rasmlar yoki tasvirlar chizish san'ati."
    },
    {
      "id": 715,
      "input": "San'at va qo'l mehnatida \"etching\" (oyna chizish) qanday qo'llaniladi?",
      "output": "\"Etching\" metall yuzasiga kislota yordamida chizilgan tasvirlarni bosib chiqarish texnikasidir."
    },
    {
      "id": 716,
      "input": "San'at va qo'l mehnatida \"clay sculpture\" (g'ishtdan haykallar) qanday amalga oshiriladi?",
      "output": "\"Clay sculpture\" loydan turli shakllar, haykallar yoki dekorativ buyumlar yaratish."
    },
    {
      "id": 717,
      "input": "San'at va qo'l mehnatida \"fine art photography\" (nozik san'at fotografiyasi) qanday qo'llaniladi?",
      "output": "\"Fine art photography\" tasvirlar orqali estetik va san'atiy qiymatga ega rasmlar yaratish."
    },
    {
      "id": 718,
      "input": "San'at va qo'l mehnatida \"gouache painting\" (guash bo'yoqlari bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Gouache painting\" qalin, opak bo'yoqlar yordamida yaratilgan rasm chizish san'ati."
    },
    {
      "id": 719,
      "input": "San'at va qo'l mehnatida \"street art\" (ko'cha san'ati) qanday amalga oshiriladi?",
      "output": "\"Street art\" ko'cha devorlari, inshootlar yoki boshqa ochiq joylarda amalga oshirilgan san'at asaridir."
    },
    {
      "id": 720,
      "input": "San'at va qo'l mehnatida \"calligraphy\" (qalam bilan yozish san'ati) qanday qo'llaniladi?",
      "output": "\"Calligraphy\" maxsus kaligrafik qalamlar yordamida go'zal va estetik yozuvlarni yaratish san'ati."
    },
    {
      "id": 721,
      "input": "San'at va qo'l mehnatida \"ceramic sculpture\" (keramika haykallari) qanday amalga oshiriladi?",
      "output": "\"Ceramic sculpture\" keramika materialidan turli haykallar va san'at asarlarini yaratish."
    },
    {
      "id": 722,
      "input": "San'at va qo'l mehnatida \"digital collage\" (raqamli kolaj) qanday qo'llaniladi?",
      "output": "\"Digital collage\" kompyuter dasturlari yordamida suratlar yoki tasvirlarni birlashtirib, yangi san'at asari yaratish."
    },
    {
      "id": 723,
      "input": "San'at va qo'l mehnatida \"batik\" (badiiy rangli mato san'ati) qanday amalga oshiriladi?",
      "output": "\"Batik\" mato ustiga mum yoki boshqa moddalar yordamida naqshlar chizib, so'ngra rang berish usuli."
    },
    {
      "id": 724,
      "input": "San'at va qo'l mehnatida \"jewelry design\" (zargarlik dizayni) qanday qo'llaniladi?",
      "output": "\"Jewelry design\" zargarlik buyumlarini yaratish, qimmatbaho toshlar, metallar va boshqa materiallar bilan bezash."
    },
    {
      "id": 725,
      "input": "San'at va qo'l mehnatida \"paper art\" (qog'oz san'ati) qanday amalga oshiriladi?",
      "output": "\"Paper art\" qog'ozni turli shakllarda kesib yoki bukib, san'at asarlarini yaratish."
    },
    {
      "id": 726,
      "input": "San'at va qo'l mehnatida \"woodworking\" (yog'och ishlov berish) qanday qo'llaniladi?",
      "output": "\"Woodworking\" yog'ochni ishlov berish orqali mebellar, haykallar yoki boshqa san'at asarlarini yaratish."
    },
    {
      "id": 727,
      "input": "San'at va qo'l mehnatida \"conceptual photography\" (kontseptual fotografiya) qanday amalga oshiriladi?",
      "output": "\"Conceptual photography\" ma'lum bir g'oya yoki kontseptni aks ettirish uchun yaratilgan fotosuratlar."
    },
    {
      "id": 728,
      "input": "San'at va qo'l mehnatida \"natural dyeing\" (tabiiy rang berish) qanday qo'llaniladi?",
      "output": "\"Natural dyeing\" o'simliklar, mineral moddalar yoki boshqa tabiiy materiallar yordamida rang berish jarayoni."
    },
    {
      "id": 729,
      "input": "San'at va qo'l mehnatida \"traditional painting\" (an'anaviy rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Traditional painting\" klassik usullarda bo'yoqlar va badiiy texnikalarni qo'llab chizilgan rasmlar yaratish."
    },
    {
      "id": 730,
      "input": "San'at va qo'l mehnatida \"nature art\" (tabiat san'ati) qanday qo'llaniladi?",
      "output": "\"Nature art\" tabiatni, landshaftni yoki o'simliklarni san'at asariga aylantirish."
    },
    {
      "id": 731,
      "input": "San'at va qo'l mehnatida \"wood carving\" (yog'och o'yish) qanday amalga oshiriladi?",
      "output": "\"Wood carving\" yog'och materialini o'ymak yoki shakllantirish orqali san'at asarlarini yaratish."
    },
    {
      "id": 732,
      "input": "San'at va qo'l mehnatida \"public sculpture\" (ommaviy haykallar) qanday qo'llaniladi?",
      "output": "\"Public sculpture\" jamoat joylarida o'rnatilgan va odamlar tomonidan oson ko'rinadigan haykallar yaratish."
    },
    {
      "id": 733,
      "input": "San'at va qo'l mehnatida \"repurposing\" (materiallarni qayta ishlatish san'ati) qanday amalga oshiriladi?",
      "output": "\"Repurposing\" eski yoki ishlatilgan materiallarni yangi san'at asariga aylantirish."
    },
    {
      "id": 734,
      "input": "San'at va qo'l mehnatida \"kaleidoscope art\" (kaleydoskop san'ati) qanday qo'llaniladi?",
      "output": "\"Kaleidoscope art\" ko'plab ranglar, shakllar va naqshlardan iborat vizual effektlar yaratish san'ati."
    },
    {
      "id": 735,
      "input": "San'at va qo'l mehnatida \"text art\" (matn san'ati) qanday amalga oshiriladi?",
      "output": "\"Text art\" matn yoki so'zlar yordamida vizual tasvirlar yaratish."
    },
    {
      "id": 736,
      "input": "San'at va qo'l mehnatida \"origamic architecture\" (origami arxitekturasi) qanday qo'llaniladi?",
      "output": "\"Origamic architecture\" origami texnikasini arxitektura dizaynida ishlatib, strukturalar yaratish."
    },
    {
      "id": 737,
      "input": "San'at va qo'l mehnatida \"mosaic tiling\" (mozaika plitalari) qanday amalga oshiriladi?",
      "output": "\"Mosaic tiling\" plitalar yoki kichik toshlar yordamida naqshli va estetik yuzalar yaratish san'ati."
    },
    {
      "id": 738,
      "input": "San'at va qo'l mehnatida \"light art\" (yorug'lik san'ati) qanday qo'llaniladi?",
      "output": "\"Light art\" yorug'lik manbalarini san'at asarlarida ishlatish orqali vizual va interaktiv effektlar yaratish."
    },
    {
      "id": 739,
      "input": "San'at va qo'l mehnatida \"glass blowing\" (shisha portlatish) qanday amalga oshiriladi?",
      "output": "\"Glass blowing\" issiq shishani portlatib, uni turli shakllarga keltirish orqali san'at asarlari yaratish."
    },
    {
      "id": 740,
      "input": "San'at va qo'l mehnatida \"art therapy\" (san'at terapiyasi) qanday qo'llaniladi?",
      "output": "\"Art therapy\" san'atni terapiya vositasi sifatida ishlatib, ruhiy va hissiy holatlarni yaxshilash."
    },
    {
      "id": 741,
      "input": "San'at va qo'l mehnatida \"stone carving\" (tosh o'yish) qanday amalga oshiriladi?",
      "output": "\"Stone carving\" toshni o'yib, haykallar yoki dekorativ buyumlar yaratish jarayonidir."
    },
    {
      "id": 742,
      "input": "San'at va qo'l mehnatida \"fabric art\" (matolar san'ati) qanday qo'llaniladi?",
      "output": "\"Fabric art\" matolarni turli texnikalar yordamida ishlash va bezash orqali san'at asarlarini yaratish."
    },
    {
      "id": 743,
      "input": "San'at va qo'l mehnatida \"photomontage\" (fotomontaj) qanday amalga oshiriladi?",
      "output": "\"Photomontage\" bir nechta fotosuratlarni birlashtirib, yangi tasvir yaratish texnikasidir."
    },
    {
      "id": 744,
      "input": "San'at va qo'l mehnatida \"hand-painted furniture\" (qo'lda bo'yalgan mebel) qanday qo'llaniladi?",
      "output": "\"Hand-painted furniture\" mebellarni qo'lda chizilgan naqshlar yoki tasvirlar bilan bezash."
    },
    {
      "id": 745,
      "input": "San'at va qo'l mehnatida \"fossil art\" (fossil san'ati) qanday amalga oshiriladi?",
      "output": "\"Fossil art\" qadimgi hayvonlar va o'simliklarning qoldiqlaridan san'at asarlari yaratish."
    },
    {
      "id": 746,
      "input": "San'at va qo'l mehnatida \"eco-friendly art\" (eko-dost san'ati) qanday qo'llaniladi?",
      "output": "\"Eco-friendly art\" tabiiy va qayta ishlanadigan materiallar yordamida san'at yaratish."
    },
    {
      "id": 747,
      "input": "San'at va qo'l mehnatida \"iron forging\" (temir quyish) qanday amalga oshiriladi?",
      "output": "\"Iron forging\" issiq temirni urib, turli shakllarga keltirish orqali san'at asarlarini yaratish."
    },
    {
      "id": 748,
      "input": "San'at va qo'l mehnatida \"silk painting\" (iPulg'a bo'yoqlari bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Silk painting\" ipak mato ustida rangli bo'yoqlar bilan tasvirlar yaratish san'ati."
    },
    {
      "id": 749,
      "input": "San'at va qo'l mehnatida \"sand art\" (qum san'ati) qanday amalga oshiriladi?",
      "output": "\"Sand art\" qumni turli ranglar va shakllarga ajratib, san'at asarlarini yaratish."
    },
    {
      "id": 750,
      "input": "San'at va qo'l mehnatida \"laser engraving\" (lazerni o'yish) qanday qo'llaniladi?",
      "output": "\"Laser engraving\" lazer texnologiyasi yordamida materiallar ustiga naqsh yoki tasvirlar o'yish."
    },
    {
      "id": 751,
      "input": "San'at va qo'l mehnatida \"upcycling\" (qayta ishlash san'ati) qanday amalga oshiriladi?",
      "output": "\"Upcycling\" ishlatilgan materiallarni yangi san'at asarlariga aylantirish."
    },
    {
      "id": 752,
      "input": "San'at va qo'l mehnatida \"t-shirt printing\" (ko'ylaklarni bosib chiqarish) qanday qo'llaniladi?",
      "output": "\"T-shirt printing\" ko'ylaklar ustida naqshlar yoki rasmlar bosib chiqarish san'ati."
    },
    {
      "id": 753,
      "input": "San'at va qo'l mehnatida \"vintage photography\" (antik fotografiya) qanday amalga oshiriladi?",
      "output": "\"Vintage photography\" eski usullar yordamida olingan suratlarni san'at sifatida ishlatish."
    },
    {
      "id": 754,
      "input": "San'at va qo'l mehnatida \"stone mosaic\" (tosh mozaikasi) qanday qo'llaniladi?",
      "output": "\"Stone mosaic\" toshlar yordamida naqshlar yoki rasmiy kompozitsiyalar yaratish."
    },
    {
      "id": 755,
      "input": "San'at va qo'l mehnatida \"flower arrangement\" (gullarni bezash san'ati) qanday amalga oshiriladi?",
      "output": "\"Flower arrangement\" turli xil gullarni birlashtirib, estetik va san'at asarlari yaratish."
    },
    {
      "id": 756,
      "input": "San'at va qo'l mehnatida \"leather working\" (terini ishlash) qanday qo'llaniladi?",
      "output": "\"Leather working\" terini kesib, tikib va ishlov berib, san'at buyumlari yoki aksessuarlar yaratish."
    },
    {
      "id": 757,
      "input": "San'at va qo'l mehnatida \"calligraffiti\" (kaligrafiya va graffiti aralashmasi) qanday amalga oshiriladi?",
      "output": "\"Calligraffiti\" kaligrafiya va graffiti usullarini birlashtirgan yangi san'at shaklidir."
    },
    {
      "id": 758,
      "input": "San'at va qo'l mehnatida \"pencil drawing\" (qaralama rasm) qanday qo'llaniladi?",
      "output": "\"Pencil drawing\" grafit qalam yordamida yaratilingan rasm yoki tasvir san'ati."
    },
    {
      "id": 759,
      "input": "San'at va qo'l mehnatida \"gothic art\" (gotika san'ati) qanday amalga oshiriladi?",
      "output": "\"Gothic art\" gotika davrining arxitekturasi va tasviriy san'at usullaridan foydalanish."
    },
    {
      "id": 760,
      "input": "San'at va qo'l mehnatida \"wood burning\" (yog'ochni kuydirish) qanday qo'llaniladi?",
      "output": "\"Wood burning\" yog'och yuzasiga issiq narsa yordamida naqsh yoki tasvir o'yish texnikasi."
    },
    {
      "id": 761,
      "input": "San'at va qo'l mehnatida \"rag rug making\" (kreativ gilam to'qish) qanday amalga oshiriladi?",
      "output": "\"Rag rug making\" eski kiyimlar yoki matolarni qayta ishlash orqali gilam to'qish san'ati."
    },
    {
      "id": 762,
      "input": "San'at va qo'l mehnatida \"beading\" (marjonlar bilan ishlash) qanday qo'llaniladi?",
      "output": "\"Beading\" marjonlar, zargarlik buyumlari yoki boshqa aksessuarlar yaratish uchun ishlatiladi."
    },
    {
      "id": 763,
      "input": "San'at va qo'l mehnatida \"stamping\" (muhr bilan bosib chiqarish) qanday amalga oshiriladi?",
      "output": "\"Stamping\" maxsus muhrlar yordamida surat yoki naqshlar yaratish."
    },
    {
      "id": 764,
      "input": "San'at va qo'l mehnatida \"charcoal drawing\" (ko'mir bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Charcoal drawing\" ko'mir bilan yaratilgan rasm yoki portret san'ati."
    },
    {
      "id": 765,
      "input": "San'at va qo'l mehnatida \"brass casting\" (bronzani quyish) qanday amalga oshiriladi?",
      "output": "\"Brass casting\" issiq bronza eritmasini qoliplarga quyish orqali san'at asarlarini yaratish."
    },
    {
      "id": 766,
      "input": "San'at va qo'l mehnatida \"shibori\" (yaponcha ranglash texnikasi) qanday qo'llaniladi?",
      "output": "\"Shibori\" matolarni bukish, bog'lash va ranglash usuli orqali naqshlar yaratish."
    },
    {
      "id": 767,
      "input": "San'at va qo'l mehnatida \"dyed fabric art\" (ranglangan matolar san'ati) qanday amalga oshiriladi?",
      "output": "\"Dyed fabric art\" matolarni ranglash va san'at asariga aylantirish texnikasi."
    },
    {
      "id": 768,
      "input": "San'at va qo'l mehnatida \"mirror art\" (oyna san'ati) qanday qo'llaniladi?",
      "output": "\"Mirror art\" oynalar yordamida tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 769,
      "input": "San'at va qo'l mehnatida \"batik painting\" (batik bo'yoqlari bilan rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Batik painting\" mato ustida mum yordamida naqshlar chizib, so'ngra rang berish jarayoni."
    },
    {
      "id": 770,
      "input": "San'at va qo'l mehnatida \"tapestry weaving\" (gobelen to'qish) qanday qo'llaniladi?",
      "output": "\"Tapestry weaving\" matolarni to'qib, ranglar va naqshlar yordamida katta o'lchamdagi san'at asarlarini yaratish."
    },
    {
      "id": 771,
      "input": "San'at va qo'l mehnatida \"paper cutting\" (qog'ozni kesish san'ati) qanday amalga oshiriladi?",
      "output": "\"Paper cutting\" qog'ozni nozik va murakkab shakllarga kesib, san'at asarlarini yaratish."
    },
    {
      "id": 772,
      "input": "San'at va qo'l mehnatida \"glass painting\" (shisha bo'yoqlari bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Glass painting\" shisha yuzasiga bo'yoqlar bilan rasmlar chizish yoki naqshlar yaratish."
    },
    {
      "id": 773,
      "input": "San'at va qo'l mehnatida \"silversmithing\" (kumush ishlov berish) qanday amalga oshiriladi?",
      "output": "\"Silversmithing\" kumushni ishlov berib, zargarlik buyumlari yoki san'at asarlarini yaratish."
    },
    {
      "id": 774,
      "input": "San'at va qo'l mehnatida \"embroidery\" (kishiga tikish san'ati) qanday qo'llaniladi?",
      "output": "\"Embroidery\" mato ustida iplar yordamida naqshlar yoki tasvirlar tikish."
    },
    {
      "id": 775,
      "input": "San'at va qo'l mehnatida \"metal casting\" (metall quyish) qanday amalga oshiriladi?",
      "output": "\"Metal casting\" eritilgan metallni qoliplarga quyib, shakl yoki haykal yaratish."
    },
    {
      "id": 776,
      "input": "San'at va qo'l mehnatida \"fashion design\" (moda dizayni) qanday qo'llaniladi?",
      "output": "\"Fashion design\" kiyimlar va aksessuarlar yaratish, modaga mos dizaynlar ishlab chiqish."
    },
    {
      "id": 777,
      "input": "San'at va qo'l mehnatida \"patchwork\" (mato parchalarini birlashtirish) qanday amalga oshiriladi?",
      "output": "\"Patchwork\" turli mato parchalarini birlashtirib, yangi badiiy asarlar yoki kiyimlar yaratish."
    },
    {
      "id": 778,
      "input": "San'at va qo'l mehnatida \"fabric sculpture\" (mato haykallari) qanday qo'llaniladi?",
      "output": "\"Fabric sculpture\" matolarni shakllantirib, haykallar yoki boshqa san'at asarlarini yaratish."
    },
    {
      "id": 779,
      "input": "San'at va qo'l mehnatida \"resin art\" (rezin san'ati) qanday amalga oshiriladi?",
      "output": "\"Resin art\" epoksi yoki boshqa turdagi rezinlardan foydalanib, san'at asarlari yaratish."
    },
    {
      "id": 780,
      "input": "San'at va qo'l mehnatida \"scrapbook\" (eski buyumlardan albom yaratish) qanday qo'llaniladi?",
      "output": "\"Scrapbook\" eski suratlar, qog'ozlar va buyumlardan foydalanib, esdalik albomlari yaratish."
    },
    {
      "id": 781,
      "input": "San'at va qo'l mehnatida \"origami\" (yaponcha qog'ozni buklash san'ati) qanday amalga oshiriladi?",
      "output": "\"Origami\" qog'ozni nozik ravishda buklab, turli shakllar yaratish."
    },
    {
      "id": 782,
      "input": "San'at va qo'l mehnatida \"tie-dye\" (matoni ranglash) qanday qo'llaniladi?",
      "output": "\"Tie-dye\" matoni bog'lab yoki burab, turli ranglarga bo'yoq berish usuli."
    },
    {
      "id": 783,
      "input": "San'at va qo'l mehnatida \"nature printing\" (tabiatdan iz olish san'ati) qanday amalga oshiriladi?",
      "output": "\"Nature printing\" o'simliklar yoki tabiatning boshqa elementlaridan iz olib, san'at asarlari yaratish."
    },
    {
      "id": 784,
      "input": "San'at va qo'l mehnatida \"stained glass\" (rangli shisha) qanday qo'llaniladi?",
      "output": "\"Stained glass\" rangli shishalarni birlashtirib, deraza yoki boshqa badiiy buyumlar yaratish."
    },
    {
      "id": 785,
      "input": "San'at va qo'l mehnatida \"weaving\" (to'qish) qanday amalga oshiriladi?",
      "output": "\"Weaving\" iplarni bir-biriga o'rab, matolar yoki boshqa materiallarni to'qish."
    },
    {
      "id": 786,
      "input": "San'at va qo'l mehnatida \"metal embossing\" (metallni bosib chiqarish) qanday qo'llaniladi?",
      "output": "\"Metal embossing\" metall yuzasiga naqsh yoki tasvirlarni o'yib, bosib chiqarish."
    },
    {
      "id": 787,
      "input": "San'at va qo'l mehnatida \"knitting\" (tokish) qanday amalga oshiriladi?",
      "output": "\"Knitting\" iplarni tokib, kiyimlar yoki boshqa matolarni yaratish."
    },
    {
      "id": 788,
      "input": "San'at va qo'l mehnatida \"decoupage\" (qog'oz bilan bezash) qanday qo'llaniladi?",
      "output": "\"Decoupage\" qog'oz yoki matolarni kesib, buyumlar yoki mebellarni bezash."
    },
    {
      "id": 789,
      "input": "San'at va qo'l mehnatida \"batik dyeing\" (batik usulida rang berish) qanday amalga oshiriladi?",
      "output": "\"Batik dyeing\" matoni mum yordamida naqshlar chizib, so'ngra ranglash."
    },
    {
      "id": 790,
      "input": "San'at va qo'l mehnatida \"cartoon art\" (multfilm san'ati) qanday qo'llaniladi?",
      "output": "\"Cartoon art\" humoristik yoki hikoya asosida tasvirlar va animatsiyalar yaratish."
    },
    {
      "id": 791,
      "input": "San'at va qo'l mehnatida \"clay molding\" (loy bilan shakllantirish) qanday amalga oshiriladi?",
      "output": "\"Clay molding\" loyni turli shakllarda shakllantirib, haykallar yoki idishlar yaratish."
    },
    {
      "id": 792,
      "input": "San'at va qo'l mehnatida \"screen printing\" (ekran bosib chiqarish) qanday qo'llaniladi?",
      "output": "\"Screen printing\" mato yoki qog'oz ustiga bo'yoq yordamida naqsh yoki rasmlar bosish."
    },
    {
      "id": 793,
      "input": "San'at va qo'l mehnatida \"jewelry casting\" (zargarlik buyumlarini quyish) qanday amalga oshiriladi?",
      "output": "\"Jewelry casting\" zargarlik buyumlarini eritilgan metallarni qoliplarga quyish orqali yaratish."
    },
    {
      "id": 794,
      "input": "San'at va qo'l mehnatida \"digital painting\" (raqamli rasm chizish) qanday qo'llaniladi?",
      "output": "\"Digital painting\" kompyuter dasturlari yordamida raqamli tasvirlar yaratish."
    },
    {
      "id": 795,
      "input": "San'at va qo'l mehnatida \"mosaic\" (mozaika) qanday amalga oshiriladi?",
      "output": "\"Mosaic\" kichik toshlar, shisha yoki boshqa materiallardan naqshlar yoki tasvirlar yaratish."
    },
    {
      "id": 796,
      "input": "San'at va qo'l mehnatida \"felt making\" (paxta mato ishlab chiqarish) qanday qo'llaniladi?",
      "output": "\"Felt making\" paxtadan yoki junlardan turli buyumlar yoki san'at asarlarini yaratish."
    },
    {
      "id": 797,
      "input": "San'at va qo'l mehnatida \"calligraphy art\" (kaligrafiya san'ati) qanday amalga oshiriladi?",
      "output": "\"Calligraphy art\" maxsus qalam va texnikalar yordamida go'zal yozuvlar yaratish."
    },
    {
      "id": 798,
      "input": "San'at va qo'l mehnatida \"embossed leather\" (terini o'ymak) qanday qo'llaniladi?",
      "output": "\"Embossed leather\" teri yuzasiga naqsh yoki tasvirlarni o'yib yaratish."
    },
    {
      "id": 799,
      "input": "San'at va qo'l mehnatida \"stone polishing\" (toshni silliqlash) qanday amalga oshiriladi?",
      "output": "\"Stone polishing\" toshlarni silliqlash va ular ustida san'at asarlarini yaratish."
    },
    {
      "id": 800,
      "input": "San'at va qo'l mehnatida \"wood turning\" (yog'ochni aylantirish) qanday qo'llaniladi?",
      "output": "\"Wood turning\" yog'ochni g'ildirakda aylantirib, shakllar yoki buyumlar yaratish."
    },
    {
      "id": 801,
      "input": "San'at va qo'l mehnatida \"fossil art\" (fossil san'ati) qanday amalga oshiriladi?",
      "output": "\"Fossil art\" qadimgi hayvonlar va o'simliklarning qoldiqlaridan san'at asarlarini yaratish."
    },
    {
      "id": 802,
      "input": "San'at va qo'l mehnatida \"ceramic sculpture\" (keramika haykallari) qanday qo'llaniladi?",
      "output": "\"Ceramic sculpture\" loyni shakllantirib, ularni pishirib, turli haykallar yaratish san'ati."
    },
    {
      "id": 803,
      "input": "San'at va qo'l mehnatida \"3D printing\" (3D bosib chiqarish) qanday amalga oshiriladi?",
      "output": "\"3D printing\" kompyuter yordamida modellar yaratilib, ularni plastmassa yoki boshqa materiallardan bosib chiqarish."
    },
    {
      "id": 804,
      "input": "San'at va qo'l mehnatida \"natural dyeing\" (tabiiy ranglash) qanday qo'llaniladi?",
      "output": "\"Natural dyeing\" tabiiy o'simliklar, mevalar yoki mineral moddalar yordamida matolarni ranglash."
    },
    {
      "id": 805,
      "input": "San'at va qo'l mehnatida \"leather embossing\" (terini o'ymak) qanday amalga oshiriladi?",
      "output": "\"Leather embossing\" maxsus vositalar yordamida teri yuzasiga naqshlar yoki tasvirlarni o'yib chiqish."
    },
    {
      "id": 806,
      "input": "San'at va qo'l mehnatida \"miniature painting\" (miniatura rasm) qanday qo'llaniladi?",
      "output": "\"Miniature painting\" kichik hajmdagi tasvirlar yoki portretlar yaratish, detalga katta e'tibor qaratish."
    },
    {
      "id": 807,
      "input": "San'at va qo'l mehnatida \"crochet art\" (tokish san'ati) qanday amalga oshiriladi?",
      "output": "\"Crochet art\" iplarni maxsus krujka yordamida bog'lab, turli buyumlar yaratish."
    },
    {
      "id": 808,
      "input": "San'at va qo'l mehnatida \"art doll making\" (san'at qo'g'irchoqlari yaratish) qanday qo'llaniladi?",
      "output": "\"Art doll making\" turli materiallardan qo'g'irchoqlarni yaratarak, badiiy asarlar yaratish."
    },
    {
      "id": 809,
      "input": "San'at va qo'l mehnatida \"wooden toys\" (yog'ochdan o'yinchoqlar) qanday amalga oshiriladi?",
      "output": "\"Wooden toys\" yog'ochdan o'yinchoqlarni yasalib, badiiy va amaliy buyumlar yaratish."
    },
    {
      "id": 810,
      "input": "San'at va qo'l mehnatida \"pottery\" (porshelan yoki loy idishlar yasash) qanday qo'llaniladi?",
      "output": "\"Pottery\" loyni shakllantirib, uni pishirib, idishlar yoki haykallar yaratish."
    },
    {
      "id": 811,
      "input": "San'at va qo'l mehnatida \"mosaic glass\" (shisha mozaika) qanday amalga oshiriladi?",
      "output": "\"Mosaic glass\" rangli shishalardan turli naqshlar yoki tasvirlar yaratish texnikasi."
    },
    {
      "id": 812,
      "input": "San'at va qo'l mehnatida \"ceramic painting\" (keramika bo'yoqlari bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Ceramic painting\" keramika ustida bo'yoqlar yordamida tasvirlar yoki naqshlar chizish."
    },
    {
      "id": 813,
      "input": "San'at va qo'l mehnatida \"felt art\" (paxta san'ati) qanday amalga oshiriladi?",
      "output": "\"Felt art\" paxta yoki junni ishlatib, turli buyumlar yoki san'at asarlari yaratish."
    },
    {
      "id": 814,
      "input": "San'at va qo'l mehnatida \"furniture upcycling\" (mebelni qayta ishlash) qanday qo'llaniladi?",
      "output": "\"Furniture upcycling\" eski mebellarni yangilash yoki yangi badiiy shakl berish orqali qayta ishlash."
    },
    {
      "id": 815,
      "input": "San'at va qo'l mehnatida \"origamic architecture\" (arxitekturadagi origami) qanday amalga oshiriladi?",
      "output": "\"Origamic architecture\" qog'ozni buklash orqali maketlar yoki arxitekturaviy dizaynlar yaratish."
    },
    {
      "id": 816,
      "input": "San'at va qo'l mehnatida \"sand casting\" (qum quyish) qanday qo'llaniladi?",
      "output": "\"Sand casting\" qum va qoliplar yordamida metall buyumlarni yaratish texnikasi."
    },
    {
      "id": 817,
      "input": "San'at va qo'l mehnatida \"dyed paper art\" (ranglangan qog'oz san'ati) qanday amalga oshiriladi?",
      "output": "\"Dyed paper art\" qog'ozni ranglash va undan san'at asarlarini yaratish."
    },
    {
      "id": 818,
      "input": "San'at va qo'l mehnatida \"interactive art\" (interaktiv san'at) qanday qo'llaniladi?",
      "output": "\"Interactive art\" tomoshabinlarni san'at asariga kiritish, ular bilan o'zaro aloqada bo'lish."
    },
    {
      "id": 819,
      "input": "San'at va qo'l mehnatida \"brush lettering\" (qalam bilan yozish) qanday amalga oshiriladi?",
      "output": "\"Brush lettering\" maxsus cho'tkalar yordamida go'zal va o'ziga xos yozuvlar chizish."
    },
    {
      "id": 820,
      "input": "San'at va qo'l mehnatida \"ink wash painting\" (muma va siyoh bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Ink wash painting\" siyoh va suv aralashmasi yordamida noaniq va oq-qora rasm chizish texnikasi."
    },
    {
      "id": 821,
      "input": "San'at va qo'l mehnatida \"nail art\" (tirnoq san'ati) qanday amalga oshiriladi?",
      "output": "\"Nail art\" tirnoqlarni bo'yash va bezash orqali san'at asarlarini yaratish."
    },
    {
      "id": 822,
      "input": "San'at va qo'l mehnatida \"leaf pressing\" (yaproqni siqish) qanday qo'llaniladi?",
      "output": "\"Leaf pressing\" o'simlik yaproqlarini siqib, ularni san'at asariga aylantirish."
    },
    {
      "id": 823,
      "input": "San'at va qo'l mehnatida \"shadow box art\" (soya qutisi san'ati) qanday amalga oshiriladi?",
      "output": "\"Shadow box art\" turli ob'ektlar yoki rasm va naqshlarni qutida joylashtirib, 3D effekt yaratish."
    },
    {
      "id": 824,
      "input": "San'at va qo'l mehnatida \"thread art\" (ip bilan san'at) qanday qo'llaniladi?",
      "output": "\"Thread art\" iplar yordamida tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 825,
      "input": "San'at va qo'l mehnatida \"fabric painting\" (mato bo'yoqlari bilan rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Fabric painting\" matolar ustida bo'yoqlar yordamida rasm yoki naqshlar chizish."
    },
    {
      "id": 826,
      "input": "San'at va qo'l mehnatida \"crystal art\" (kristallar san'ati) qanday qo'llaniladi?",
      "output": "\"Crystal art\" turli kristallarni qo'llab, ularni san'at asarlariga aylantirish."
    },
    {
      "id": 827,
      "input": "San'at va qo'l mehnatida \"upcycled art\" (qayta ishlangan san'at) qanday amalga oshiriladi?",
      "output": "\"Upcycled art\" eski buyumlar yoki materiallardan yangi san'at asarlarini yaratish."
    },
    {
      "id": 828,
      "input": "San'at va qo'l mehnatida \"wood burning art\" (yog'ochni kuydirib san'at yaratish) qanday qo'llaniladi?",
      "output": "\"Wood burning art\" yog'och yuzasiga issiq narsa yordamida naqshlar o'yib, san'at yaratish."
    },
    {
      "id": 829,
      "input": "San'at va qo'l mehnatida \"nature photography\" (tabiat fotografiyasi) qanday amalga oshiriladi?",
      "output": "\"Nature photography\" tabiat va manzaralarni suratga olish va san'at sifatida taqdim etish."
    },
    {
      "id": 830,
      "input": "San'at va qo'l mehnatida \"glass etching\" (shisha o'yish) qanday qo'llaniladi?",
      "output": "\"Glass etching\" shisha yuzasini maxsus kimyoviy vositalar yordamida o'yish."
    },
    {
      "id": 831,
      "input": "San'at va qo'l mehnatida \"driftwood art\" (suv o'rgimchak san'ati) qanday amalga oshiriladi?",
      "output": "\"Driftwood art\" dengiz yoki daryo o'rgimchaklarini ishlatib, san'at asarlari yaratish."
    },
    {
      "id": 832,
      "input": "San'at va qo'l mehnatida \"woven baskets\" (to'qilgan savatlar) qanday qo'llaniladi?",
      "output": "\"Woven baskets\" o'simlik tolalari yoki iplar yordamida to'qilgan savatlarni yaratish."
    },
    {
      "id": 833,
      "input": "San'at va qo'l mehnatida \"encaustic painting\" (mum bilan rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Encaustic painting\" mum bilan rasm chizish, mumni qizdirib, uni bo'yoq sifatida ishlatish texnikasi."
    },
    {
      "id": 834,
      "input": "San'at va qo'l mehnatida \"resin casting\" (rezin quyish) qanday qo'llaniladi?",
      "output": "\"Resin casting\" eritilgan rezin materialdan shakllar yoki san'at asarlarini yaratish."
    },
    {
      "id": 835,
      "input": "San'at va qo'l mehnatida \"fused glass art\" (quvvatlangan shisha san'ati) qanday amalga oshiriladi?",
      "output": "\"Fused glass art\" turli rangdagi shishalarni birlashtirib, yangi san'at asarlarini yaratish."
    },
    {
      "id": 836,
      "input": "San'at va qo'l mehnatida \"carving\" (o'ymakorlik) qanday qo'llaniladi?",
      "output": "\"Carving\" turli materiallar, masalan, yog'och, tosh yoki suyakdan shakllar yoki naqshlar o'yish."
    },
    {
      "id": 837,
      "input": "San'at va qo'l mehnatida \"vintage art\" (antik san'at) qanday amalga oshiriladi?",
      "output": "\"Vintage art\" eski buyumlar yoki uslublardan ilhomlanib, yangi san'at asarlarini yaratish."
    },
    {
      "id": 838,
      "input": "San'at va qo'l mehnatida \"inkblot art\" (siyoh dog'lari san'ati) qanday qo'llaniladi?",
      "output": "\"Inkblot art\" siyoh dog'laridan yoki inyeksiyalaridan yaratilgan tasvirlar."
    },
    {
      "id": 839,
      "input": "San'at va qo'l mehnatida \"scrap metal art\" (temir scrap san'ati) qanday amalga oshiriladi?",
      "output": "\"Scrap metal art\" temir scrap yoki boshqa metallarni qayta ishlash orqali san'at asarlarini yaratish."
    },
    {
      "id": 840,
      "input": "San'at va qo'l mehnatida \"stenciling\" (ablon bilan bo'yash) qanday qo'llaniladi?",
      "output": "\"Stenciling\" maxsus ablon yordamida rasm yoki naqshlarni bo'yash."
    },
    {
      "id": 841,
      "input": "San'at va qo'l mehnatida \"stone carving\" (tosh o'ymakorligi) qanday amalga oshiriladi?",
      "output": "\"Stone carving\" toshni o'yib, haykal yoki turli shakllar yaratish texnikasi."
    },
    {
      "id": 842,
      "input": "San'at va qo'l mehnatida \"digital collage\" (raqamli kollyaj) qanday qo'llaniladi?",
      "output": "\"Digital collage\" raqamli vositalar yordamida turli tasvirlarni birlashtirib, yangi kompozitsiyalar yaratish."
    },
    {
      "id": 843,
      "input": "San'at va qo'l mehnatida \"spinning\" (ip o'ramoq) qanday amalga oshiriladi?",
      "output": "\"Spinning\" tolalar yoki iplarni aylanma harakat yordamida o'ramoq."
    },
    {
      "id": 844,
      "input": "San'at va qo'l mehnatida \"painting on fabric\" (mato ustida rasm chizish) qanday qo'llaniladi?",
      "output": "\"Painting on fabric\" mato ustiga bo'yoqlar bilan tasvirlar yoki naqshlar chizish."
    },
    {
      "id": 845,
      "input": "San'at va qo'l mehnatida \"tattoo art\" (tatuaj san'ati) qanday amalga oshiriladi?",
      "output": "\"Tattoo art\" tanaga doimiy tasvir yoki naqshlarni bo'yash san'ati."
    },
    {
      "id": 846,
      "input": "San'at va qo'l mehnatida \"bookbinding\" (kitob yopish) qanday qo'llaniladi?",
      "output": "\"Bookbinding\" kitoblarni yaratishda qog'oz, mato va boshqa materiallardan foydalanib, kitobni yopish texnikasi."
    },
    {
      "id": 847,
      "input": "San'at va qo'l mehnatida \"digital sculpture\" (raqamli haykaltaroshlik) qanday amalga oshiriladi?",
      "output": "\"Digital sculpture\" kompyuter dasturlari yordamida 3D haykallar yaratish."
    },
    {
      "id": 848,
      "input": "San'at va qo'l mehnatida \"beadwork\" (marjon to'qish) qanday qo'llaniladi?",
      "output": "\"Beadwork\" marjonlar yordamida turli naqshlar, zargarlik buyumlari yoki san'at asarlari yaratish."
    },
    {
      "id": 849,
      "input": "San'at va qo'l mehnatida \"upcycled jewelry\" (qayta ishlangan zargarlik) qanday amalga oshiriladi?",
      "output": "\"Upcycled jewelry\" eski materiallar yoki buyumlardan yangi zargarlik buyumlarini yaratish."
    },
    {
      "id": 850,
      "input": "San'at va qo'l mehnatida \"spray paint art\" (purkagich bo'yoq san'ati) qanday qo'llaniladi?",
      "output": "\"Spray paint art\" purkagich bo'yoq yordamida yuzalarni tezda bo'yash va turli tasvirlar yaratish."
    },
    {
      "id": 851,
      "input": "San'at va qo'l mehnatida \"silk painting\" (ipek ustida rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Silk painting\" ipek mato ustiga maxsus bo'yoqlar bilan rasm chizish texnikasi."
    },
    {
      "id": 852,
      "input": "San'at va qo'l mehnatida \"whittling\" (sichqoncha o'ymakorligi) qanday qo'llaniladi?",
      "output": "\"Whittling\" yog'ochni kesish va o'ymak yordamida kichik buyumlar yaratish."
    },
    {
      "id": 853,
      "input": "San'at va qo'l mehnatida \"calligraphic art\" (kaligrafik san'at) qanday amalga oshiriladi?",
      "output": "\"Calligraphic art\" go'zal va shakllangan yozuvlar yordamida san'at asarlarini yaratish."
    },
    {
      "id": 854,
      "input": "San'at va qo'l mehnatida \"geometric art\" (geometrik san'at) qanday qo'llaniladi?",
      "output": "\"Geometric art\" geometrik shakllar yordamida tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 855,
      "input": "San'at va qo'l mehnatida \"scrapbooking\" (eskizlar albomi yaratish) qanday amalga oshiriladi?",
      "output": "\"Scrapbooking\" eski suratlar, xatlar va materiallar yordamida esdalik albomlari yaratish."
    },
    {
      "id": 856,
      "input": "San'at va qo'l mehnatida \"string art\" (ip san'ati) qanday qo'llaniladi?",
      "output": "\"String art\" iplar yordamida geometrik yoki tasviriy naqshlar yaratish."
    },
    {
      "id": 857,
      "input": "San'at va qo'l mehnatida \"abstract painting\" (abstrakt rasm) qanday amalga oshiriladi?",
      "output": "\"Abstract painting\" aniq shakl va tasvirlardan qochib, ranglar va shakllar yordamida hissiyotlarni ifodalash."
    },
    {
      "id": 858,
      "input": "San'at va qo'l mehnatida \"knotted art\" (bog'lanish san'ati) qanday qo'llaniladi?",
      "output": "\"Knotted art\" iplar yoki boshqa materiallardan bog'lar hosil qilib san'at asarlarini yaratish."
    },
    {
      "id": 859,
      "input": "San'at va qo'l mehnatida \"natural sculpture\" (tabiat haykallari) qanday amalga oshiriladi?",
      "output": "\"Natural sculpture\" tabiiy materiallar, masalan, toshlar yoki daraxt shoxlari yordamida haykallar yaratish."
    },
    {
      "id": 860,
      "input": "San'at va qo'l mehnatida \"bubble wrap art\" (pufakli plyonka san'ati) qanday qo'llaniladi?",
      "output": "\"Bubble wrap art\" pufakli plyonkani bo'yoq bilan ishlatib, tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 861,
      "input": "San'at va qo'l mehnatida \"wood inlay\" (yog'ochni inley qilish) qanday amalga oshiriladi?",
      "output": "\"Wood inlay\" yog'och yuzasiga boshqa materiallar, masalan, metall yoki boshqa yog'ochlardan naqshlar o'yish."
    },
    {
      "id": 862,
      "input": "San'at va qo'l mehnatida \"quilling\" (qog'ozni o'rash san'ati) qanday amalga oshiriladi?",
      "output": "\"Quilling\" qog'ozni nozik o'qlar qilib, ularni spiral shaklida burab, san'at asarlarini yaratish."
    },
    {
      "id": 863,
      "input": "San'at va qo'l mehnatida \"marbling\" (rangli marmar san'ati) qanday qo'llaniladi?",
      "output": "\"Marbling\" bo'yoqlarni suvga solib, ularning yuzasida marmar naqshlarini yaratib, qog'oz yoki matoga o'tkazish."
    },
    {
      "id": 864,
      "input": "San'at va qo'l mehnatida \"doodle art\" (doodle san'ati) qanday amalga oshiriladi?",
      "output": "\"Doodle art\" oddiy, erkin chizilgan naqshlar yoki rasm shakllaridan foydalanib san'at asarlarini yaratish."
    },
    {
      "id": 865,
      "input": "San'at va qo'l mehnatida \"tapestry\" (tasmalar bilan to'qish) qanday qo'llaniladi?",
      "output": "\"Tapestry\" iplar va matolarni to'qib, turli tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 866,
      "input": "San'at va qo'l mehnatida \"shadow puppetry\" (soya qo'g'irchoqlari) qanday amalga oshiriladi?",
      "output": "\"Shadow puppetry\" yorug'lik manbaiga qarshi qo'g'irchoqlarni qo'yib, soya shakllarini yaratish."
    },
    {
      "id": 867,
      "input": "San'at va qo'l mehnatida \"sand painting\" (qum san'ati) qanday qo'llaniladi?",
      "output": "\"Sand painting\" qumni ranglayib, ularni qatlamlar yordamida san'at asarlariga aylantirish."
    },
    {
      "id": 868,
      "input": "San'at va qo'l mehnatida \"botanical art\" (o'simlik san'ati) qanday amalga oshiriladi?",
      "output": "\"Botanical art\" o'simliklar, gullar yoki boshqa tabiiy elementlar yordamida rasm chizish."
    },
    {
      "id": 869,
      "input": "San'at va qo'l mehnatida \"mixed media\" (aralash materiallar) qanday qo'llaniladi?",
      "output": "\"Mixed media\" bir nechta materiallarni birlashtirib, turli texnikalar yordamida san'at asarlarini yaratish."
    },
    {
      "id": 870,
      "input": "San'at va qo'l mehnatida \"mural painting\" (devor rasmlari) qanday amalga oshiriladi?",
      "output": "\"Mural painting\" katta yuzalarda, masalan, devorlarda rasm chizish va naqshlar yaratish."
    },
    {
      "id": 871,
      "input": "San'at va qo'l mehnatida \"furniture painting\" (mebel bo'yash) qanday qo'llaniladi?",
      "output": "\"Furniture painting\" mebelni bezash yoki yangilash uchun bo'yoqlarni qo'llash."
    },
    {
      "id": 872,
      "input": "San'at va qo'l mehnatida \"scrap fabric art\" (qayta ishlangan mato san'ati) qanday amalga oshiriladi?",
      "output": "\"Scrap fabric art\" eski yoki ortiqcha matolarni ishlatib, yangi san'at asarlari yaratish."
    },
    {
      "id": 873,
      "input": "San'at va qo'l mehnatida \"gouache painting\" (gva rasm chizish) qanday qo'llaniladi?",
      "output": "\"Gouache painting\" yuqori yopishqoqlikka ega bo'yoqlar yordamida rasm chizish."
    },
    {
      "id": 874,
      "input": "San'at va qo'l mehnatida \"gold leafing\" (oltin barg bilan ishlash) qanday amalga oshiriladi?",
      "output": "\"Gold leafing\" oltin bargni maxsus yopishqoqlik vositasi bilan materiallarga yopishtirish."
    },
    {
      "id": 875,
      "input": "San'at va qo'l mehnatida \"wall hanging\" (devor bezaklari) qanday qo'llaniladi?",
      "output": "\"Wall hanging\" mato yoki boshqa materiallardan devor uchun dekorativ buyumlar yaratish."
    },
    {
      "id": 876,
      "input": "San'at va qo'l mehnatida \"needle felting\" (ig'a bilan jun ishlash) qanday amalga oshiriladi?",
      "output": "\"Needle felting\" maxsus ig'alar yordamida junni qattiqlashtirib, turli shakllar yaratish."
    },
    {
      "id": 877,
      "input": "San'at va qo'l mehnatida \"textile printing\" (matolarni bosib chiqarish) qanday qo'llaniladi?",
      "output": "\"Textile printing\" matolarni maxsus bosib chiqarish texnikalari yordamida naqshlar yoki tasvirlar yaratish."
    },
    {
      "id": 878,
      "input": "San'at va qo'l mehnatida \"fishing lure crafting\" (o'rgimchak yasash) qanday amalga oshiriladi?",
      "output": "\"Fishing lure crafting\" baliq ovlash uchun turli o'rgimchaklarni yaratish san'ati."
    },
    {
      "id": 879,
      "input": "San'at va qo'l mehnatida \"origami jewelry\" (origami zargarligi) qanday qo'llaniladi?",
      "output": "\"Origami jewelry\" qog'ozni buklash orqali zargarlik buyumlarini yaratish."
    },
    {
      "id": 880,
      "input": "San'at va qo'l mehnatida \"collage art\" (kollyaj san'ati) qanday amalga oshiriladi?",
      "output": "\"Collage art\" turli materiallar yoki tasvirlarni birlashtirib, yangi kompozitsiyalar yaratish."
    },
    {
      "id": 881,
      "input": "San'at va qo'l mehnatida \"glass blowing\" (shisha puflash) qanday qo'llaniladi?",
      "output": "\"Glass blowing\" issiq shishani puflab shakl berish va turli buyumlar yaratish."
    },
    {
      "id": 882,
      "input": "San'at va qo'l mehnatida \"stone polishing\" (toshni silliqlash) qanday amalga oshiriladi?",
      "output": "\"Stone polishing\" toshlarni silliqlash va ularni porlab chiqishi uchun ishlash."
    },
    {
      "id": 883,
      "input": "San'at va qo'l mehnatida \"silk flower making\" (ipek gullar yasash) qanday qo'llaniladi?",
      "output": "\"Silk flower making\" ipek mato yordamida sun'iy gullarni yaratish."
    },
    {
      "id": 884,
      "input": "San'at va qo'l mehnatida \"embroidery\" (tikuv san'ati) qanday amalga oshiriladi?",
      "output": "\"Embroidery\" iplar yordamida matolarni bezash, turli naqshlar yoki tasvirlar yaratish."
    },
    {
      "id": 885,
      "input": "San'at va qo'l mehnatida \"light sculpture\" (yorug'lik haykallari) qanday qo'llaniladi?",
      "output": "\"Light sculpture\" yorug'lik manbalari yordamida haykal yoki shakllar yaratish."
    },
    {
      "id": 886,
      "input": "San'at va qo'l mehnatida \"stone mosaic\" (tosh mozaikasi) qanday amalga oshiriladi?",
      "output": "\"Stone mosaic\" toshlardan mozaika naqshlari yaratish."
    },
    {
      "id": 887,
      "input": "San'at va qo'l mehnatida \"clay animation\" (loy bilan animatsiya) qanday qo'llaniladi?",
      "output": "\"Clay animation\" loydan figurativ ob'ektlar yasab, ularni harakatga keltirib animatsiya yaratish."
    },
    {
      "id": 888,
      "input": "San'at va qo'l mehnatida \"handmade soap\" (qo'lda yasalgan sovun) qanday amalga oshiriladi?",
      "output": "\"Handmade soap\" tabiiy materiallar yordamida qo'lda sovun yasash."
    },
    {
      "id": 889,
      "input": "San'at va qo'l mehnatida \"recycled art\" (qayta ishlangan san'at) qanday qo'llaniladi?",
      "output": "\"Recycled art\" eski materiallar yoki chiqindilarni ishlatib, yangi san'at asarlarini yaratish."
    },
    {
      "id": 890,
      "input": "San'at va qo'l mehnatida \"terrarium making\" (terarium yasash) qanday amalga oshiriladi?",
      "output": "\"Terrarium making\" kichik o'simliklarni yoki ekosistemalarni shisha idishlarda saqlash va bezash."
    },
    {
      "id": 891,
      "input": "San'at va qo'l mehnatida \"bead embroidery\" (marjon bilan tikuv san'ati) qanday qo'llaniladi?",
      "output": "\"Bead embroidery\" marjonlarni ip yordamida matolarga tikib naqshlar yaratish."
    },
    {
      "id": 892,
      "input": "San'at va qo'l mehnatida \"woodturning\" (yog'ochni burash) qanday amalga oshiriladi?",
      "output": "\"Woodturning\" yog'ochni maxsus asboblar yordamida aylantirib shakl berish."
    },
    {
      "id": 893,
      "input": "San'at va qo'l mehnatida \"ceramic sculpture\" (keramika haykallari) qanday qo'llaniladi?",
      "output": "\"Ceramic sculpture\" keramika materialidan haykallar yoki shakllar yaratish."
    },
    {
      "id": 894,
      "input": "San'at va qo'l mehnatida \"found object art\" (topilgan buyumlar san'ati) qanday amalga oshiriladi?",
      "output": "\"Found object art\" eski yoki tashlab yuborilgan buyumlardan san'at asarlari yaratish."
    },
    {
      "id": 895,
      "input": "San'at va qo'l mehnatida \"paper mache\" (qog'oz plastika) qanday qo'llaniladi?",
      "output": "\"Paper mache\" qog'ozni yopishtiruvchi moddada aralashtirib, shakllar yaratish texnikasi."
    },
    {
      "id": 896,
      "input": "San'at va qo'l mehnatida \"pottery painting\" (cherkov bo'yash) qanday amalga oshiriladi?",
      "output": "\"Pottery painting\" keramika buyumlarini bezash uchun bo'yoqlarni qo'llash."
    },
    {
      "id": 897,
      "input": "San'at va qo'l mehnatida \"finger painting\" (barmoq bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Finger painting\" barmoqlar yordamida bo'yoq bilan rasm chizish."
    },
    {
      "id": 898,
      "input": "San'at va qo'l mehnatida \"knitting\" (ip bilan to'qish) qanday amalga oshiriladi?",
      "output": "\"Knitting\" ipni maxsus igna yordamida to'qib, matolar yoki zargarlik buyumlarini yaratish."
    },
    {
      "id": 899,
      "input": "San'at va qo'l mehnatida \"portrait photography\" (portret fotosurati) qanday qo'llaniladi?",
      "output": "\"Portrait photography\" odamlarning yuzlarini yoki tanasini tasvirlash uchun fotosuratlar olish."
    },
    {
      "id": 900,
      "input": "San'at va qo'l mehnatida \"craft beer labels\" (pivo yorliqlari) qanday amalga oshiriladi?",
      "output": "\"Craft beer labels\" pivo idishlariga maxsus dizaynlar yoki yorliqlar yaratish."
    },
    {
      "id": 901,
      "input": "San'at va qo'l mehnatida \"stained glass\" (rangli shisha san'ati) qanday qo'llaniladi?",
      "output": "\"Stained glass\" rangli shishalardan tuzilgan san'at asarlarini yaratish."
    },
    {
      "id": 902,
      "input": "San'at va qo'l mehnatida \"watercolor sketching\" (akvarel eskizlar) qanday amalga oshiriladi?",
      "output": "\"Watercolor sketching\" akvarel bo'yoqlari yordamida tezkor eskizlar yaratish."
    },
    {
      "id": 903,
      "input": "San'at va qo'l mehnatida \"felted soap\" (junli sovun) qanday qo'llaniladi?",
      "output": "\"Felted soap\" sovunni jun bilan o'rash, bu esa sovunning uzoqroq saqlanishini ta'minlaydi."
    },
    {
      "id": 904,
      "input": "San'at va qo'l mehnatida \"needle punching\" (ig'a bilan punching) qanday amalga oshiriladi?",
      "output": "\"Needle punching\" maxsus ig'a yordamida junni qattiqlashtirib, naqshlar yaratish."
    },
    {
      "id": 905,
      "input": "San'at va qo'l mehnatida \"scrapbook journaling\" (albom yozuvlari) qanday qo'llaniladi?",
      "output": "\"Scrapbook journaling\" esdaliklarni va yozuvlarni qo'shib, albomlar yaratish."
    },
    {
      "id": 906,
      "input": "San'at va qo'l mehnatida \"textile sculpture\" (mato haykallari) qanday amalga oshiriladi?",
      "output": "\"Textile sculpture\" mato yoki to'qimalar yordamida haykallar yoki shakllar yaratish."
    },
    {
      "id": 907,
      "input": "San'at va qo'l mehnatida \"fabric painting\" (mato ustida rasm chizish) qanday qo'llaniladi?",
      "output": "\"Fabric painting\" mato ustiga maxsus bo'yoqlar yordamida tasvirlar yoki naqshlar chizish."
    },
    {
      "id": 908,
      "input": "San'at va qo'l mehnatida \"beaded embroidery\" (marjonli tikuv) qanday amalga oshiriladi?",
      "output": "\"Beaded embroidery\" marjonlarni ip yordamida matoga tikib, naqshlar yaratish."
    },
    {
      "id": 909,
      "input": "San'at va qo'l mehnatida \"wood burning\" (yog'ochni yondirish) qanday qo'llaniladi?",
      "output": "\"Wood burning\" yog'och yuzasiga issiq asbob bilan yondirib, naqshlar yoki tasvirlar yaratish."
    },
    {
      "id": 910,
      "input": "San'at va qo'l mehnatida \"t-shirt design\" (futbolka dizayni) qanday amalga oshiriladi?",
      "output": "\"T-shirt design\" futbolkalar uchun maxsus dizaynlar yaratish va ularni bosib chiqarish."
    },
    {
      "id": 911,
      "input": "San'at va qo'l mehnatida \"butterfly art\" (kapalak san'ati) qanday qo'llaniladi?",
      "output": "\"Butterfly art\" kapalaklarning tasvirlari yoki shakllaridan ilhomlanib san'at asarlarini yaratish."
    },
    {
      "id": 912,
      "input": "San'at va qo'l mehnatida \"natural dyeing\" (tabiiy rang berish) qanday amalga oshiriladi?",
      "output": "\"Natural dyeing\" o'simliklar yoki boshqa tabiiy materiallar yordamida rang berish."
    },
    {
      "id": 913,
      "input": "San'at va qo'l mehnatida \"quilt making\" (yostiq to'qish) qanday qo'llaniladi?",
      "output": "\"Quilt making\" turli matolarni to'qib, yostiq yoki ko'proq tasvirli qatlamlar yaratish."
    },
    {
      "id": 914,
      "input": "San'at va qo'l mehnatida \"card making\" (kartochkalar yasash) qanday amalga oshiriladi?",
      "output": "\"Card making\" maxsus materiallar va dizaynlar yordamida qo'lda kartochkalar yaratish."
    },
    {
      "id": 915,
      "input": "San'at va qo'l mehnatida \"zine making\" (zine yasash) qanday qo'llaniladi?",
      "output": "\"Zine making\" mustaqil jurnal yoki badiiy nashrlar yaratish."
    },
    {
      "id": 916,
      "input": "San'at va qo'l mehnatida \"embroidered patches\" (tikilgan yamoqlar) qanday amalga oshiriladi?",
      "output": "\"Embroidered patches\" mato yoki kiyimlarga maxsus naqshlar yoki tasvirlar tikish."
    },
    {
      "id": 917,
      "input": "San'at va qo'l mehnatida \"stone carving\" (tosh o'ymakorligi) qanday qo'llaniladi?",
      "output": "\"Stone carving\" toshni o'yib, turli shakllar va naqshlar yaratish."
    },
    {
      "id": 918,
      "input": "San'at va qo'l mehnatida \"leaf pressing\" (yaproq bosish) qanday amalga oshiriladi?",
      "output": "\"Leaf pressing\" yangi tushgan yaproqlarni bosib, ularni san'at asariga aylantirish."
    },
    {
      "id": 919,
      "input": "San'at va qo'l mehnatida \"miniatures art\" (miniatyura san'ati) qanday qo'llaniladi?",
      "output": "\"Miniatures art\" juda kichik o'lchamdagi san'at asarlarini yaratish."
    },
    {
      "id": 920,
      "input": "San'at va qo'l mehnatida \"sewing\" (tikuv) qanday amalga oshiriladi?",
      "output": "\"Sewing\" matolarni birlashtirib, turli buyumlar yoki kiyimlar yaratish."
    },
    {
      "id": 921,
      "input": "San'at va qo'l mehnatida \"fused clay art\" (birlashtirilgan loy san'ati) qanday qo'llaniladi?",
      "output": "\"Fused clay art\" turli loy qismlarini eritib, ularni birlashtirib san'at asari yaratish."
    },
    {
      "id": 922,
      "input": "San'at va qo'l mehnatida \"fabric stamping\" (mato bilan bosish) qanday amalga oshiriladi?",
      "output": "\"Fabric stamping\" maxsus mato bosma naqshlarini yaratish uchun stampalar yordamida ishlash."
    },
    {
      "id": 923,
      "input": "San'at va qo'l mehnatida \"woodcut printing\" (yog'ochda bosma san'ati) qanday qo'llaniladi?",
      "output": "\"Woodcut printing\" yog'och yuzasiga naqshlar chizib, bosma qilish texnikasi."
    },
    {
      "id": 924,
      "input": "San'at va qo'l mehnatida \"origami folding\" (origami bilan buklash) qanday amalga oshiriladi?",
      "output": "\"Origami folding\" qog'ozni maxsus bkish texnikalari yordamida shakllar yaratish."
    },
    {
      "id": 925,
      "input": "San'at va qo'l mehnatida \"clay modeling\" (loy bilan modellashtirish) qanday qo'llaniladi?",
      "output": "\"Clay modeling\" loyni qo'llab, turli shakllar yoki haykallar yaratish."
    },
    {
      "id": 926,
      "input": "San'at va qo'l mehnatida \"wood carving\" (yog'och o'ymakorligi) qanday amalga oshiriladi?",
      "output": "\"Wood carving\" yog'ochni kesib, turli shakllar yoki naqshlar yaratish."
    },
    {
      "id": 927,
      "input": "San'at va qo'l mehnatida \"chainmail\" (zanjirli po'latlardan ishlash) qanday qo'llaniladi?",
      "output": "\"Chainmail\" po'lat halqalarni bir-biriga bog'lab, mustahkam va dekorativ buyumlar yaratish."
    },
    {
      "id": 928,
      "input": "San'at va qo'l mehnatida \"rubber stamping\" (rezina stampalardan foydalanish) qanday amalga oshiriladi?",
      "output": "\"Rubber stamping\" maxsus rezina stampalar yordamida qog'oz yoki boshqa materiallarga tasvirlar bosish."
    },
    {
      "id": 929,
      "input": "San'at va qo'l mehnatida \"block printing\" (blok bosma) qanday qo'llaniladi?",
      "output": "\"Block printing\" maxsus o'yilgan bloklar yordamida naqshlarni qog'oz yoki matolarga bosish."
    },
    {
      "id": 930,
      "input": "San'at va qo'l mehnatida \"basket weaving\" (aravachalar to'qish) qanday amalga oshiriladi?",
      "output": "\"Basket weaving\" aravachalar yoki idishlarni to'qish uchun turli o'simlik tolalarini ishlatish."
    },
    {
      "id": 931,
      "input": "San'at va qo'l mehnatida \"pencil sketching\" (qarag'ay bilan eskiz chizish) qanday qo'llaniladi?",
      "output": "\"Pencil sketching\" qalam yordamida tezkor eskizlar chizish."
    },
    {
      "id": 932,
      "input": "San'at va qo'l mehnatida \"charcoal drawing\" (ko'mir bilan rasm chizish) qanday amalga oshiriladi?",
      "output": "\"Charcoal drawing\" ko'mir yordamida keng qorong'u va yorqin kontrastlar yaratish."
    },
    {
      "id": 933,
      "input": "San'at va qo'l mehnatida \"macrame\" (makrama) qanday qo'llaniladi?",
      "output": "\"Macrame\" iplar yoki to'quv materiallari yordamida naqshli to'quv buyumlar yaratish."
    },
    {
      "id": 934,
      "input": "San'at va qo'l mehnatida \"tunnel book\" (tunel kitobi) qanday amalga oshiriladi?",
      "output": "\"Tunnel book\" bir necha qatlamli qog'ozni birlashtirib, tunel kabi chuqur ko'rinish yaratish."
    },
    {
      "id": 935,
      "input": "San'at va qo'l mehnatida \"altered books\" (o'zgartirilgan kitoblar) qanday qo'llaniladi?",
      "output": "\"Altered books\" eski kitoblarni san'at asariga aylantirish uchun ularni o'zgartirish."
    },
    {
      "id": 936,
      "input": "San'at va qo'l mehnatida \"marionette puppets\" (marionetka qo'g'irchoqlari) qanday amalga oshiriladi?",
      "output": "\"Marionette puppets\" iplar orqali boshqariladigan qo'g'irchoqlarni yaratish."
    },
    {
      "id": 937,
      "input": "San'at va qo'l mehnatida \"photorealism\" (foto-realist rasm) qanday qo'llaniladi?",
      "output": "\"Photorealism\" rasmni haqiqiy fotosuratga o'xshash tarzda chizish."
    },
    {
      "id": 938,
      "input": "San'at va qo'l mehnatida \"beadwork\" (marjon ishlash) qanday amalga oshiriladi?",
      "output": "\"Beadwork\" marjonlarni tikish yoki aralashtirish orqali san'at buyumlarini yaratish."
    },
    {
      "id": 939,
      "input": "San'at va qo'l mehnatida \"pysanky\" (Ukraina tuxum rasm chizish) qanday qo'llaniladi?",
      "output": "\"Pysanky\" maxsus vositalar yordamida Ukraina uslubida tuxumlar ustida naqshlar yaratish."
    },
    {
      "id": 940,
      "input": "San'at va qo'l mehnatida \"porcelain painting\" (porselein bo'yash) qanday amalga oshiriladi?",
      "output": "\"Porcelain painting\" maxsus bo'yoqlar yordamida porselein buyumlarini bezash."
    },
    {
      "id": 941,
      "input": "San'at va qo'l mehnatida \"hand-painted furniture\" (qo'lda bo'yalgan mebel) qanday qo'llaniladi?",
      "output": "\"Hand-painted furniture\" mebelni qo'lda bo'yash va bezash."
    },
    {
      "id": 942,
      "input": "San'at va qo'l mehnatida \"digital art\" (raqamli san'at) qanday amalga oshiriladi?",
      "output": "\"Digital art\" kompyuter dasturlari yordamida san'at asarlarini yaratish."
    },
    {
      "id": 943,
      "input": "San'at va qo'l mehnatida \"yarn bombing\" (ip bilan bezash) qanday qo'llaniladi?",
      "output": "\"Yarn bombing\" jamoat joylarida yoki inshootlarda ip bilan bezash san'ati."
    },
    {
      "id": 944,
      "input": "San'at va qo'l mehnatida \"clay earrings\" (loydan taqinchoqlar yasash) qanday amalga oshiriladi?",
      "output": "\"Clay earrings\" loydan turli shakllarda taqinchoqlar yaratish."
    },
    {
      "id": 945,
      "input": "San'at va qo'l mehnatida \"puzzle art\" (puzzle san'ati) qanday qo'llaniladi?",
      "output": "\"Puzzle art\" moslashtirilgan yoki o'zgartirilgan puzlalar yordamida san'at yaratish."
    },
    {
      "id": 946,
      "input": "San'at va qo'l mehnatida \"bottle art\" (shisha idish san'ati) qanday amalga oshiriladi?",
      "output": "\"Bottle art\" eski yoki tashlangan shisha idishlardan san'at asarlari yaratish."
    },
    {
      "id": 947,
      "input": "San'at va qo'l mehnatida \"junk jewelry\" (chiqindilardan zargarlik buyumlari) qanday qo'llaniladi?",
      "output": "\"Junk jewelry\" chiqindilardan yoki ishlatilgan materiallardan zargarlik buyumlari yaratish."
    },
    {
      "id": 948,
      "input": "San'at va qo'l mehnatida \"sound art\" (ovoz san'ati) qanday amalga oshiriladi?",
      "output": "\"Sound art\" turli ovozlarni san'at asariga aylantirish, ovozlarni yaratish va o'rganish."
    },
    {
      "id": 949,
      "input": "San'at va qo'l mehnatida \"origamic architecture\" (origami arxitekturasi) qanday qo'llaniladi?",
      "output": "\"Origamic architecture\" qog'ozni buklash texnikasi yordamida arxitektura shakllarini yaratish."
    },
    {
      "id": 950,
      "input": "San'at va qo'l mehnatida \"shadow art\" (soya san'ati) qanday amalga oshiriladi?",
      "output": "\"Shadow art\" yorug'lik va soyalardan foydalanib, san'at asarlarini yaratish."
    },
    {
      "id": 951,
      "input": "San'at va qo'l mehnatida \"paper cutting\" (qog'ozni kesish) qanday qo'llaniladi?",
      "output": "\"Paper cutting\" qog'ozni kesib, naqshlar yoki rasmlar yaratish."
    },
    {
      "id": 952,
      "input": "San'at va qo'l mehnatida \"gilding\" (oltin bilan bezash) qanday amalga oshiriladi?",
      "output": "\"Gilding\" oltin yoki boshqa qimmatbaho metallarni yuzaga qo'yish texnikasidir."
    },
    {
      "id": 953,
      "input": "San'at va qo'l mehnatida \"encaustic painting\" (mum bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Encaustic painting\" mum va ranglar bilan yuzaga chizilgan san'at asarlarini yaratish."
    },
    {
      "id": 954,
      "input": "San'at va qo'l mehnatida \"plaster casting\" (gipsdan nusxa olish) qanday amalga oshiriladi?",
      "output": "\"Plaster casting\" gipsni suyuq holatda shaklga solib, nusxalar yaratish."
    },
    {
      "id": 955,
      "input": "San'at va qo'l mehnatida \"stamping\" (stampalardan foydalanish) qanday qo'llaniladi?",
      "output": "\"Stamping\" maxsus tasvirlar yoki naqshlar uchun stampalarni bosish."
    },
    {
      "id": 956,
      "input": "San'at va qo'l mehnatida \"shrink plastic art\" (kichraytirilgan plastik san'ati) qanday amalga oshiriladi?",
      "output": "\"Shrink plastic art\" plastikni isitib, kichraytirib san'at buyumlari yaratish."
    },
    {
      "id": 957,
      "input": "San'at va qo'l mehnatida \"felt art\" (jun san'ati) qanday qo'llaniladi?",
      "output": "\"Felt art\" junni maxsus usullar bilan ishlov berib, san'at asarlarini yaratish."
    },
    {
      "id": 958,
      "input": "San'at va qo'l mehnatida \"collage\" (kolaj san'ati) qanday amalga oshiriladi?",
      "output": "\"Collage\" turli materiallarni birlashtirib, yangi san'at asari yaratish."
    },
    {
      "id": 959,
      "input": "San'at va qo'l mehnatida \"paper marbling\" (qog'ozni shishada bo'yash) qanday qo'llaniladi?",
      "output": "\"Paper marbling\" qog'ozning ustki qismiga suyuq bo'yoqni tashlab, naqsh yaratish."
    },
    {
      "id": 960,
      "input": "San'at va qo'l mehnatida \"mosaic\" (mozaika) qanday amalga oshiriladi?",
      "output": "\"Mosaic\" turli rangdagi kichik qismalardan katta tasvir yoki naqsh yaratish."
    },
    {
      "id": 961,
      "input": "San'at va qo'l mehnatida \"scrap metal art\" (metall chiqindilaridan san'at) qanday qo'llaniladi?",
      "output": "\"Scrap metal art\" chiqindilardan yoki eski metallardan san'at asarlarini yaratish."
    },
    {
      "id": 962,
      "input": "San'at va qo'l mehnatida \"fiber art\" (tolali san'at) qanday amalga oshiriladi?",
      "output": "\"Fiber art\" turli tolalar va matolar yordamida san'at asarlari yaratish."
    },
    {
      "id": 963,
      "input": "San'at va qo'l mehnatida \"calligraphy\" (yaxshi yozuv san'ati) qanday qo'llaniladi?",
      "output": "\"Calligraphy\" chiroyli va san'atga aylantirilgan yozuvlar yaratish."
    },
    {
      "id": 964,
      "input": "San'at va qo'l mehnatida \"origami jewelry\" (origami zargarlik buyumlari) qanday amalga oshiriladi?",
      "output": "\"Origami jewelry\" qog'ozni buklash orqali zargarlik buyumlari yaratish."
    },
    {
      "id": 965,
      "input": "San'at va qo'l mehnatida \"silk painting\" (ipek ustida rasm chizish) qanday qo'llaniladi?",
      "output": "\"Silk painting\" ipek matolariga ranglar bilan tasvirlar chizish."
    },
    {
      "id": 966,
      "input": "San'at va qo'l mehnatida \"metal embossing\" (metallni o'yma qilish) qanday amalga oshiriladi?",
      "output": "\"Metal embossing\" metall yuzasiga o'yma yoki naqshlar solish."
    },
    {
      "id": 967,
      "input": "San'at va qo'l mehnatida \"leatherworking\" (teri ishlov berish) qanday qo'llaniladi?",
      "output": "\"Leatherworking\" terini ishlov berib, turli buyumlar yoki aksessuarlar yaratish."
    },
    {
      "id": 968,
      "input": "San'at va qo'l mehnatida \"kintsugi\" (yaponiya usulida singan narsalarni tiklash) qanday amalga oshiriladi?",
      "output": "\"Kintsugi\" singan keramika buyumlarini oltin yoki kumush bilan tiklash."
    },
    {
      "id": 969,
      "input": "San'at va qo'l mehnatida \"tree of life\" (hayot daraxti) qanday qo'llaniladi?",
      "output": "\"Tree of life\" turli materiallar yordamida daraxt shaklini yaratish, odatda, simlar va marjonlardan."
    },
    {
      "id": 970,
      "input": "San'at va qo'l mehnatida \"wood inlay\" (yog'ochni inley qilish) qanday amalga oshiriladi?",
      "output": "\"Wood inlay\" yog'och yuzasiga boshqa materiallarni o'yib joylashtirish texnikasi."
    },
    {
      "id": 971,
      "input": "San'at va qo'l mehnatida \"rubber band art\" (rezina lenta san'ati) qanday qo'llaniladi?",
      "output": "\"Rubber band art\" rezina lentalar yordamida rangli va naqshli san'at asarlarini yaratish."
    },
    {
      "id": 972,
      "input": "San'at va qo'l mehnatida \"bubble wrap printing\" (pufakli qoplama bosma san'ati) qanday amalga oshiriladi?",
      "output": "\"Bubble wrap printing\" pufakli qoplamaning yuzasiga bo'yoq surib, bosma tasvirlar yaratish."
    },
    {
      "id": 973,
      "input": "San'at va qo'l mehnatida \"geometric art\" (geometrik san'at) qanday qo'llaniladi?",
      "output": "\"Geometric art\" geometrik shakllar va naqshlardan foydalangan san'at yaratish."
    },
    {
      "id": 974,
      "input": "San'at va qo'l mehnatida \"shadow box\" (soya qutisi) qanday amalga oshiriladi?",
      "output": "\"Shadow box\" 3D tasvirlar yoki san'at asarlarini qutida joylashtirish."
    },
    {
      "id": 975,
      "input": "San'at va qo'l mehnatida \"stitch art\" (tikish san'ati) qanday qo'llaniladi?",
      "output": "\"Stitch art\" turli xil tikuv texnikalari yordamida san'at asarlarini yaratish."
    },
    {
      "id": 976,
      "input": "San'at va qo'l mehnatida \"pallet art\" (paletadan san'at yaratish) qanday amalga oshiriladi?",
      "output": "\"Pallet art\" eski yoki yangi paletalarni ishlatib, san'at asarlarini yaratish."
    },
    {
      "id": 977,
      "input": "San'at va qo'l mehnatida \"pin art\" (pin san'ati) qanday qo'llaniladi?",
      "output": "\"Pin art\" mayda pinlar yoki ignalar yordamida tasvirlar yoki naqshlar yaratish."
    },
    {
      "id": 978,
      "input": "San'at va qo'l mehnatida \"ice sculpture\" (muz haykalini yaratish) qanday amalga oshiriladi?",
      "output": "\"Ice sculpture\" muzdan haykallar yoki naqshlar o'yib yaratish."
    },
    {
      "id": 979,
      "input": "San'at va qo'l mehnatida \"recycled art\" (qayta ishlangan materiallar san'ati) qanday qo'llaniladi?",
      "output": "\"Recycled art\" eski va qayta ishlangan materiallardan san'at asarlarini yaratish."
    },
    {
      "id": 980,
      "input": "San'at va qo'l mehnatida \"candle making\" (qandil yasash) qanday amalga oshiriladi?",
      "output": "\"Candle making\" soya yoki mumdan yoritish uchun chiroqlar yaratish."
    },
    {
      "id": 981,
      "input": "San'at va qo'l mehnatida \"tattoo art\" (tatuirovka san'ati) qanday qo'llaniladi?",
      "output": "\"Tattoo art\" teriga doimiy tasvirlar yoki naqshlar ishlov berish san'ati."
    },
    {
      "id": 982,
      "input": "San'at va qo'l mehnatida \"mural painting\" (devor rasmi) qanday amalga oshiriladi?",
      "output": "\"Mural painting\" devorlarga katta hajmdagi tasvirlar yoki rasmlar chizish."
    },
    {
      "id": 983,
      "input": "San'at va qo'l mehnatida \"gouache painting\" (guae bilan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Gouache painting\" suyuq guae bo'yoqlar bilan rasm chizish texnikasi."
    },
    {
      "id": 984,
      "input": "San'at va qo'l mehnatida \"pottery wheel\" (loy burgu) qanday amalga oshiriladi?",
      "output": "\"Pottery wheel\" burgu yordamida loydan idishlar yoki shakllar yasash."
    },
    {
      "id": 985,
      "input": "San'at va qo'l mehnatida \"stained glass\" (rangli shisha san'ati) qanday qo'llaniladi?",
      "output": "\"Stained glass\" rangli shishalardan bezakli tasvirlar yaratish."
    },
    {
      "id": 986,
      "input": "San'at va qo'l mehnatida \"crochet art\" (qoshni san'ati) qanday amalga oshiriladi?",
      "output": "\"Crochet art\" iplar yordamida turli buyumlar yoki naqshlar to'qish."
    },
    {
      "id": 987,
      "input": "San'at va qo'l mehnatida \"vintage art\" (antik san'at) qanday qo'llaniladi?",
      "output": "\"Vintage art\" eski uslubdagi san'at asarlarini yaratish yoki tiklash."
    },
    {
      "id": 988,
      "input": "San'at va qo'l mehnatida \"sand art\" (qum san'ati) qanday amalga oshiriladi?",
      "output": "\"Sand art\" qumdan turli tasvirlar yoki shakllar yaratish."
    },
    {
      "id": 989,
      "input": "San'at va qo'l mehnatida \"embroidery\" (kamonchilik) qanday qo'llaniladi?",
      "output": "\"Embroidery\" matolarga iplar yordamida naqsh yoki tasvirlar tikish."
    },
    {
      "id": 990,
      "input": "San'at va qo'l mehnatida \"quilling\" (qog'ozni burish san'ati) qanday amalga oshiriladi?",
      "output": "\"Quilling\" qog'ozni burish va bkish orqali naqshlar yoki rasm chizish."
    },
    {
      "id": 991,
      "input": "San'at va qo'l mehnatida \"wall art\" (devor san'ati) qanday qo'llaniladi?",
      "output": "\"Wall art\" devorlarga turli materiallar yoki tasvirlar yordamida san'at yaratish."
    },
    {
      "id": 992,
      "input": "San'at va qo'l mehnatida \"flower arrangement\" (gullarni bezash san'ati) qanday amalga oshiriladi?",
      "output": "\"Flower arrangement\" gullar va o'simliklardan estetik bezak yaratish."
    },
    {
      "id": 993,
      "input": "San'at va qo'l mehnatida \"ceramic painting\" (keramika bo'yash) qanday qo'llaniladi?",
      "output": "\"Ceramic painting\" keramika buyumlarini maxsus bo'yoqlar bilan bezash."
    },
    {
      "id": 994,
      "input": "San'at va qo'l mehnatida \"clay sculpture\" (loy haykali) qanday amalga oshiriladi?",
      "output": "\"Clay sculpture\" loydan haykallar yoki san'at asarlarini yaratish."
    },
    {
      "id": 995,
      "input": "San'at va qo'l mehnatida \"knitting\" (to'qish) qanday qo'llaniladi?",
      "output": "\"Knitting\" ip yordamida buyumlar yoki kiyim-kechaklar to'qish."
    },
    {
      "id": 996,
      "input": "San'at va qo'l mehnatida \"paper mache\" (qog'ozdan yasalgan haykallar) qanday amalga oshiriladi?",
      "output": "\"Paper mache\" qog'oz va yopishtiruvchi aralashmasidan turli shakllar yoki haykallar yasash."
    },
    {
      "id": 997,
      "input": "San'at va qo'l mehnatida \"wood turning\" (yog'ochni aylantirish) qanday qo'llaniladi?",
      "output": "\"Wood turning\" yog'ochni aylantirish yordamida turli shakllar yoki buyumlar yaratish."
    },
    {
      "id": 998,
      "input": "San'at va qo'l mehnatida \"laser cutting\" (lazer bilan kesish) qanday amalga oshiriladi?",
      "output": "\"Laser cutting\" lazer yordamida materiallarni kesish va naqshlar yaratish."
    },
    {
      "id": 999,
      "input": "San'at va qo'l mehnatida \"textile printing\" (matolarni bosma qilish) qanday qo'llaniladi?",
      "output": "\"Textile printing\" matolar ustiga naqsh yoki tasvirlar bosish."
    },
    {
      "id": 1000,
      "input": "San'at va qo'l mehnatida \"glass blowing\" (shisha puflash) qanday amalga oshiriladi?",
      "output": "\"Glass blowing\" shishani isitib, uni puflab shakllar yaratish."
    },
    {
      "id": 1001,
      "input": "San'at va qo'l mehnatida \"pencil art\" (qarag'ay bilan san'at) qanday qo'llaniladi?",
      "output": "\"Pencil art\" qalam yordamida detallangan rasm yoki tasvirlar chizish."
    },
    {
      "id": 1002,
      "input": "San'at va qo'l mehnatida \"stitchery\" (tikuv san'ati) qanday amalga oshiriladi?",
      "output": "\"Stitchery\" turli xil iplar yordamida matolarni bezash."
    },
    {
      "id": 1003,
      "input": "San'at va qo'l mehnatida \"tote bag painting\" (sumka bo'yash) qanday qo'llaniladi?",
      "output": "\"Tote bag painting\" mato sumkalarini maxsus bo'yoqlar bilan bezash."
    },
    {
      "id": 1004,
      "input": "San'at va qo'l mehnatida \"needle felting\" (ignali jun ishlov berish) qanday amalga oshiriladi?",
      "output": "\"Needle felting\" junni igna yordamida shakllar yoki naqshlar yaratish."
    },
    {
      "id": 1005,
      "input": "San'at va qo'l mehnatida \"stone carving\" (tosh o'ymakorligi) qanday qo'llaniladi?",
      "output": "\"Stone carving\" toshni kesib, naqshlar yoki haykallar yaratish."
    },
    {
      "id": 1006,
      "input": "San'at va qo'l mehnatida \"brass embossing\" (bronza o'yma san'ati) qanday amalga oshiriladi?",
      "output": "\"Brass embossing\" bronza materialini o'yib, naqshlar yoki tasvirlar yaratish."
    },
    {
      "id": 1007,
      "input": "San'at va qo'l mehnatida \"pallet painting\" (paletadan rasm chizish) qanday qo'llaniladi?",
      "output": "\"Pallet painting\" eskirgan yoki ishlatilgan paletalarga rasm chizish."
    },
    {
      "id": 1008,
      "input": "San'at va qo'l mehnatida \"jewelry design\" (zargarlik buyumlarini loyihalash) qanday amalga oshiriladi?",
      "output": "\"Jewelry design\" turli materiallardan (metall, marjon, tosh) zargarlik buyumlarini loyihalash."
    },
    {
      "id": 1009,
      "input": "San'at va qo'l mehnatida \"ceramic mosaic\" (keramika mozaikasi) qanday qo'llaniladi?",
      "output": "\"Ceramic mosaic\" keramika plitkalari yordamida naqshli tasvirlar yaratish."
    },
    {
      "id": 1010,
      "input": "San'at va qo'l mehnatida \"bead weaving\" (marjon to'qish) qanday amalga oshiriladi?",
      "output": "\"Bead weaving\" marjonlarni ip yordamida to'qish va naqshlar yaratish."
    },
    {
      "id": 1011,
      "input": "San'at va qo'l mehnatida \"recycled paper art\" (qayta ishlangan qog'oz san'ati) qanday qo'llaniladi?",
      "output": "\"Recycled paper art\" qayta ishlangan qog'ozlardan san'at asarlari yaratish."
    },
    {
      "id": 1012,
      "input": "San'at va qo'l mehnatida \"scrapbooking\" (qog'oz to'plami san'ati) qanday amalga oshiriladi?",
      "output": "\"Scrapbooking\" maxsus qog'oz va materiallar yordamida shaxsiy yodgorliklar yaratish."
    },
    {
      "id": 1013,
      "input": "San'at va qo'l mehnatida \"watercolor tattoo\" (akvarel tatuirovkasi) qanday qo'llaniladi?",
      "output": "\"Watercolor tattoo\" akvarel usulida tatuirovkalar yaratish."
    }
  ]