 [
    {
      "id": 1,
      "input": "Futbol qanday o'ynaladi?",
      "output": "Futbol o'yini ikki jamoa o'rtasida o'ynaladi, har bir jamoada 11 o'yinchi bo'ladi. Maqsad — to'pni raqibning darvozasiga urib gol kiritish."
    },
    {
      "id": 2,
      "input": "Eng ko'p gol urgan futbolchi kim?",
      "output": "Hozirgi kunda eng ko'p gol urgan futbolchi Cristiano Ronaldo. Uning gol soni 900 dan ortiq."
    },
    {
      "id": 3,
      "input": "Basketbol o'yinida nechta o'yinchi bo'ladi?",
      "output": "Basketbol jamoasi 5 o'yinchidan iborat bo'ladi. Jamoalar raqibning basketlariga to'p kiritishga harakat qiladi."
    },
    {
      "id": 4,
      "input": "Tennisda qanday hisoblash tartibi mavjud?",
      "output": "Tennisda o'yinchilar setlar orqali raqobatlashadi. Har bir setda 6 g'alaba nuqtasi bo'lishi kerak, lekin agar 6-6 bo'lsa, tie-break oynanadi."
    },
    {
      "id": 5,
      "input": "Eng tez yuguruvchi odam kim?",
      "output": "Eng tez yuguruvchi odam — Usain Bolt. U 100 metrni 9.58 soniyada yugurib o'tgan."
    },
    {
      "id": 6,
      "input": "Futbolda penalty qanday beriladi?",
      "output": "Penalty jarimasi to'pi darvoza oldida, o'yinchi tomonidan faqat bitta zarba bilan amalga oshiriladi. Boshqa o'yinchilar aralashmaydi."
    },
    {
      "id": 7,
      "input": "Olmpiya o'yinlarida nechta sport turi mavjud?",
      "output": "2024-yilda Parijda o'tadigan Olimpiya o'yinlarida 32 ta sport turi bo'ladi."
    },
    {
      "id": 8,
      "input": "Hokkeyda qancha o'yinchi bo'ladi?",
      "output": "Hokkey jamoasi 6 o'yinchidan iborat bo'ladi: 5 ta polozhok va 1 ta darvozabon."
    },
    {
      "id": 9,
      "input": "Eng yuqori tezlik bilan yuguruvchi sport turi qanday?",
      "output": "Yengil atletikadagi \"100 metr yugurish\" eng tez yuguruvchi sport turi hisoblanadi."
    },
    {
      "id": 10,
      "input": "Futbolning qoidalari qanday?",
      "output": "Futbolda asosiy qoidalar: o'yinchilar to'pni faqat oyoq bilan boshqarishadi, qo'l bilan tepkilash mumkin emas (darvozabon bundan mustasno)."
    },
    {
      "id": 11,
      "input": "Tennisda servis qanday bajariladi?",
      "output": "Tennisda servis o'yinchi tomonidan yuqoriga uloqtirilgan to'pga zarba berish bilan boshlanadi. To'p raqibning maydoniga tushishi kerak."
    },
    {
      "id": 12,
      "input": "Futbol o'yinida qancha vaqt o'ynaladi?",
      "output": "Futbol o'yini 90 daqiqadan iborat bo'lib, u ikki 45 daqiqalik bo'limga ajratiladi. Har bir bo'limda 15 daqiqalik tanaffus bo'ladi."
    },
    {
      "id": 13,
      "input": "Basketbolda nechta ochko beriladi?",
      "output": "Basketbolda 2 ochko yoki 3 ochko va 1 ochko berilishi mumkin. 3 ochko belgilangan maydonchadan tashlangan zarbadan olinadi."
    },
    {
      "id": 14,
      "input": "Skiyda qanday asosiy usullar mavjud?",
      "output": "Skiyda asosiy usullar: parallel, havo va slalom texnikalari. Har biri o'ziga xos o'zgarishlar bilan bajariladi."
    },
    {
      "id": 15,
      "input": "Formula 1 poygalarida qaysi jamoalar ishtirok etadi?",
      "output": "Formula 1 poygalarida Mercedes, Ferrari, Red Bull va boshqa yirik jamoalar qatnashadi. Har bir jamoa o'z maxsus poyga mashinalariga ega."
    },
    {
      "id": 16,
      "input": "Futbolda qanday ofsayd holati mavjud?",
      "output": "Ofsayd holati o'yinchi to'pni olish paytida raqibning darvozasiga eng yaqin bo'lsa, uni qo'lga kiritolmaydi. Bunda himoyachi bo'lishi kerak."
    },
    {
      "id": 17,
      "input": "Badminton o'yinida qancha o'yinchi bo'ladi?",
      "output": "Badminton o'yinida ikki jamoa bo'ladi: birinchi o'yinchi va ikkinchi o'yinchi, shuningdek, 2 kishilik jamoa o'yinlari ham mavjud."
    },
    {
      "id": 18,
      "input": "Yengil atletikada eng mashhur yugurish masofalari qanday?",
      "output": "Yengil atletikada eng mashhur masofalar: 100m, 200m, 400m, 800m, 1500m, va 5000m. Har biri o'ziga xos yo'nalish va taktikaga ega."
    },
    {
      "id": 19,
      "input": "Futboldagi \"hat-trick\" nima?",
      "output": "Hat-trick — bu bir o'yinda bir futbolchining uchta gol urishidir. Bu o'yinda juda katta yutuq hisoblanadi."
    },
    {
      "id": 20,
      "input": "Hokkeyda qanday maydon o'lchamlari mavjud?",
      "output": "Hokkey maydoni 60 metr uzunlikda va 30 metr kenglikda bo'ladi. Darvozalar orasidagi masofa 22 metr."
    },
    {
      "id": 21,
      "input": "Futbolni qachon va kim yaratgan?",
      "output": "Futbol 19-asrning boshlarida Angliyada paydo bo'ldi. 1863-yilda Angliya Futbol Assotsiatsiyasi tashkil etildi."
    },
    {
      "id": 22,
      "input": "Qaysi sportda \"slam dunk\" amalga oshiriladi?",
      "output": "\"Slam dunk\" basketbol o'yinida amalga oshiriladi. Bu yuqoriga sakrab, to'pni raqibning basketiga kuch bilan tashlash usuli."
    },
    {
      "id": 23,
      "input": "Futboldagi eng mashhur turnir qaysi?",
      "output": "Futbolning eng mashhur turniri — FIFA Jahon Chempionati. U har 4 yilda bir marta o'tkaziladi va dunyoning eng yaxshi jamoalari ishtirok etadi."
    },
    {
      "id": 24,
      "input": "Regbi o'yinida qancha o'yinchi bo'ladi?",
      "output": "Regbi o'yinida har bir jamoada 15 o'yinchi bo'ladi. Bu sport jismoniy jihatdan og'ir bo'lib, kuch va tezlikni talab qiladi."
    },
    {
      "id": 25,
      "input": "Futbolning eng uzun va eng qisqa o'yinlari qaysi?",
      "output": "Eng uzun futbol o'yini 90 daqiqa davom etadi. Penaltidan keyin o'yin qo'shimcha 30 daqiqaga uzaytirilishi mumkin."
    },
    {
      "id": 26,
      "input": "Tennisda tie-break nima?",
      "output": "Tie-break — bu setdagi 6-6 hisobidagi durangni hal qilish uchun o'tkaziladigan maxsus qoidalar bilan o'yin. Yirik g'alaba nuqtalari kerak bo'ladi."
    },
    {
      "id": 27,
      "input": "Karate sportida qanday tasmalar mavjud?",
      "output": "Karate sportida qora, qizil, ko'k, yashil, sariq va boshqa tasmalar mavjud bo'lib, ular o'qish darajasini bildiradi."
    },
    {
      "id": 28,
      "input": "Futbol tarixida eng ko'p gol urgan jamoa qaysi?",
      "output": "Futbol tarixida eng ko'p gol urgan jamoa Brazil bo'lib, ular 5 marta Jahon Chempionatini yutgan."
    },
    {
      "id": 29,
      "input": "Basketbolda \"alley-oop\" nima?",
      "output": "\"Alley-oop\" — bu o'yinchi to'pi yuqoriga tashlab, ikkinchi o'yinchi uni havo orqali ushlab, darvozaga tashlaydi."
    },
    {
      "id": 30,
      "input": "Futbolning eng yuqori darajadagi turniri nima?",
      "output": "Futbolning eng yuqori darajadagi turniri FIFA Jahon Chempionati hisoblanadi. Bu 4 yilda bir marta o'tkaziladi."
    },
    {
      "id": 31,
      "input": "Olimpiya o'yinlarida eng mashhur sport turlari qanday?",
      "output": "Olimpiya o'yinlarida eng mashhur sport turlari: yengil atletika, suzish, gimnastika, basketbol va futbol hisoblanadi."
    },
    {
      "id": 32,
      "input": "Hokkeyda qancha period bo'ladi?",
      "output": "Hokkeyda o'yin uchta periodga bo'linadi, har biri 20 daqiqa davom etadi. O'yin davomida har ikki jamoa bir-biriga qarshi kurashadi."
    },
    {
      "id": 33,
      "input": "Futbolda qancha taym-out (tanaffus) mavjud?",
      "output": "Futbolda o'yinchilarga har bir bo'limdan faqat bitta taym-out beriladi, lekin murabbiylar uchun vaqtni to'xtatish imkoniyati mavjud."
    },
    {
      "id": 34,
      "input": "Aql o'yinlarida qanday mashhur sportlar mavjud?",
      "output": "Aql o'yinlarida shaxmat, shashka, Go va boshqa turdagi murakkab o'yinlar mavjud. Bu o'yinlar strategiya va mantiqni rivojlantirishga yordam beradi."
    },
    {
      "id": 35,
      "input": "Qaysi sportda \"knockout\" amalga oshiriladi?",
      "output": "\"Knockout\" bokschilar o'rtasidagi jangda bir o'yinchining raqibini nokautga tushirib g'alaba qozonishi bilan amalga oshiriladi."
    },
    {
      "id": 36,
      "input": "Baseballda uchta out qanday bo'ladi?",
      "output": "Baseballda uchta out jamoaning himoya qilish paytida bo'ladi: to'pni qo'lga olish, yuguruvchini ushlash yoki xatolarni tuzatish orqali."
    },
    {
      "id": 37,
      "input": "Billiardda to'plar qanday ketma-ketlikda zarba beriladi?",
      "output": "Billiardda to'plar ketma-ket tartibda zarba beriladi: boshida oq to'p bilan boshlanadi, keyin raqamli to'plar yoki rangli to'plar zarba beriladi."
    },
    {
      "id": 38,
      "input": "Futbolning eng katta turniri qachon bo'ladi?",
      "output": "Futbolning eng katta turniri FIFA Jahon Chempionati bo'lib, u har 4 yilda bir marta o'tkaziladi va dunyoning eng yaxshi jamoalari qatnashadi."
    },
    {
      "id": 39,
      "input": "Qaysi sportda \"birdie\" atamasi ishlatiladi?",
      "output": "\"Birdie\" golfda ishlatiladigan atama bo'lib, bu to'pni belgilangan teshikka kerakli miqdordagi urishdan bir zarba kam kiritish holatini bildiradi."
    },
    {
      "id": 40,
      "input": "Futbol o'yinida qancha o'yinchi bo'ladi?",
      "output": "Futbol jamoasi 11 o'yinchidan iborat bo'ladi, shu jumladan, darvozabon hamda polozhoklar."
    },
    {
      "id": 41,
      "input": "Tennisda qanday turnirlar o'tkaziladi?",
      "output": "Tennisda Grand Slam turnirlari: Avstraliya Ochiq, Frantsiya Ochiq, Vimbldon, va AQSh Ochiq kabi yirik turnirlar o'tkaziladi."
    },
    {
      "id": 42,
      "input": "Kriketda nechta o'yinchi bo'ladi?",
      "output": "Kriket jamoasida 11 o'yinchi bo'ladi."
    },
    {
      "id": 43,
      "input": "Suv polosi qanday o'ynaladi?",
      "output": "Suv polosi o'yinida har ikki jamoa suvda o'ynaydi va raqib darvozasiga to'pni tashlashga harakat qiladi. O'yinda 7 ta o'yinchi bo'ladi."
    },
    {
      "id": 44,
      "input": "Futbolda \"korner\" qanday beriladi?",
      "output": "Korner — bu raqib jamoa himoyasida to'pni chetga chiqarganidan keyin hujumchi jamoaga beriladigan zarba bo'lib, to'pni darvoza burchagidan urish kerak."
    },
    {
      "id": 45,
      "input": "Qaysi sportda \"free kick\" ishlatiladi?",
      "output": "\"Free kick\" — bu futbolda, raqibning qonunbuzarliklaridan keyin beriladigan jarima zarbasidir. To'p to'g'ridan-to'g'ri darvozaga yo'naltiriladi."
    },
    {
      "id": 46,
      "input": "Tennisda \"double fault\" nima?",
      "output": "\"Double fault\" — bu servisni ikki marta to'g'ri bajarmaslik holatidir. Bunda o'yinchi ikkinchi zarbani ham xato qilsa, u nuqta yo'qotiladi."
    },
    {
      "id": 47,
      "input": "Qaysi sportda \"ace\" termologi ishlatiladi?",
      "output": "\"Ace\" — bu tennisda o'yinchi servisni raqib qabul qila olmasdan bevosita gol kiritishi. Bunday holat nuqta olishning eng yuksak darajasi hisoblanadi."
    },
    {
      "id": 48,
      "input": "Futbol o'yinida qancha gol urish mumkin?",
      "output": "Futbol o'yinida gol soni cheklanmagan, ammo eng ko'p gol urilgan o'yinlarda 10+ gol ko'rilishi mumkin."
    },
    {
      "id": 49,
      "input": "Formula 1 mashinalari necha tezlikka chiqadi?",
      "output": "Formula 1 mashinalari 370 km/soatgacha tezlikka chiqishi mumkin, bu ularni dunyodagi eng tez avtomobillaridan biriga aylantiradi."
    },
    {
      "id": 50,
      "input": "Shaxmatda \"checkmate\" nima?",
      "output": "\"Checkmate\" — bu shaxmat o'yinida raqibning shohi xavf ostida bo'lib, uni himoya qilishning imkoni bo'lmagan holatni anglatadi."
    },
    {
      "id": 51,
      "input": "Yengil atletikada \"marafon\" masofasi qancha?",
      "output": "Marafon masofasi 42.195 kilometrni tashkil qiladi. Bu eng uzoq yugurish musobaqalaridan biri hisoblanadi."
    },
    {
      "id": 52,
      "input": "Hokkeyda qancha vaqt davom etadi?",
      "output": "Hokkey o'yini 60 daqiqa davom etadi, 3 ta 20 daqiqalik periodlarga bo'linadi. Agar o'yin durang bo'lsa, qo'shimcha vaqt o'ynaladi."
    },
    {
      "id": 53,
      "input": "Badmintonda \"clear\" nima?",
      "output": "Badmintonda \"clear\" — bu o'yinchining to'pi raqibning orqa chizig'iga yo'naltirilgan uzoq zarbasi."
    },
    {
      "id": 54,
      "input": "Futbol o'yinida \"offside\" qanday belgilanadi?",
      "output": "Offside — o'yinchi to'pni qabul qilganda raqibning darvozasiga eng yaqin bo'lsa, u \"offside\" holatiga tushadi."
    },
    {
      "id": 55,
      "input": "Amerikan futbolida \"touchdown\" nima?",
      "output": "\"Touchdown\" — bu amerikan futbolida to'pni raqibning darvozasiga olib kirish bilan erishiladigan 6 ochkodir."
    },
    {
      "id": 56,
      "input": "Qaysi sportda \"puck\" atamasi ishlatiladi?",
      "output": "\"Puck\" — bu hokkeyda ishlatiladigan, muz ustida sirpanadigan maxsus to'pdir."
    },
    {
      "id": 57,
      "input": "Qaysi sportda \"set\" ishlatiladi?",
      "output": "\"Set\" — tennisda ishlatiladigan atama bo'lib, u belgilangan ballarni yig'ish orqali o'yinchiga g'alaba keltiradi."
    },
    {
      "id": 58,
      "input": "Rugbyda nechta o'yinchi bo'ladi?",
      "output": "Rugbyda har bir jamoada 15 o'yinchi bo'ladi, bu sport jismoniy kuch va tezlikni talab qiladi."
    },
    {
      "id": 59,
      "input": "Futbol tarixidagi eng ko'p gol urgan futbolchi kim?",
      "output": "Eng ko'p gol urgan futbolchi — Cristiano Ronaldo. U 800 dan ortiq gol urgan."
    },
    {
      "id": 60,
      "input": "Badmintonda qanday servislar mavjud?",
      "output": "Badmintonda yuqori va past servislar mavjud. Yuqori servisda to'p yuqoriga tashlanadi, past servisda esa to'p pastdan yuboriladi."
    },
    {
      "id": 61,
      "input": "Boksda \"TKO\" nima?",
      "output": "\"TKO\" (technical knockout) — bu boksda jangchini shikastlanishi yoki charchashi sababli jangni davom ettirishga qodir bo'lmagan holatdir."
    },
    {
      "id": 62,
      "input": "Qaysi sportda \"slam dunk\" ishlatiladi?",
      "output": "\"Slam dunk\" — basketbol o'yinida yuqoriga sakrab, to'pni kuch bilan basketga tashlash usuli hisoblanadi."
    },
    {
      "id": 63,
      "input": "Futbol o'yinida qancha taym-out mavjud?",
      "output": "Futbolda o'yinchi uchun bitta taym-out mavjud, ammo murabbiylar o'yin vaqtida strategik tanaffuslar qilishlari mumkin."
    },
    {
      "id": 64,
      "input": "Qaysi sportda \"birdie\" atamasi ishlatiladi?",
      "output": "\"Birdie\" golfda ishlatiladigan atama bo'lib, to'pni belgilangan teshikka bir zarba kam kiritishni anglatadi."
    },
    {
      "id": 65,
      "input": "Yengil atletikada 100 metrlik yugurish qanday o'lchanadi?",
      "output": "100 metrlik yugurish poygasi eng qisqa va tezkor yugurish hisoblanadi, u 10-11 soniya davom etadi."
    },
    {
      "id": 66,
      "input": "Futbol o'yinida \"yellow card\" va \"red card\" nima?",
      "output": "\"Yellow card\" — bu ogohlantirish kartochkasi, \"Red card\" esa jiddiy qoidabuzarlik uchun jamoaning o'yinchisini maydondan chiqarib yuboradi."
    },
    {
      "id": 67,
      "input": "Billiardda qanday turdagi o'yinlar mavjud?",
      "output": "Billiardda 8 to'p, 9 to'p, snooker va boshqa turdagi o'yinlar mavjud. Har biri o'ziga xos qoidalar bilan o'ynaladi."
    },
    {
      "id": 68,
      "input": "Amerikan futbolida \"safety\" nima?",
      "output": "\"Safety\" — bu amerikan futbolida raqib jamoa o'yinchisini o'z maydonida to'xtatish va unga 2 ochko olish imkoniyatini yaratishdir."
    },
    {
      "id": 69,
      "input": "Tennisda tie-break qanday ishlaydi?",
      "output": "Tennisda tie-break, setdagi durangni hal qilish uchun o'yinchilarga 7 ochkoga yetguncha raqobatlashishga imkon beradi."
    },
    {
      "id": 70,
      "input": "Qaysi sportda \"hat-trick\" atamasi ishlatiladi?",
      "output": "\"Hat-trick\" — bu futbol va hokkeyda bir o'yinda uchta gol urishni anglatadi."
    },
    {
      "id": 71,
      "input": "Futbol o'yinida \"penalty shootout\" nima?",
      "output": "Penalty shootout — bu futbol o'yinidagi durang holatidan keyin g'alabani aniqlash uchun o'yinchilarning navbatma-navbat darvoza tomon zarba berishi."
    },
    {
      "id": 72,
      "input": "Qaysi sportda \"caddie\" ishlatiladi?",
      "output": "\"Caddie\" — bu golfda to'pni tashish va o'yinchi uchun maslahat beradigan shaxsdir."
    },
    {
      "id": 73,
      "input": "Futbol o'yinida \"throw-in\" nima?",
      "output": "Throw-in — bu futbol o'yinida chetda to'pni tashlash bilan o'yinni qayta boshlash."
    },
    {
      "id": 74,
      "input": "Amerikan futbolida \"interception\" nima?",
      "output": "Interception — bu to'pni raqib jamoasining pasini ushlash va uni o'z jamoasi uchun foydali holatga aylantirishdir."
    },
    {
      "id": 75,
      "input": "Boksda \"KO\" nima?",
      "output": "\"KO\" (knockout) — bu boksda o'yinchining raqibni nokautga tushirishi, ya'ni raqib yerdan turish imkoniyatini yo'qotadi."
    },
    {
      "id": 76,
      "input": "Yengil atletikada 400 metr masofasi qanday o'lchanadi?",
      "output": "400 metr masofasi birinchi yirik masofali poyga hisoblanadi va"
    },
    {
      "id": 77,
      "input": "Futbol o'yinida \"nutmegging\" nima?",
      "output": "\"Nutmegging\" — bu futbol o'yinchisi raqibni to'pi bilan oyoqlarining orasidan o'zgartirib, o'ynash usulidir. Bu juda ko'pincha o'ziga xos harakat sifatida ishlatiladi."
    },
    {
      "id": 78,
      "input": "Badminton o'yinida to'p nima deb ataladi?",
      "output": "Badminton o'yinida to'p \"shuttlecock\" deb ataladi. Bu maxsus qurilgan, uchish xususiyatiga ega bo'lgan to'pdir."
    },
    {
      "id": 79,
      "input": "Futbol o'yinida \"assist\" nima?",
      "output": "\"Assist\" — bu futbol o'yinchisi to'pni gol urgan o'yinchiga to'g'ridan-to'g'ri uzatgan zarba yoki harakatdir."
    },
    {
      "id": 80,
      "input": "Formula 1 mashinalarida qancha g'ildirak bo'ladi?",
      "output": "Formula 1 mashinalarida 4 ta g'ildirak bo'ladi, ulardan har biri aerodinamik jihatdan maxsus dizaynda ishlab chiqilgan."
    },
    {
      "id": 81,
      "input": "Tennisda \"love\" nima?",
      "output": "\"Love\" — bu tennisda ballarni hisoblashda ishlatiladigan atama bo'lib, 0 balli holatni bildiradi."
    },
    {
      "id": 82,
      "input": "Suv polosi o'yinida qancha o'yinchi maydonda bo'ladi?",
      "output": "Suv polosi o'yinida har bir jamoada 7 o'yinchi bo'ladi, shu jumladan darvozabon ham."
    },
    {
      "id": 83,
      "input": "Boksda \"uppercut\" nima?",
      "output": "\"Uppercut\" — bu bokschining yuqoriga qarab tashlanadigan kuchli zarbasidir, u raqibni yuqoriga ko'tarish maqsadida ishlatiladi."
    },
    {
      "id": 84,
      "input": "Amerikan futbolida \"quarterback\" kim?",
      "output": "Quarterback — bu amerikan futbolida jamoaning asosiy o'yinchi bo'lib, pas berish, to'pni boshqarish va hujumni tashkil etishdan mas'uldir."
    },
    {
      "id": 85,
      "input": "Gimnastikada \"floor routine\" nima?",
      "output": "\"Floor routine\" — bu gimnastikada o'yinchi er yuzasida turli akrobatik harakatlar va raqsni birlashtirgan ko'nikma to'plamidir."
    },
    {
      "id": 86,
      "input": "Futbol o'yinida \"header\" qanday amalga oshiriladi?",
      "output": "\"Header\" — bu futbol o'yinchisi bosh bilan to'pni yo'naltirish harakatidir, odatda uzatish yoki gol urish uchun ishlatiladi."
    },
    {
      "id": 87,
      "input": "Hokkeyda \"power play\" nima?",
      "output": "\"Power play\" — bu hokkeyda raqib jamoasining bir o'yinchisi diskvalifikatsiya qilinishi holatida jamoaga beriladigan imtiyozli davrdir."
    },
    {
      "id": 88,
      "input": "Basketbol o'yinida \"pick and roll\" nima?",
      "output": "\"Pick and roll\" — bu basketbolda o'yinchi himoyachini aldash va o'ziga yo'naltirilgan to'pni olish usuli hisoblanadi."
    },
    {
      "id": 89,
      "input": "Yengil atletikada \"hurdles\" nima?",
      "output": "\"Hurdles\" — bu yengil atletika musobaqalarida to'siqlarni (maxsus to'siqni) yengib o'tish uchun yugurish qoidasi bo'lib, bu masofa poygasi."
    },
    {
      "id": 90,
      "input": "Billiardda \"break\" nima?",
      "output": "\"Break\" — bu billiard o'yinida to'plarni dastlabki zarba bilan yoyishdir. Bu zarba birinchi boshlanish nuqtasi hisoblanadi."
    },
    {
      "id": 91,
      "input": "Futbol o'yinida \"own goal\" nima?",
      "output": "\"Own goal\" — bu futbol o'yinchisi noto'g'ri tarzda o'z jamoasining darvozasiga gol urgan holatni bildiradi."
    },
    {
      "id": 92,
      "input": "Qaysi sportda \"downward dog\" pozasi ishlatiladi?",
      "output": "\"Downward dog\" pozasi yoga mashqida ishlatiladi va bu pozaning maqsadi tananing chap va o'ng qismlarini uzatish va kuchaytirishdir."
    },
    {
      "id": 93,
      "input": "Tennisda \"backhand\" nima?",
      "output": "\"Backhand\" — bu tennisda to'pni o'ng qo'l bilan emas, balki chap qo'l bilan zarba berish usulidir."
    },
    {
      "id": 94,
      "input": "Futbol o'yinida \"free kick\" qanday beriladi?",
      "output": "\"Free kick\" — bu futbol o'yinchisiga, raqibning qoidabuzarligi natijasida, to'pi bilan darvoza tomon belgilangan joydan zarba berish huquqi beriladi."
    },
    {
      "id": 95,
      "input": "Amerikan futbolida \"field goal\" nima?",
      "output": "\"Field goal\" — bu amerikan futbolida darvoza orqasiga to'pni tushirish orqali 3 ochko olishdir."
    },
    {
      "id": 96,
      "input": "Yengil atletikada \"discus\" nima?",
      "output": "\"Discus\" — bu yengil atletikada maxsus metall diskni masofaga uloqtirish musobaqasidir."
    },
    {
      "id": 97,
      "input": "Badminton o'yinida qancha set bo'ladi?",
      "output": "Badminton o'yinida 3 ta set bo'ladi, har bir set 21 ochkoga qadar davom etadi."
    },
    {
      "id": 98,
      "input": "Qaysi sportda \"sprint\" atamasi ishlatiladi?",
      "output": "\"Sprint\" — bu yengil atletikada qisqa masofani maksimal tezlikda yugurishdir."
    },
    {
      "id": 99,
      "input": "Futbol o'yinida \"yellow card\" nima?",
      "output": "\"Yellow card\" — bu futbol o'yinchisini ogohlantirish uchun beriladigan kartochkadir. Agar ikkinchi sariq kartochka ko'rsatilsa, o'yinchi maydondan chiqariladi."
    },
    {
      "id": 100,
      "input": "Tennisda \"rally\" nima?",
      "output": "\"Rally\" — bu tennisda o'yinchilarning to'pni bir-biriga uzatib, uzoq vaqt davomida raqobatlashishini bildiradi."
    },
    {
      "id": 101,
      "input": "Golf o'yinida \"par\" nima?",
      "output": "\"Par\" — bu golf o'yinida belgilangan teshikka o'rtacha urishlar sonini anglatadi. To'pi bu masofani o'rtacha zarbalar bilan urish kerak."
    },
    {
      "id": 102,
      "input": "Basketbol o'yinida \"alley-oop\" nima?",
      "output": "\"Alley-oop\" — bu basketbol o'yinchisi yuqoriga to'pni tashlab, ikkinchi o'yinchi uni havo orqali ushlab, darvozaga tashlash usulidir."
    },
    {
      "id": 103,
      "input": "Amerikan futbolida \"touchdown\" qanday amalga oshiriladi?",
      "output": "\"Touchdown\" — bu to'pni raqibning darvozasiga olib kirish bilan erishiladigan 6 ochkoga teng holatdir."
    },
    {
      "id": 104,
      "input": "Yengil atletikada \"shot put\" nima?",
      "output": "\"Shot put\" — bu yengil atletikada og'ir metall sharni belgilangan masofaga uloqtirish musobaqasidir."
    },
    {
      "id": 105,
      "input": "Hokkeyda \"icing\" nima?",
      "output": "\"Icing\" — bu hokkeyda o'yinchi to'pni himoya zonasi ortidan uzoqqa zarba berishi, ammo u to'pi darvozadan o'tib ketishi hisoblanadi."
    },
    {
      "id": 106,
      "input": "Futbol o'yinida \"substitution\" nima?",
      "output": "\"Substitution\" — bu futbol o'yinchisini o'yin davomida maydondan olib chiqib, uning o'rniga boshqa o'yinchi qo'yish jarayonidir."
    },
    {
      "id": 107,
      "input": "Boksda \"knockout\" nima?",
      "output": "\"Knockout\" — bu boksda raqibni yerdan turishga imkoni bo'lmaydigan darajada shikastlantirish holatidir."
    },
    {
      "id": 108,
      "input": "Futbol o'yinida \"corner kick\" qanday beriladi?",
      "output": "\"Corner kick\" — bu raqib to'pi chetga chiqishi natijasida o'yinchiga beriladigan zarba bo'lib, to'p darvoza burchagidan uriladi."
    },
    {
      "id": 109,
      "input": "Sportni faqat dam olish uchunmi o'ynaysiz?",
      "output": "Yo'q, men sportni nafaqat dam olish uchun, balki sog'liqni saqlash va o'z jismoniy holatimni yaxshilash uchun ham o'ynayman."
    },
    {
      "id": 110,
      "input": "Sizningcha, sportni boshlash uchun qanday yosh eng yaxshi?",
      "output": "Har qanday yoshda boshlash mumkin, lekin yoshlar uchun faoliyatni boshlashda juda erta emas."
    },
    {
      "id": 111,
      "input": "Tennisni o'ynashni qanchalik tez o'rganish mumkin?",
      "output": "Tennisni o'rganish uchun bir necha hafta yoki oy kerak bo'lishi mumkin, lekin muntazam mashq qilish kerak."
    },
    {
      "id": 112,
      "input": "Futbolni qaysi pozitsiyada o'ynashni yoqtirasiz?",
      "output": "Men hujumchi yoki yarim himoyachi pozitsiyasida o'ynashni yoqtiraman, chunki bu ko'proq faoliyatni talab qiladi."
    },
    {
      "id": 113,
      "input": "Sportni o'ynashda eng sevimli usulingiz nima?",
      "output": "Men sportni o'ynashda do'stlarim bilan birga jamoa bo'lib o'ynashni yoqtiraman, bu juda qiziqarli va ruhni ko'taradi."
    },
    {
      "id": 114,
      "input": "Siz sportni qo'shimcha sifatida yoki asosiy mashg'ulot sifatida qilasiz?",
      "output": "Men sportni qo'shimcha sifatida qilaman, lekin doimiy ravishda shug'ullanishga harakat qilaman."
    },
    {
      "id": 115,
      "input": "Sizningcha, sportni qaysi yoshda boshlash eng foydali?",
      "output": "Menimcha, sportni bolalikdan boshlash juda foydali, chunki bu jismoniy rivojlanishga yordam beradi."
    },
    {
      "id": 116,
      "input": "Sizni eng ko'p qanday sport qiziqtiradi?",
      "output": "Meni eng ko'p futbol va basketbol qiziqtiradi, chunki ular dinamik va jamoaviy sportlar."
    },
    {
      "id": 117,
      "input": "Siz sportni asosan qanday joyda o'ynaysiz?",
      "output": "Men ko'pincha ochiq havoda sport o'ynashni yoqtiraman, ayniqsa, futbol va basketbolni."
    },
    {
      "id": 118,
      "input": "Sportni o'ynashda eng qiyin narsa nima?",
      "output": "Sportni o'ynashda eng qiyin narsa — bu jismoniy kuchni boshqarish va uzluksiz o'ynashni davom ettirish."
    },
    {
      "id": 119,
      "input": "O'zingizni sportda qanday yaxshilamoqchisiz?",
      "output": "Men o'z tezligimni va chidamliligimni oshirishni xohlayman, shuningdek, texnikani rivojlantirishga e'tibor qarataman."
    },
    {
      "id": 120,
      "input": "Sizga sportni qanday joyda o'ynash yoqadi?",
      "output": "Men sportni ochiq havoda o'ynashni yoqtiraman, lekin sport zalida ham shug'ullanishni yaxshi ko'raman."
    },
    {
      "id": 121,
      "input": "Qaysi sportni o'ynashni xohlaysiz, lekin hali sinab ko'rmadingiz?",
      "output": "Men velosiped sportini va alpinizmni sinab ko'rishni xohlayman, bu juda qiziqarli bo'lishi kerak."
    },
    {
      "id": 122,
      "input": "Siz sportni do'stlar bilan o'ynaysizmi?",
      "output": "Ha, men sportni do'stlarim bilan o'ynashni yaxshi ko'raman, bu yanada qiziqarli va jamoaviy ruhni oshiradi."
    },
    {
      "id": 123,
      "input": "Qaysi sportni tomosha qilishni yaxshi ko'rasiz?",
      "output": "Men futbolni tomosha qilishni yaxshi ko'raman, lekin tennis va basketbol ham qiziqarli."
    },
    {
      "id": 124,
      "input": "Sportni qanday rag'batlantirgan bo'lar edingiz?",
      "output": "Men sportni do'stlarimni va oilamni rag'batlantirib, sportni sevishlariga yordam berish orqali rag'batlantiraman."
    },
    {
      "id": 125,
      "input": "Futbolni o'ynashda sizga kim yordam beradi?",
      "output": "Futbolni o'ynashda ko'pincha do'stlarim yordam beradi, ular har doim yangi harakatlarni o'rgatishga tayyor."
    },
    {
      "id": 126,
      "input": "Sizga sportni boshlash qanchalik oson bo'ldi?",
      "output": "Sportni boshlash juda oson bo'ldi, chunki men do'stlarim bilan birga boshladim va ular menga yordam berishdi."
    },
    {
      "id": 127,
      "input": "Sportni qaysi davrda eng yaxshi o'ynaysiz?",
      "output": "Men sportni asosan yoz faslida, ochiq havoda yaxshi o'ynayman."
    },
    {
      "id": 128,
      "input": "Futbolni o'ynashni boshlash uchun qanday maslahat bera olasiz?",
      "output": "Futbolni boshlash uchun, avvalo, asosiy qoidalarni bilish va yaxshi futbol poyabzali olish zarur."
    },
    {
      "id": 129,
      "input": "Sportni qo'shimcha sifatida qaysi mashg'ulot bilan birga qilasiz?",
      "output": "Men sportni yoga va jismoniy mashqlar bilan birga qilaman, bu ko'proq energiya beradi."
    },
    {
      "id": 130,
      "input": "Sizningcha, jismoniy sportni boshlash uchun eng yaxshi vaqt qaysi?",
      "output": "Jismoniy sportni boshlash uchun eng yaxshi vaqt — bu ertalab, chunki ertalab sport qilish kun davomida yuqori energiya beradi."
    },
    {
      "id": 131,
      "input": "Futbol yoki tennis?",
      "output": "Men futbolni afzal ko'raman, lekin tennisni ham sinab ko'rish kerak."
    },
    {
      "id": 132,
      "input": "Siz sportni ko'proq qaysi usulda o'ynashni yoqtirasiz?",
      "output": "Men ko'proq jamoa sifatida sportni o'ynashni yoqtiraman, bu har bir o'yinchi o'zining roli va vazifasini tushunishi kerak."
    },
    {
      "id": 133,
      "input": "Sportni qanday usulda o'ynashni xohlar edingiz?",
      "output": "Men sportni ko'proq jismoniy va intellektual jihatdan rivojlantiruvchi shaklda o'ynashni xohlar edim."
    },
    {
      "id": 134,
      "input": "Tennisda boshlash uchun qanday maslahatlar bera olasiz?",
      "output": "Tennisda boshlash uchun, to'g'ri pozitsiya olish va asosan to'pni qabul qilishni o'rganish kerak."
    },
    {
      "id": 135,
      "input": "Sizningcha, sportni boshlashda eng muhim narsa nima?",
      "output": "Sportni boshlashda eng muhim narsa — bu muntazamlik va qat'iyatlilik. Birinchi bosqichda sabr-toqat kerak."
    },
    {
      "id": 136,
      "input": "Futbolni o'ynash uchun qanday maxsus jihozlar kerak?",
      "output": "Futbolni o'ynash uchun futbol poyabzali, shinjirlar va futbol to'pi kerak."
    },
    {
      "id": 137,
      "input": "Sizni sportga qiziqtirgan biror hodisa bormi?",
      "output": "Men bir safar katta futbol musobaqasini tomosha qilgan edim, bu juda qiziqarli va hayajonli bo'lgan."
    },
    {
      "id": 138,
      "input": "Qaysi sport bilan shug'ullanishni boshladingiz?",
      "output": "Men futbolni boshladim, lekin keyinchalik basketbolni ham o'ynashni boshladim."
    },
    {
      "id": 139,
      "input": "Sportni o'ynashda eng ko'p yenggan o'yiningiz qaysi?",
      "output": "Mening eng yaxshi o'yinim futbol o'yinlaridan biri edi, jamoam g'alaba qozondi va men yaxshi gol urdim."
    },
    {
      "id": 140,
      "input": "Sport bilan shug'ullanishni boshlaganingizda qiyinchilik bo'ldimi?",
      "output": "Ha, boshlashda bir oz qiyinchiliklar bo'lgan, lekin vaqt o'tgan sayin, o'zimni yaxshiladim."
    },
    {
      "id": 141,
      "input": "Sevimli sport jamoangizni nima uchun tanladingiz?",
      "output": "Men Manchester City jamoasini tanladim, chunki ular o'yinlarini juda yuqori darajada o'ynashadi."
    },
    {
      "id": 142,
      "input": "Sportni tanlashda qanday omillarni hisobga olasiz?",
      "output": "Men sportni tanlashda uning faoliyati va jismoniy foydaliligini hisobga olaman."
    },
    {
      "id": 143,
      "input": "Sizningcha, eng qiyin sport qaysi?",
      "output": "Mening fikrimcha, eng qiyin sport — bu boks, chunki u aqlni va jismoniy kuchni birlashtiradi."
    },
    {
      "id": 144,
      "input": "Yugurishni boshlash uchun qanday maslahat bera olasiz?",
      "output": "Yugurishni boshlash uchun asta-sekinlik bilan boshlang, to'g'ri poyabzal kiyish va nafas olishni o'rganish kerak."
    },
    {
      "id": 145,
      "input": "Siz uchun eng yaxshi sport uslubi qaysi?",
      "output": "Men uchun eng yaxshi sport uslubi — bu yoga, chunki u nafaqat jismoniy, balki ruhiy salomatlikni ham yaxshilaydi."
    },
    {
      "id": 146,
      "input": "Sizni sportda eng ko'p nima ilhomlantiradi?",
      "output": "Meni sportda eng ko'p ilhomlantiradigan narsa — bu maqsadlarimni amalga oshirish uchun o'zimga bo'lgan ishonch."
    },
    {
      "id": 147,
      "input": "Futbolni o'ynashda qanday texnikalarni yaxshilashni istaysiz?",
      "output": "Men to'pni boshqarish va zarbani yanada aniqlashtirishni istayman."
    },
    {
      "id": 148,
      "input": "Sizni sportda o'zgarishlar kiritishga nima ilhomlantiradi?",
      "output": "Men sportni muntazam ravishda o'zgartirib turishni yoqtiraman, bu hayajonni saqlashga yordam beradi."
    },
    {
      "id": 149,
      "input": "Sizni sportda muvaffaqiyatga erishish uchun eng muhim narsa nima?",
      "output": "Menimcha, muvaffaqiyatga erishish uchun qat'iyatlilik va sog'lom turmush tarzini saqlash eng muhimdir."
    },
    {
      "id": 150,
      "input": "Sizningcha, sportda eng muhim fazilat qaysi?",
      "output": "Eng muhim fazilat — bu ishonch, chunki ishonch o'yinda g'alaba qozonishda yordam beradi."
    },
    {
      "id": 151,
      "input": "Sportni faqat o'zingiz uchunmi o'ynaysiz?",
      "output": "Men sportni asosan jamoa bilan o'ynayman, lekin ba'zida o'zimni yaxshi his qilaman deb, yolg'iz ham o'ynashni yoqtiraman."
    },
    {
      "id": 152,
      "input": "Sizni eng ko'p qiziqtirgan sport musobaqasi qaysi?",
      "output": "Men Olimpiyadani tomosha qilishni juda yoqtiraman, chunki unda dunyoning eng yaxshi sportchilari qatnashadi."
    },
    {
      "id": 153,
      "input": "Sizningcha, sportda eng muhim yutug'larni qanday qilib qo'lga kiritish mumkin?",
      "output": "Yutug'larni olish uchun yaxshi tayyorgarlik, doimiy mashqlar va kuchli ruhiy tayyorgarlik zarur."
    },
    {
      "id": 154,
      "input": "Sizningcha, futbolni eng yaxshi o'ynaydigan jamoa qaysi?",
      "output": "Menimcha, Barcelona futbol jamoasi eng yaxshi, ular texnik va jamoaviy o'yinlarini juda mukammal bajaradi."
    },
    {
      "id": 155,
      "input": "Sizni sportda muvaffaqiyatga erishishga nima yordam beradi?",
      "output": "Muvaffaqiyatga erishish uchun doimiy mashq qilish, to'g'ri ovqatlanish va jismoniy holatni yaxshilash yordam beradi."
    },
    {
      "id": 156,
      "input": "Siz sportni qanday davom ettirgan bo'lar edingiz?",
      "output": "Men sportni muntazam ravishda davom ettirishni xohlayman, chunki bu salomatlikni saqlash va o'z imkoniyatlarimni oshirishga yordam beradi."
    },
    {
      "id": 157,
      "input": "Sizningcha, sportda eng muhim strategiya qaysi?",
      "output": "Sportda eng muhim strategiya — bu raqibni yaxshi tahlil qilish va o'z kuchli tomonlaringizni ishlatish."
    },
    {
      "id": 158,
      "input": "Siz uchun sport va dam olish orasidagi farq nima?",
      "output": "Sport mening uchun dam olishdan ko'ra faoliyat, lekin har ikkisi ham sog'liqni saqlashga yordam beradi."
    },
    {
      "id": 159,
      "input": "Futbolni tomosha qilishni qanday qiziqarli qilasiz?",
      "output": "Futbolni tomosha qilishni qiziqarli qilish uchun, do'stlar bilan birga o'yinni ko'rish va natijalarni muhokama qilishni yaxshi ko'raman."
    },
    {
      "id": 160,
      "input": "Siz sportni qanday qilib maqsadga muvofiq qilishni xohlar edingiz?",
      "output": "Men sportni maqsadga muvofiq qilishni xohlayman, ya'ni, o'zimni muntazam ravishda sinovdan o'tkazib, o'z natijalarimni kuzatishni xohlayman."
    },
    {
      "id": 161,
      "input": "Futbolni o'ynashda eng muhim qoidalar nimalar?",
      "output": "Futbolda eng muhim qoidalar — bu to'pni yaxshi boshqarish, pozitsiyani to'g'ri tanlash va jamoaviy o'yinlarni yaxshi tashkil qilish."
    },
    {
      "id": 162,
      "input": "Sizningcha, sportda shaxsiy imkoniyatlarni qanday oshirish mumkin?",
      "output": "Shaxsiy imkoniyatlarni oshirish uchun muntazam ravishda mashq qilish va o'zgarishlarga ochiq bo'lish kerak."
    },
    {
      "id": 163,
      "input": "Sizni eng ko'p qiziqtirgan sport turlaridan biri qanday?",
      "output": "Men uchun eng qiziqarli sport — bu basketbol, chunki unda tezkor qarorlar qabul qilish va jamoaviy o'yin juda muhim."
    },
    {
      "id": 164,
      "input": "Sizni sportda motivatsiya qanday usulda oshiradi?",
      "output": "Sportda motivatsiyani oshirish uchun o'z yutuqlarimni belgilab, har bir mashqni eng yaxshi natijalar bilan yakunlashga harakat qilaman."
    },
    {
      "id": 165,
      "input": "Futbolni o'ynashda qanday ruhiy tayyorgarlik kerak?",
      "output": "Futbolni o'ynashda ruhiy tayyorgarlik zarur, chunki o'yin davomida diqqatni jamlash va stressni boshqarish kerak."
    },
    {
      "id": 166,
      "input": "Sport bilan shug'ullanishda eng yaxshi vaqt qaysi?",
      "output": "Men sport bilan shug'ullanish uchun eng yaxshi vaqt — bu ertalab, chunki bu kunni faol va energiyali boshlashga yordam beradi."
    },
    {
      "id": 167,
      "input": "Tennisni o'ynashda eng qiyin qism nima?",
      "output": "Tennisni o'ynashda eng qiyin qism — bu yaxshi zarba berish va tezkor harakat qilishni o'rganish."
    },
    {
      "id": 168,
      "input": "Sizningcha, sportda eng yaxshi yordamchi kim?",
      "output": "Sportda eng yaxshi yordamchi — bu yaxshi trener, u sizning imkoniyatlaringizni to'liq aniqlab beradi."
    },
    {
      "id": 169,
      "input": "Sizni sportda qanday natijalarga erishish kutyapsiz?",
      "output": "Men sportda jismoniy holatimni yaxshilashni va yaxshiroq natijalarga erishishni kutyapman."
    },
    {
      "id": 170,
      "input": "Futbolni o'ynashda qanday motivatsiya kerak?",
      "output": "Futbolni o'ynashda motivatsiya uchun jamoaviy ruh va g'alaba istagi zarur."
    },
    {
      "id": 171,
      "input": "Siz uchun eng yaxshi sport zalida shug'ullanish shartlari qanday?",
      "output": "Eng yaxshi sport zali, keng va yaxshi jihozlangan bo'lishi kerak, shuningdek, toza va qulay muhit ham muhim."
    },
    {
      "id": 172,
      "input": "Sizningcha, jismoniy sportni boshlash uchun qanday motivatsiya kerak?",
      "output": "Jismoniy sportni boshlash uchun o'z salomatligimni yaxshilash va yaxshi natijalarga erishish uchun kuchli motivatsiya kerak."
    },
    {
      "id": 173,
      "input": "Sizni sportda muvaffaqiyatga erishishga nima yordam beradi?",
      "output": "Muvaffaqiyatga erishish uchun qat'iyatlilik, jismoniy va ruhiy tayyorgarlik, shuningdek, to'g'ri strategiya kerak."
    },
    {
      "id": 174,
      "input": "Sizni sportda ko'proq qaysi usul qiziqtiradi: individual yoki jamoaviy?",
      "output": "Men jamoaviy sportni afzal ko'raman, chunki bu birgalikda ishlash va do'stlar bilan vaqt o'tkazish imkoniyatini yaratadi."
    },
    {
      "id": 175,
      "input": "Sportni qaysi usulda mashq qilganingizda eng ko'p natijalar ko'rasiz?",
      "output": "Men ko'proq intensiv mashqlarni va intervalli treningni tanlayman, chunki ular tez natijalar beradi."
    },
    {
      "id": 176,
      "input": "Sizningcha, sportdagi eng muhim fazilat nima?",
      "output": "Sportdagi eng muhim fazilat — bu sabr-toqat, chunki muvaffaqiyatga erishish uchun vaqt va kuch talab etiladi."
    },
    {
      "id": 177,
      "input": "Yaxshi futbolchi bo'lish uchun nima kerak?",
      "output": "Yaxshi futbolchi bo'lish uchun tezkor fikrlash, yaxshi jismoniy holat, va jamoaviy ruh zarur."
    },
    {
      "id": 178,
      "input": "Futbolni o'ynashda eng ko'p nimani o'rgandiniz?",
      "output": "Futbolni o'ynashda men jamoaviy ishlash va to'pni boshqarish texnikasini o'rgandim."
    },
    {
      "id": 179,
      "input": "Sizni sportda eng ko'p nimalar ilhomlantiradi?",
      "output": "Men sportda o'zgarishlar va yangi yutuqlarni ko'rishni, shuningdek, har bir o'yinda yangi maqsadlar qo'yishni yoqtiraman."
    },
    {
      "id": 180,
      "input": "Siz uchun sport va dam olish orasidagi farq nima?",
      "output": "Sport — bu faoliyat, energiya sarflanadigan va ruhni ko'taradigan bir ish, dam olish esa tana va ongni tiklashga yordam beradi."
    },
    {
      "id": 181,
      "input": "Sizni sportda o'zgarishlarni qanday boshqarish kerak deb o'ylaysiz?",
      "output": "Sportda o'zgarishlarni sekin va izchil boshqarish kerak, yangi texnikalar va usullarni sinab ko'rish ham foydalidir."
    },
    {
      "id": 182,
      "input": "Futbolni o'ynashda sizning eng yaxshi xususiyatlaringiz nima?",
      "output": "Men futbolni o'ynashda tezkor fikrlash, yaxshi zarba berish va jamoaviy ruhni yaxshi ushlab turishni yaxshi ko'raman."
    },
    {
      "id": 183,
      "input": "Sportni qaysi vaqtda o'ynash eng yaxshi, sizcha?",
      "output": "Men sportni ertalab boshlashni yaxshi ko'raman, chunki bu kunni energiya bilan boshlashga yordam beradi."
    },
    {
      "id": 184,
      "input": "Sizningcha, sportda ruhiy tayyorgarlik qanday o'rin tutadi?",
      "output": "Ruhiy tayyorgarlik sportda juda muhim, chunki stressni boshqarish va diqqatni jamlashga yordam beradi."
    },
    {
      "id": 185,
      "input": "Futbolni yaxshi o'ynash uchun qanday poyabzal kerak?",
      "output": "Futbolni yaxshi o'ynash uchun to'g'ri futbol poyabzali, oyoqning shakliga mos va yaxshi ushlovchi bo'lishi kerak."
    },
    {
      "id": 186,
      "input": "Sportni faqat musobaqalarda emas, balki kundalik hayotda ham qayerda o'ynaysiz?",
      "output": "Men sportni ko'pincha ochiq havoda, parkda yoki sport maydonchalarida o'ynayman."
    },
    {
      "id": 187,
      "input": "Sizningcha, sportda muvaffaqiyatga erishish uchun qancha vaqt kerak?",
      "output": "Sportda muvaffaqiyatga erishish uchun vaqt va mehnat talab etiladi, lekin har bir insonning rivojlanish tezligi turlicha."
    },
    {
      "id": 188,
      "input": "Sizni sportda qanday qiyinchiliklar kutmoqda?",
      "output": "Sportda ko'plab qiyinchiliklar bo'lishi mumkin: jarohatlar, o'zgarishlarga qarshi kurash va motivatsiya yo'qligi."
    },
    {
      "id": 189,
      "input": "Futbolni o'ynashda qanday strategiyalarni afzal ko'rasiz?",
      "output": "Men tezkor hujumlar va himoya choralari ustida ishlashni afzal ko'raman, bu jamoaviy o'yinda juda samarali."
    },
    {
      "id": 190,
      "input": "Siz sportni yakkama-yakka yoki jamoa sifatida o'ynashni afzal ko'rasiz?",
      "output": "Men jamoaviy sportni yoqtiraman, chunki unda har bir o'yinchi o'z roli va vazifasini bajaradi."
    },
    {
      "id": 191,
      "input": "Siz sportda qanday o'zingizni rivojlantirmoqchisiz?",
      "output": "Men o'zimni jismoniy chidamliligimni oshirish va texnikani yaxshilashga e'tibor qaratmoqchiman."
    },
    {
      "id": 192,
      "input": "Siz uchun sportdagi eng qiyin mashg'ulot qanday?",
      "output": "Sportdagi eng qiyin mashg'ulot — bu intensiv treninglar va yuqori tezlikda o'yinlar, ular ko'proq energiya va kuch talab qiladi."
    },
    {
      "id": 193,
      "input": "Sizni sportda qo'llab-quvvatlovchi kimlar?",
      "output": "Meni sportda do'stlarim, oilam va murabbiyim qo'llab-quvvatlaydi, ular har doim motivatsiya beradi."
    },
    {
      "id": 194,
      "input": "Sizni sportda o'zgarishlar qilishga nima ilhomlantiradi?",
      "output": "O'zgarishlar qilishga o'z yutuqlarimni ko'rish va yangi maqsadlar belgilash ilhomlantiradi."
    },
    {
      "id": 195,
      "input": "Sizningcha, sportda muvaffaqiyatga erishish uchun nafaqat jismoniy, balki ruhiy tayyorgarlik ham kerakmi?",
      "output": "Ha, sportda muvaffaqiyatga erishish uchun jismoniy tayyorgarlikdan tashqari, ruhiy tayyorgarlik ham juda muhim."
    },
    {
      "id": 196,
      "input": "Siz sportda qanday usulni afzal ko'rasiz: individual rivojlanish yoki jamoaviy o'yin?",
      "output": "Men jamoaviy o'yinni afzal ko'raman, chunki bu jamoa ruhini oshiradi va muvaffaqiyatga birgalikda erishish imkonini yaratadi."
    },
    {
      "id": 197,
      "input": "Sportda qaysi qiyinchiliklarga duch kelgansiz?",
      "output": "Sportda eng katta qiyinchiliklar — jarohatlar va motivatsiyani saqlab qolishdir."
    },
    {
      "id": 198,
      "input": "Futbolni o'ynashda eng ko'p qiyin bo'lgan tomon nima?",
      "output": "Futbolni o'ynashda eng ko'p qiyin bo'lgan tomon — to'pni to'g'ri boshqarish va raqibni aniqlash."
    },
    {
      "id": 199,
      "input": "Sportni o'ynashda qanday mashqlarni bajarish kerak?",
      "output": "Sportni o'ynashda tezlik va chidamlilikni oshiradigan mashqlarni bajarish kerak."
    },
    {
      "id": 200,
      "input": "Sizni sportda qanday yangiliklar qiziqtiradi?",
      "output": "Men sportdagi yangi trening usullarini va o'yin strategiyalarini kuzatib boraman, ular sportni qiziqarli qiladi."
    },
    {
      "id": 201,
      "input": "Siz sportni kuniga necha marta o'ynaysiz?",
      "output": "Men sportni haftada 3-4 marta o'ynashni afzal ko'raman, bu jismoniy holatni saqlash uchun yetarli."
    },
    {
      "id": 202,
      "input": "Boks bilan shug'ullanishni nechanchi yildan boshladingiz?",
      "output": "Men boksni 12 yoshimda boshladim, o'shanda o'zimni himoya qilishni o'rgandim."
    },
    {
      "id": 203,
      "input": "Boksda eng ko'p qiyinchiliklarni qaysi fazada sezgansiz?",
      "output": "Boksda eng katta qiyinchilik — bu yuqori darajadagi musobaqalarda raqiblar bilan kurashish. Shuningdek, jismoniy va ruhiy tayyorgarlik zarur."
    },
    {
      "id": 204,
      "input": "Sizningcha, boksda eng muhim fazilat nima?",
      "output": "Boksda eng muhim fazilat — bu chidamlilik, tezkor fikrlash va harakatlarni aniq bajarishdir."
    },
    {
      "id": 205,
      "input": "Boksda qanday mashqlarni eng ko'p bajarishingiz kerak?",
      "output": "Boksda tezlik, kuch va chidamlilikni oshirish uchun tezkor zarbalar va o'tish mashqlari juda muhim."
    },
    {
      "id": 206,
      "input": "Siz uchun boksning eng qiyin qismi nima?",
      "output": "Boksda eng qiyin qism — bu raqibni tahlil qilish va uning harakatlarini oldindan bilib olish."
    },
    {
      "id": 207,
      "input": "Siz boksni boshlash uchun qanday maslahatlar berasiz?",
      "output": "Boksni boshlash uchun o'z jismoniy holatingizni yaxshilashdan boshlang, doimo to'g'ri texnikaga e'tibor bering va jarohatlardan saqlaning."
    },
    {
      "id": 208,
      "input": "Boksda sizni kim ilhomlantiradi?",
      "output": "Men Muhammed Ali va Mike Tysonni ilhomlantiruvchi figuralar deb bilaman, ular nafaqat o'zlari uchun, balki butun dunyo uchun katta motivatsiya manbai bo'lgan."
    },
    {
      "id": 209,
      "input": "Boksda yaxshi zarba berish uchun qanday treninglar kerak?",
      "output": "Yaxshi zarba berish uchun qo'l va bilak kuchini oshirish, to'g'ri pozitsiyada bo'lish va zarba texnikasini mukammallashtirish kerak."
    },
    {
      "id": 210,
      "input": "Boksda qanday ruhiy tayyorgarlik kerak?",
      "output": "Boksda ruhiy tayyorgarlik uchun o'zingizga ishonch hosil qilish, stressni boshqarish va raqibga qarshi tayyor bo'lish zarur."
    },
    {
      "id": 211,
      "input": "Boksda qanday tayyorgarlikdan o'tish zarur?",
      "output": "Boks tayyorgarligi uchun kuch-quvvat, tezlik va chidamlilikni oshiradigan mashqlarni bajarish, shuningdek, texnikani to'liq o'rganish kerak."
    },
    {
      "id": 212,
      "input": "Boksda jangda nimalarga e'tibor qaratish kerak?",
      "output": "Boksda jangda diqqatni raqibning harakatlariga va pozitsiyasiga qaratish, uning zaif joylarini topish va ulardan foydalangan holda zarba berish muhim."
    },
    {
      "id": 213,
      "input": "Boksda shaxsiy muvaffaqiyatni qanday o'lchaysiz?",
      "output": "Muvaffaqiyatni raqibni yengish yoki o'zimni yaxshilash orqali o'lchayman. Shuningdek, texnikada va janglar davomida muvozanatda bo'lish ham ahamiyatli."
    },
    {
      "id": 214,
      "input": "Boksda tezkor zarba berishning siri nima?",
      "output": "Tezkor zarba berish uchun oyoqlarni yaxshi ishlatish, to'g'ri burchakni yaratish va zarbani maksimal kuch bilan berish kerak."
    },
    {
      "id": 215,
      "input": "Boksda eng ko'p qanday jarohatlar uchraydi?",
      "output": "Boksda eng ko'p uchraydigan jarohatlar bosh va yuzga keladigan zarbalar. Boshni himoya qilish juda muhim."
    },
    {
      "id": 216,
      "input": "Boksni boshqarishda qanday xatolardan saqlanish kerak?",
      "output": "Boksni boshqarishda katta xatolar — bu haddan tashqari ruxsatsiz tajovuzkorlik, texnikani e'tiborsiz qoldirish va jismoniy tayyorgarliksiz jang qilish."
    },
    {
      "id": 217,
      "input": "Boksda yengish uchun qanday strategiyalarni qo'llaysiz?",
      "output": "Boksda yengish uchun strategiya — bu raqibni tahlil qilish, unga qarshi jismoniy va ruhiy tayyor bo'lish, va zarbalarni vaqtida va to'g'ri joylashtirish."
    },
    {
      "id": 218,
      "input": "Boksda qanday xavf-xatarlar mavjud?",
      "output": "Boksda boshga zarba olish, miya qaltishlari va boshqa jiddiy jarohatlar xavfi mavjud. Shu sababli, to'g'ri himoya qilish va texnikani bilish juda muhim."
    },
    {
      "id": 219,
      "input": "Boksda qanday pozitsiyalarni egallash kerak?",
      "output": "Boksda to'g'ri pozitsiyada turish — bu oyoqlarni bir-biriga yaqin qo'yish, tizzalarni bukish va qo'llarni doim yuzni himoya qilish uchun yuqorida ushlab turish kerak."
    },
    {
      "id": 220,
      "input": "Sizni boksda eng ko'p qaysi uslub qiziqtiradi?",
      "output": "Men boksda \"agressiv hujum\" uslubini afzal ko'raman, lekin shu bilan birga, raqibni tahlil qilish va mudofaa qilishni ham o'rgandim."
    },
    {
      "id": 221,
      "input": "Boksda raqibni qanday o'zgartirish mumkin?",
      "output": "Raqibni o'zgartirish uchun uning xatolarini to'g'ri tahlil qilish va o'zingizni yaxshi tayyorlash, tezkor va o'zgaruvchan zarbalar berish kerak."
    },
    {
      "id": 222,
      "input": "Boksda yaxshi himoya qilish uchun qanday maslahatlar bor?",
      "output": "Boksda yaxshi himoya qilish uchun to'g'ri pozitsiyada turish, tezkor qo'l va bosh harakatlari, va raqibning zarbalariga vaqtida javob berish muhim."
    },
    {
      "id": 223,
      "input": "Boksda siz uchun eng katta yutuq nima bo'ldi?",
      "output": "Men uchun eng katta yutuq — bu muhim musobaqalarda g'olib chiqish va o'zimni yaxshilash yo'lida erishgan yutuqlarimdir."
    },
    {
      "id": 224,
      "input": "Boksni doimiy ravishda o'ynash uchun qanday motivatsiya kerak?",
      "output": "Boksni doimiy ravishda o'ynash uchun o'z maqsadlaringizni belgilash va o'sishga bo'lgan ishtiyoqni yo'qotmaslik kerak."
    },
    {
      "id": 225,
      "input": "Boksda kimni o'zingizga raqib deb bilasiz?",
      "output": "Men o'zimga raqib sifatida yuqori darajadagi bokschilarni ko'raman, chunki ular meni doim o'z imkoniyatlarimni oshirishga ilhomlantiradi."
    },
    {
      "id": 226,
      "input": "Boksda qanday ruhiy tayyorgarliklar sizga yordam beradi?",
      "output": "Boksda ruhiy tayyorgarlik sifatida, o'zingizni yaxshi his qilish, stressni boshqarish va jangda xotirjam bo'lish juda muhim."
    },
    {
      "id": 227,
      "input": "Boksda mashg'ulotlar qaysi sohalarda eng muhim?",
      "output": "Boksda mashg'ulotlar kuch, tezlik va chidamlilikni oshirishda muhim. Shu bilan birga, texnikani va jangda zarba berish usullarini ham yaxshilash zarur."
    },
    {
      "id": 228,
      "input": "Boksda qanday tanlovlar sizga eng ko'p yoqadi?",
      "output": "Boksda janglardan ko'ra, mashg'ulotlar, sparring (o'yin o'ynash) va o'zimni doimiy ravishda sinab ko'rish menga juda yoqadi."
    },
    {
      "id": 229,
      "input": "Boksni boshlash uchun nima kerak?",
      "output": "Boksni boshlash uchun yaxshi jismoniy tayyorgarlik, texnika va chidamlilik kerak. O'zingizni himoya qilishni o'rganish muhim."
    },
    {
      "id": 230,
      "input": "Boksning asosiy texnikalari nimalardan iborat?",
      "output": "Boksda zarbalar (to'pponcha, krujka, yuqori), himoya (qo'llarni yuqori tutish, boshni himoya qilish), pozitsiya va oyoqlarni ishlatish muhim."
    },
    {
      "id": 231,
      "input": "Boksda qanday xatolardan saqlanish kerak?",
      "output": "Haddan tashqari agressivlik, texnikani e'tiborsiz qoldirish, raqibni baholamaslik va jismoniy holatni nazorat qilishni unutish."
    },
    {
      "id": 232,
      "input": "Boksda ruhiy tayyorgarlik qanday ahamiyatga ega?",
      "output": "Ruhiy tayyorgarlik jangda xotirjamlikni saqlash, stressni boshqarish va o'ziga ishonch hosil qilish uchun zarur."
    },
    {
      "id": 233,
      "input": "Boksda yutish uchun qanday strategiyalarni qo'llaysiz?",
      "output": "Raqibni tahlil qilish, zaif tomonlarini aniqlash, zarbalarni aniq va kuchli berish va jangni boshqarish zarur."
    },
    {
      "id": 234,
      "input": "Boksda qanday mashqlarni bajarish zarur?",
      "output": "Tezlik, kuch va chidamlilikni oshiradigan mashqlar: sprintlar, cho'zilishlar, sparring va zarba berish mashqlari."
    },
    {
      "id": 235,
      "input": "Boksda jarohatlar qanday bo'lishi mumkin?",
      "output": "Boshga zarbalar, miya qaltishlari, yuzdagi kesiklar va qo'l yoki bilakdagi jarohatlar bo'lishi mumkin."
    },
    {
      "id": 236,
      "input": "Boksda tezkor zarba berishning sirlari nimalar?",
      "output": "Tezkor zarba uchun oyoq pozitsiyasi va qisqa masofada zarba berish, kuchni birlashtirish va harakatlarni tezda bajarish zarur."
    },
    {
      "id": 237,
      "input": "Boksda oyoqlarning ahamiyati nimada?",
      "output": "Oyoqlar harakatni boshqarish, tezkor pozitsiya o'zgartirish, zarbalarni kuchli qilish va raqibdan qochishda yordam beradi."
    },
    {
      "id": 238,
      "input": "Boksda motivatsiya qanday saqlanadi?",
      "output": "O'z maqsadlaringizni belgilash, yangi yutuqlarni qo'lga kiritish va har doim o'sishga intilish motivatsiyani saqlashga yordam beradi."
    },
    {
      "id": 239,
      "input": "Boksda jang davomida qanday ruhiy holatda bo'lish kerak?",
      "output": "Xotirjam va diqqatni jamlab, raqibning harakatlarini tahlil qilib, to'g'ri qarorlar qabul qilish zarur."
    },
    {
      "id": 240,
      "input": "Boksda qanday pozitsiyada bo'lish zarur?",
      "output": "Pozitsiyada oyoqlarni bir-biriga yaqin tutish, tizzalarni bukish, qo'llarni yuqori tutish va boshni himoya qilish kerak."
    },
    {
      "id": 241,
      "input": "Boksda musobaqaga qanday tayyorlanish kerak?",
      "output": "Musobaqa oldidan intensiv treninglar, jismoniy holatni oshirish, raqibni tahlil qilish va to'g'ri dam olish zarur."
    },
    {
      "id": 242,
      "input": "Boksda sparring nima va qanday yordam beradi?",
      "output": "Sparring — amaliy jang. Bu boksning texnikasini mustahkamlash, jangdagi qarorlar qabul qilish va tajriba orttirish uchun foydalidir."
    },
    {
      "id": 243,
      "input": "Boksda qanday uslubni afzal ko'rasiz?",
      "output": "Men hujumni afzal ko'raman, lekin raqibning harakatlarini tahlil qilib, o'z strategiyamni moslashtiraman."
    },
    {
      "id": 244,
      "input": "Boksda jangda nimaga e'tibor qaratish kerak?",
      "output": "Raqibning harakatlariga diqqat qaratish, o'z himoyangizni kuchaytirish va zarbalarni aniq berish zarur."
    },
    {
      "id": 245,
      "input": "Boksda eng yaxshi bokschi kim?",
      "output": "Har bir bokschining o'ziga xos uslubi bor, lekin Muhammad Ali, Mike Tyson va Floyd Mayweather kabi bokschilar katta ta'sir ko'rsatgan."
    },
    {
      "id": 246,
      "input": "Boksda qanday ruhiy holatga ega bo'lish kerak?",
      "output": "Xotirjam, o'ziga ishonchli va jangga tayyor bo'lish kerak. Stress va xavotirdan xoli bo'lish jangni muvaffaqiyatli o'tkazishga yordam beradi."
    },
    {
      "id": 247,
      "input": "Boksda mashqlarni qanday muvozanatlash kerak?",
      "output": "Kuchli va zaif tomonlarni tahlil qilib, texnikani yaxshilash, chidamlilikni oshirish va tezlikni rivojlantirish mashqlarini muvozanatlash kerak."
    },
    {
      "id": 248,
      "input": "Boksda o'z kuchli tomonlaringizni qanday aniqlaysiz?",
      "output": "Boksda kuchli tomonlarni sparring yoki musobaqalarda raqibni yengish orqali, hamda o'z treninglaringizni tahlil qilib aniqlash mumkin."
    },
    {
      "id": 249,
      "input": "Boksda yaxshi zarba berish uchun qanday tayyorgarlik kerak?",
      "output": "Zarba berish uchun kuchli qo'llar, bilak va oyoqlarni tayyorlash, pozitsiya va zarbalarni aniq qilish kerak."
    },
    {
      "id": 250,
      "input": "Boksda qanday pozitsiya o'zgartirishlar kerak?",
      "output": "Raqibni aldash va unga qarshi to'g'ri zarba berish uchun pozitsiyani tezda o'zgartirish, oyoqlarni kengaytirish va qisqartirish zarur."
    },
    {
      "id": 251,
      "input": "Boksda qanday uslubda raqibga qarshi turish kerak?",
      "output": "Raqibning uslubiga qarab, yoki hujumkor uslubda, yoki mudofaa uslubida turish kerak. Raqibning zaif tomonlarini tahlil qilib, shu tarzda jang qilish kerak."
    },
    {
      "id": 252,
      "input": "Boksda eng muhim element nima?",
      "output": "Boksda eng muhim element — bu zarba berish va himoya qilishni to'g'ri muvozanatlash. Boshqariladigan jang texnikasi va yaxshi jismoniy tayyorgarlik zarur."
    },
    {
      "id": 253,
      "input": "Boksda jismoniy tayyorgarlikni qanday oshirish mumkin?",
      "output": "Kardio mashqlar, sprintlar, kuch-quvvat mashqlari va zarba berish texnikasini takomillashtirish orqali jismoniy tayyorgarlikni oshirish mumkin."
    },
    {
      "id": 254,
      "input": "Boksda jang qilishdan oldin qanday ovqatlanish kerak?",
      "output": "Jangdan oldin oson hazm bo'ladigan, energiya beradigan ovqatlar iste'mol qilish kerak. Masalan, murakkab uglevodlar va proteinlar."
    },
    {
      "id": 255,
      "input": "Boksda musobaqa uchun qanday stressni boshqarish mumkin?",
      "output": "Stressni boshqarish uchun nafas olish mashqlari, meditatsiya va o'z-o'zini tasalli berish usullari yordam beradi."
    },
    {
      "id": 256,
      "input": "Boksda zarbalarni qanday aniq berish mumkin?",
      "output": "Zarba berishda o'zingizni to'g'ri pozitsiyada tutish, zarbani to'liq kuch bilan va qisqa masofada berish kerak."
    },
    {
      "id": 257,
      "input": "Boksda sparring qachon o'tkazish kerak?",
      "output": "Sparringni o'z tayyorgarligingizni baholash, texnikani mukammallashtirish va jangga tayyor bo'lish uchun muntazam ravishda o'tkazish kerak."
    },
    {
      "id": 258,
      "input": "Boksda qanday jismoniy tayyorgarlik eng yaxshi?",
      "output": "Boksda eng yaxshi jismoniy tayyorgarlik — bu kuch-quvvat, chidamlilik va tezlikni rivojlantirishga qaratilgan mashqlarni bajarishdir."
    },
    {
      "id": 259,
      "input": "Boksda jangni qanday boshqarish kerak?",
      "output": "Jangni boshqarish uchun o'z pozitsiyangizni to'g'ri tanlab, raqibning harakatlarini oldindan sezish va unga qarshi zarbalarni vaqtida berish kerak."
    },
    {
      "id": 260,
      "input": "Boksda qaysi uslubni o'rganish kerak?",
      "output": "Boksda muhim uslublar: hujumkor, qarshi hujum va mudofaa uslubi. Har bir bokschi o'zining kuchli tomoniga mos uslubni tanlashi zarur."
    },
    {
      "id": 261,
      "input": "Futbolni boshlash uchun nima kerak?",
      "output": "Futbolni boshlash uchun asosiy texnikalar, jismoniy tayyorgarlik va jamoaviy ishlashni o'rganish zarur. Shuningdek, futbol to'pi va oyoq kiyimlari ham kerak."
    },
    {
      "id": 262,
      "input": "Futbolning asosiy texnikalari nimalardan iborat?",
      "output": "Futbolning asosiy texnikalari: to'pni boshqarish, uzatish, zarba berish, driblling va himoya qilish. Bunga qo'shimcha, pozitsiyalash va jamoa bilan o'yin ham muhim."
    },
    {
      "id": 263,
      "input": "Futbolni qanday jismoniy tayyorgarlik bilan boshlash kerak?",
      "output": "Futbol uchun kuch-quvvat, tezlik, chidamlilik va muvozanatni rivojlantirishga qaratilgan mashqlarni bajarish kerak."
    },
    {
      "id": 264,
      "input": "Futbol o'yinida qanday ruhiy tayyorgarlik muhim?",
      "output": "O'yinda diqqatni jamlash, stressni boshqarish, o'zini tahlil qilish va jamoaga ishonch hosil qilish muhim."
    },
    {
      "id": 265,
      "input": "Futbol o'yinida eng muhim pozitsiya qanday?",
      "output": "Futbol o'yinida har bir pozitsiya o'z o'rniga ega: hujumchi, yarim himoyachi, himoyachi va darvozabon. Har bir o'yinchi o'z rolini mukammal bajarishi kerak."
    },
    {
      "id": 266,
      "input": "Futbolda qanday strategiyalarni qo'llash kerak?",
      "output": "Jamoaning tizimi, tezkor hujumlar, pozitsion himoya va pressing strategiyalarini qo'llash kerak. Jamoa o'zaro yaxshi hamkorlikda ishlashi zarur."
    },
    {
      "id": 267,
      "input": "Futbolda qanday driblling texnikalarini bilish zarur?",
      "output": "Dribllingni o'rgatishda to'pni nazorat qilish, tezlikni oshirish va raqibni aldanish uchun to'pni qisqa masofada boshqarish muhim."
    },
    {
      "id": 268,
      "input": "Futbol o'yinida qanday uzatishlar o'rganish kerak?",
      "output": "Uzatishlarda aniqlik, kuch va to'g'ri vaqtda uzatish kerak. To'pni uzoq va qisqa masofalarga aniq uzatish, raqibni aldatish uchun qo'lga kiritilgan muhim texnika."
    },
    {
      "id": 269,
      "input": "Futbol o'yinida jarohatlarni qanday oldini olish mumkin?",
      "output": "Yaxshi isitish va cho'zilish mashqlari, shuningdek, to'g'ri oyoq kiyimlari va himoya uskunalarini kiyish jarohatlarni oldini oladi."
    },
    {
      "id": 270,
      "input": "Futbolni o'ynashda qanday strategiya qo'llanadi?",
      "output": "O'yinni nazorat qilish uchun pressing, raqibni aldash va tezkor hujumlarni qo'llash kerak. Yaxshi pozitsiya o'ynash ham zarur."
    },
    {
      "id": 271,
      "input": "Futbol o'yinida o'zgarishlarni qanday bajarish kerak?",
      "output": "Taklif qilinayotgan strategiya yoki taktika asosida, raqibning zaif tomonlarini aniqlash va unga qarshi o'zgarishlarni tezda amalga oshirish muhim."
    },
    {
      "id": 272,
      "input": "Futbolda qanday to'p zarbalari berish kerak?",
      "output": "To'pni aniq va kuchli zarba berish uchun oyoqlarni to'g'ri tutish, zarba bera turib, raqib darvozabonini aldash kerak."
    },
    {
      "id": 273,
      "input": "Futbolda qanday hujumchining xususiyatlari bo'lishi kerak?",
      "output": "Hujumchi tezkor bo'lishi, raqibning himoyachilarini aldash, zarbalarni kuchli va aniq berish, hamda jamoaning tizimiga mos ravishda ishlash zarur."
    },
    {
      "id": 274,
      "input": "Futbol o'yinida qanday himoya qilish kerak?",
      "output": "Himoya qilishda tezlik, pozitsiya saqlash, to'pni olish va raqibni to'sish asosiy maqsad bo'ladi."
    },
    {
      "id": 275,
      "input": "Futbolda qanday qilib to'pni bosh bilan ko'tarish kerak?",
      "output": "To'pni bosh bilan ko'tarishda, boshni to'p bilan birlashtirib, oyoqlarni to'g'ri pozitsiyada saqlash va zarba berish zarur."
    },
    {
      "id": 276,
      "input": "Futbol o'yinida darvozabonning roli qanday?",
      "output": "Darvozabon to'pni darvozaga yo'naltirishdan himoya qilish, himoya chizig'ini boshqarish va tezkor qarorlar qabul qilish zarur."
    },
    {
      "id": 277,
      "input": "Futbolda qanday pressing strategiyasini qo'llash kerak?",
      "output": "Pressingda jamoaning har bir o'yinchisi raqibni bosib, unga to'pni ushlab turish imkoniyatini bermaslik kerak."
    },
    {
      "id": 278,
      "input": "Futbol o'yinida eng yaxshi jamoaviy ishlashni qanday ta'minlash mumkin?",
      "output": "Jamoaviy ishlash uchun yaxshi muloqot, to'pni tezda uzatish va har bir o'yinchining rolini yaxshi bajarishi zarur."
    },
    {
      "id": 279,
      "input": "Futbolda qanday pozitsion o'yin muhim?",
      "output": "Pozitsion o'yin, jamoaning tuzilishi va har bir o'yinchining o'z pozitsiyasida bo'lishi va to'pni to'g'ri uzatishi zarur."
    },
    {
      "id": 280,
      "input": "Futbol o'yinida qanday jismoniy tayyorgarlik muhim?",
      "output": "Jismoniy tayyorgarlikda tezlik, chidamlilik va kuchni oshirish uchun mashqlar kerak. Shuningdek, to'g'ri ovqatlanish va dam olish muhim."
    },
    {
      "id": 281,
      "input": "Futbol o'yinida qanday strategiyalarni qo'llash mumkin?",
      "output": "To'pni nazorat qilish, raqibni aldash, pressing va tezkor hujumlar strategiyalarini qo'llash mumkin."
    },
    {
      "id": 282,
      "input": "Futbolni qanday yaxshi o'ynash uchun ruhiy tayyorgarlik zarur?",
      "output": "Futbol o'yinida o'ziga ishonch, stressni boshqarish, diqqatni jamlash va jamoa bilan birga ishlash muhim."
    },
    {
      "id": 283,
      "input": "Futbol o'yinida qanday tarzda zarba berish kerak?",
      "output": "Zarba berish uchun kuchni va aniqlikni birlashtirish, oyoqni to'g'ri tutish va raqibni aldash kerak."
    },
    {
      "id": 284,
      "input": "Futbol o'yinida qanday joylashish va pozitsiyalarni saqlash muhim?",
      "output": "Futbolda to'g'ri joylashish jamoaviy o'yinda o'z rolini o'ynash, har bir o'yinchining pozitsiyasini saqlash va to'pni olishda yordam beradi."
    },
    {
      "id": 285,
      "input": "Futbolda qanday yaxshi himoya pozitsiyasini saqlash kerak?",
      "output": "Himoyachi o'z pozitsiyasini doimo tahlil qilib, raqibni to'sib, zarba berishdan saqlanish kerak."
    },
    {
      "id": 286,
      "input": "Futbol o'yinida qanday jamoaviy texnikalarni qo'llash kerak?",
      "output": "Jamoaviy texnikalar orasida uzatishlar, driblling va pressing kabi mashqlar muhim. Bular to'g'ri hamkorlikda ishlashni ta'minlaydi."
    },
    {
      "id": 287,
      "input": "Futbol o'yinida qanday energiyani tejash zarur?",
      "output": "O'yinning har bir bosqichida energiyani tejash uchun harakatlarni samarali bajarish, uzatish va to'pni boshqarish zarur."
    },
    {
      "id": 288,
      "input": "Futbolda qanday pozitsiyada bo'lish kerak?",
      "output": "To'g'ri pozitsiyada bo'lish uchun o'yinchilar o'zining pozitsiyasini doimo nazorat qilib, to'pni olish va uzatish vazifalarini bajarishi kerak."
    },
    {
      "id": 289,
      "input": "Futbol o'yinida qanday motivatsiya saqlanadi?",
      "output": "Motivatsiyani saqlash uchun jamoaviy ruh, muvaffaqiyatga erishish istagi va jamoaning har bir o'yinchisi o'z rolini yaxshi bajarishi kerak."
    },
    {
      "id": 290,
      "input": "Futbol o'yinida qanday qilib xavfsiz o'ynash kerak?",
      "output": "Futbolni xavfsiz o'ynash uchun to'g'ri himoya uskunalarini kiyish, jismoniy mashqlarni bajarish va jarohatlarni oldini olish uchun ehtiyotkor bo'lish zarur."
    },
    {
      "id": 291,
      "input": "Futbolni boshlash uchun qanday asosiy tayyorgarlik kerak?",
      "output": "Futbolni boshlash uchun, jismoniy tayyorgarlikni oshirish, yaxshi oyoq kiyimlari, to'pni boshqarish va jamoa bilan ishlashni o'rganish zarur."
    },
    {
      "id": 292,
      "input": "Futbolni yaxshi o'ynash uchun qanday zaruriy ko'nikmalar bor?",
      "output": "Boshqaruv, to'pni tezkor uzatish, zarba berish, driblling va yaxshi pozitsiya saqlash muhim."
    },
    {
      "id": 293,
      "input": "Futbol o'yinida eng ko'p ishlatiladigan strategiya nima?",
      "output": "Tezkor hujum va pressing — bu futbolning eng samarali strategiyalari. Raqibni bosib, to'pni tezda qaytarish o'yinning asosiy qismidir."
    },
    {
      "id": 294,
      "input": "Futbol o'yinida qanday hujum texnikasini ishlatish kerak?",
      "output": "Hujumda to'pni tezkor uzatish, dribllingni o'rganish va darvozabonni aldaydigan zarbalar berish zarur."
    },
    {
      "id": 295,
      "input": "Futbol o'yinida xavfsiz o'ynash uchun qanday maslahatlar bor?",
      "output": "Jarohatlardan saqlanish uchun himoya kiyimlarini kiyish, raqibni qattiq zarbalardan saqlanish va ehtiyotkorlik bilan harakat qilish kerak."
    },
    {
      "id": 296,
      "input": "Futbol o'yinida qaysi pozitsiya o'yinchi uchun eng mos?",
      "output": "Bu har bir o'yinchining kuchli tomonlariga bog'liq, lekin tezkor va kuchli zarba bera oladigan o'yinchilar hujumchi bo'lishi mumkin, himoyachi esa yaxshi pozitsiyaga ega bo'lishi kerak."
    },
    {
      "id": 297,
      "input": "Futbolda yirik musobaqalarga tayyorlanish uchun qanday mashqlar kerak?",
      "output": "Musobaqalarga tayyorlanish uchun texnik mashqlar, sprintlar, kuch-quvvat mashqlari va raqiblarni tahlil qilish zarur."
    },
    {
      "id": 298,
      "input": "Futbol o'yinida qanday pozitsiyalarda joylashish kerak?",
      "output": "O'yinda to'g'ri pozitsiyada bo'lish uchun, himoyachilar o'z hududida turib, hujumchilar darvozaga yaqin turishlari kerak."
    },
    {
      "id": 299,
      "input": "Futbol o'yinida qanday jismoniy tayyorgarlik muhim?",
      "output": "Jismoniy tayyorgarlikda tezlik, kuch, chidamlilik va o'rtacha harakatlarni yaxshilash uchun mashqlarni bajarish kerak."
    },
    {
      "id": 300,
      "input": "Futbolda qanday zarbalarni berish eng samarali hisoblanadi?",
      "output": "Zarbalarni aniq va kuchli berish, darvozabonni aldagan holda, qattiq va baland zarba berish yaxshi hisoblanadi."
    },
    {
      "id": 301,
      "input": "Futbol o'yinida raqibni qanday tahlil qilish kerak?",
      "output": "Raqibning zaif tomonlarini aniqlash, uning o'yin uslubini o'rganish va unga qarshi to'g'ri taktikani ishlab chiqish kerak."
    },
    {
      "id": 302,
      "input": "Futbolda to'pni qanday driblling qilish kerak?",
      "output": "Dribllingda tezlik va to'pni boshqarish muhim. To'pni qisqa masofalarda va tezkor boshqarish, raqibni aldaydigan usullarni o'rganish zarur."
    },
    {
      "id": 303,
      "input": "Futbol o'yinida eng yaxshi jamoaviy o'yin qanday bo'lishi kerak?",
      "output": "Jamoaviy o'yinda har bir o'yinchi bir-biriga yordam berishi, to'pni tez va aniqlik bilan uzatishi va jamoaviy strategiya doirasida harakat qilishi zarur."
    },
    {
      "id": 304,
      "input": "Futbol o'yinida qanday uzatishlar samarali hisoblanadi?",
      "output": "Uzatishlar aniq, kuchli va o'z vaqtida bo'lishi kerak. Shuningdek, uzoq masofalarga, to'pni to'g'ri yo'naltirib, raqibni aldashni ham hisobga olish kerak."
    },
    {
      "id": 305,
      "input": "Futbol o'yinida eng yaxshi darvozabon qanday bo'lishi kerak?",
      "output": "Yaxshi darvozabon tezkor qarorlar qabul qiladi, zarbalarni to'xtatish uchun harakatni to'g'ri vaqtlaydi va darvozani boshqarishni yaxshi biladi."
    },
    {
      "id": 306,
      "input": "Futbolda qanday strategiyalarni o'zgartirish kerak bo'lishi mumkin?",
      "output": "Jang davomida o'zgarishlar amalga oshirilishi mumkin: pressingni kuchaytirish, hujumni kengaytirish yoki himoyani mustahkamlash."
    },
    {
      "id": 307,
      "input": "Futbol o'yinida o'zini qanday motivatsiya qilish mumkin?",
      "output": "O'z maqsadlaringizni belgilab, yutish istagini kuchaytirib, jamoa bilan yaxshi muloqot qilish orqali motivatsiyani saqlash mumkin."
    },
    {
      "id": 308,
      "input": "Futbolda qanday jarohatlar eng ko'p uchraydi?",
      "output": "Futbol o'yinida eng ko'p uchraydigan jarohatlar: oyoq-biloqlar, tizza jarohatlari va to'pni bosh bilan olishda yuzaga keladigan jarohatlar."
    },
    {
      "id": 309,
      "input": "Futbol o'yinida qanday xavfli vaziyatlarni boshqarish kerak?",
      "output": "Raqib tez hujumga o'tishdan oldin, jamoa himoyasini mustahkamlash, to'pni qaytarib olish va himoyachi bilan tezkor muloqot qilish kerak."
    },
    {
      "id": 310,
      "input": "Futbol o'yinida yaxshi qarorlar qanday qabul qilinadi?",
      "output": "Yaxshi qarorlar o'yin davomida tezkor tahlil, raqibning pozitsiyasini o'rganish va o'z imkoniyatlarini hisobga olish orqali qabul qilinadi."
    },
    {
      "id": 311,
      "input": "Futbol o'yinida qanday tajriba orttirish mumkin?",
      "output": "Sparringlar, o'zgaruvchan sharoitlarda o'ynash, murabbiyning maslahatlarini tinglash va o'z o'yiningizni tahlil qilish orqali tajriba orttirish mumkin."
    },
    {
      "id": 312,
      "input": "Futbol o'yinida qanday maqsadlarni belgilash kerak?",
      "output": "O'z o'yinini rivojlantirish uchun qisqa muddatli va uzoq muddatli maqsadlar belgilash, o'yin davomida yutuqlarni kuzatib borish zarur."
    },
    {
      "id": 313,
      "input": "Futbolda qaysi pozitsiya eng ko'p energiya sarflaydi?",
      "output": "Hujumchilar va yarim himoyachilar ko'proq energiya sarflaydigan pozitsiyalar hisoblanadi, chunki ular doimo harakatda bo'lishi va tezkor qarorlar qabul qilishi kerak."
    },
    {
      "id": 314,
      "input": "Futbol o'yinida qanday jismoniy mashqlar yordam beradi?",
      "output": "Kardio mashqlari, sprintlar, kuch-quvvat mashqlari va oyoqlarni mustahkamlash mashqlari futbolchining jismoniy tayyorgarligini oshiradi."
    },
    {
      "id": 315,
      "input": "Futbol o'yinida nima uchun to'pni tezda uzatish muhim?",
      "output": "To'pni tezda uzatish orqali raqibni aldash, jamoaning pozitsiyasini o'zgartirish va hujumni kengaytirish mumkin."
    },
    {
      "id": 316,
      "input": "Futbol o'yinida qanday qilib jamoa o'zaro aloqa qilishini yaxshilash mumkin?",
      "output": "Jamoa o'zaro muloqotini kuchaytirish uchun yaxshi treninglar, aniq belgilangan rollar va bir-birini tushunish zarur."
    },
    {
      "id": 317,
      "input": "Futbol o'yinida qanday tezkor qarorlar qabul qilish kerak?",
      "output": "Qarorlar tezkor va aniq bo'lishi kerak. O'yinchi raqibni tahlil qilib, o'z pozitsiyasini tezda o'zgartirib, to'pni uzatishi yoki zarba berishi kerak."
    },
    {
      "id": 318,
      "input": "Futbol o'yinida qanday himoya pozitsiyasini tanlash kerak?",
      "output": "Himoyachi raqibni to'sib, o'z hududini nazorat qilib, zarba berish va o'yinni to'xtatish uchun kuchli pozitsiya tanlashi kerak."
    },
    {
      "id": 319,
      "input": "Aralash jang san'atiga qanday tayyorgarlik kerak?",
      "output": "MMA o'yiniga tayyorlanish uchun, yaxshilangan jismoniy tayyorgarlik, turli jang texnikalarini o'rganish (boks, grappling, jiu-jitsu, wrestling), kuch-quvvat mashqlari va chidamlilikni oshirish kerak."
    },
    {
      "id": 320,
      "input": "MMA janglarida qanday usullar qo'llaniladi?",
      "output": "MMA janglarida turli usullar qo'llaniladi: zarbalar (boks, kickboks), erdagi jang (grappling, jiu-jitsu), kurash va qo'l va oyoqlar bilan turli hujumlar."
    },
    {
      "id": 321,
      "input": "MMA jangida eng samarali himoya usuli nima?",
      "output": "Jangda himoya qilish uchun yaxshi pozitsiya saqlash, zarbalardan qochish, bloklash va grappling usullarini bilish zarur."
    },
    {
      "id": 322,
      "input": "MMA janglarida qanday qilib yaxshi zarba berish mumkin?",
      "output": "Yaxshi zarba berish uchun to'g'ri texnika, kuchli oyoq va qo'l zarbalari, tezlik va aniq maqsadni ko'zlash kerak."
    },
    {
      "id": 323,
      "input": "MMA jangida jiu-jitsu usullarini qanday qo'llash mumkin?",
      "output": "Jiu-jitsu usullari erdagi jangda, qo'lni ushlash, bo'g'ish, yakkalash va o'z pozitsiyasini nazorat qilishda foydalidir."
    },
    {
      "id": 324,
      "input": "MMA jangida qanday strategiya qo'llaniladi?",
      "output": "Strategiya jangda raqibni o'z kuchli tomonlarini tahlil qilib, zarbalar va grapplingni kombinatsiya qilish, harakatlarni samarali bajarish va raqibni charchatishdir."
    },
    {
      "id": 325,
      "input": "MMA jangida qanday texnikalar jismoniy kuchni oshiradi?",
      "output": "Jismoniy kuchni oshirish uchun sprintlar, kuch-quvvat mashqlari, oyoq va qo'l mashqlari, jangovarlik treninglari va to'siqlardan o'tish mashqlari amalga oshiriladi."
    },
    {
      "id": 326,
      "input": "MMA jangida qanday qilib raqibni yerga yiqitish mumkin?",
      "output": "Raqibni yerga yiqitish uchun wrestling va judo usullari, to'g'ri timing va raqibning og'irlik markazini tushunish kerak."
    },
    {
      "id": 327,
      "input": "MMA jangida nimalarga e'tibor berish kerak?",
      "output": "Jangda diqqatni jamlash, pozitsiyani saqlash, raqibning harakatlarini tahlil qilish, zarbalardan qochish va o'z imkoniyatlarini hisobga olish kerak."
    },
    {
      "id": 328,
      "input": "MMA janglarida ko'proq zarbalarni qayerga yo'naltirish kerak?",
      "output": "Zarbalar ko'proq bosh, bel, jigar yoki oyoqlar kabi zaif joylarga yo'naltirilishi kerak. Shuningdek, to'liq himoya qilish zarur."
    },
    {
      "id": 329,
      "input": "MMA jangida qanday qilib raqibni charchatish mumkin?",
      "output": "Raqibni charchatish uchun, uning energiyasini sarflaydigan texnikalar (grappling, pozitsion jang) va uni muntazam ravishda hujum qilish muhim."
    },
    {
      "id": 330,
      "input": "MMA jangida qo'l va oyoq zarbalari o'rtasidagi farq nima?",
      "output": "Qo'l zarbalari yaqin masofada kuchliroq bo'lsa, oyoq zarbalari uzoq masofada samarali, ayniqsa tekislik va balandlikka yo'naltirilganda."
    },
    {
      "id": 331,
      "input": "MMA jangida qanday qilib erdagi jangni yutish mumkin?",
      "output": "Erdagi jangda, raqibni pozitsiya olish orqali nazorat qilish, to'g'ri bo'g'ish va yakkalash texnikalarini qo'llash mumkin."
    },
    {
      "id": 332,
      "input": "MMA jangida qanday bo'g'ish texnikalari ishlatiladi?",
      "output": "Aralash jang san'atida bo'g'ish uchun guillotine, armbar, triangle choke, kimura kabi texnikalar qo'llaniladi."
    },
    {
      "id": 333,
      "input": "MMA jangida birinchi yordam qanday ko'rsatiladi?",
      "output": "MMA jangida birinchi yordamda, jarohatlarning tez tahlili, qon ketishini to'xtatish, shishishni kamaytirish va og'riqni yengillashtirish uchun asosiy tibbiy yordamni ko'rsatish zarur."
    },
    {
      "id": 334,
      "input": "MMA janglarida qaysi usullar raqibni qiynoqqa solish uchun ishlatiladi?",
      "output": "Raqibni qiynoqqa solish uchun, unga og'riqni keltiruvchi bo'g'ish va yakkalash usullari, shuningdek, kuchli zarbalar qo'llaniladi."
    },
    {
      "id": 335,
      "input": "MMA jangida qanday qilib raqibning himoyasini buzish mumkin?",
      "output": "Raqibning himoyasini buzish uchun, ko'proq zarbalarni tez-tez va noaniq joylarga yo'naltirish, grapplingda raqibni tor maqsadlarga majbur qilish kerak."
    },
    {
      "id": 336,
      "input": "MMA jangida qanday fizikal mashqlar zarur?",
      "output": "Kuch-quvvat mashqlari, chidamlilik mashqlari, oyoq va qo'l kuchini oshirish uchun sprintlar va plyometrik mashqlarni bajarish zarur."
    },
    {
      "id": 337,
      "input": "MMA jangida raqibni qanday \"knockout\" qilish mumkin?",
      "output": "Raqibni \"knockout\" qilish uchun kuchli va aniq zarbalar, bosh va jag'ga yo'naltirilgan to'g'ridan-to'g'ri zarbalar va oyoq zarbalarini qo'llash kerak."
    },
    {
      "id": 338,
      "input": "MMA jangida qanday qilib ushlab turish va bosim o'tkazish mumkin?",
      "output": "Raqibni ushlab turish va bosim o'tkazish uchun to'g'ri bo'g'ish va qo'l usullari, raqibning nafasini tortib olish va uning harakatini cheklash zarur."
    },
    {
      "id": 339,
      "input": "MMA jangida qanday qilib o'z pozitsiyani yaxshilash mumkin?",
      "output": "Pozitsiyani yaxshilash uchun doimo o'z harakatlaringizni optimallashtirish, raqibning zaif tomonlarini bilish va mashqlar orqali eng yaxshi pozitsiyalarni topish kerak."
    },
    {
      "id": 340,
      "input": "MMA jangida qanday turli zarba texnikalari ishlatiladi?",
      "output": "MMA jangida boks, kickboks, muay thai, taekwondo va boshqa jang san'atlardan zarba berish texnikalari qo'llaniladi."
    },
    {
      "id": 341,
      "input": "MMA jangida jangni qanday tezda tugatish mumkin?",
      "output": "Jangni tezda tugatish uchun kuchli zarbalar, raqibni yo'qotish va bo'g'ish usullaridan foydalangan holda, raqibning zaif joylarini aniqlab hujum qilish mumkin."
    },
    {
      "id": 342,
      "input": "MMA jangida jangning davomiyligi qanday belgilangan?",
      "output": "MMA jangining davomiyligi, odatda, 3 raunddan iborat bo'lib, har bir raund 5 daqiqa davom etadi. Final janglarida raundlar soni oshirilishi mumkin."
    },
    {
      "id": 343,
      "input": "MMA jangida qanday qilib mental tayyorgarlik zarur?",
      "output": "Mental tayyorgarlikda, diqqatni jamlash, stressni boshqarish, raqibga qarshi tayyorgarlik va jang davomida o'z xotirjamligini saqlash muhimdir."
    },
    {
      "id": 344,
      "input": "MMA jangida qanday shaxsiy himoya texnikalari mavjud?",
      "output": "Shaxsiy himoya texnikalari orasida zarbalardan qochish, bloklash, kontrataks, erdagi jang usullari va raqibni aldatish texnikalari mavjud."
    },
    {
      "id": 345,
      "input": "MMA jangida qanday muammolarni engish kerak?",
      "output": "Jang davomida jarohatlar, raqibni psixologik va jismoniy holatini tushunish, strategiyani o'zgartirish va energiya sarfini nazorat qilish kerak."
    },
    {
      "id": 346,
      "input": "MMA jangida qanday zarba kombinatsiyalarini ishlatish kerak?",
      "output": "Zarba kombinatsiyalarida qo'l va oyoq zarbalarini birgalikda ishlatish, tezkor va kuchli zarbalarni raqibni aldagan holda berish muhim."
    },
    {
      "id": 347,
      "input": "MMA jangida raqibni qanday tushunish va tahlil qilish kerak?",
      "output": "Raqibning jang uslubini o'rganish, uning kuchli va zaif tomonlarini tahlil qilish va unga qarshi mos strategiya ishlab chiqish zarur."
    },
    {
      "id": 348,
      "input": "MMA jangida eng samarali kurash texnikasi qanday?",
      "output": "Kurashda to'g'ri timing, pozitsiya va zarba kombinatsiyalari muhim. Qisqa masofada kuchli zarba va tezkor erga tushirish texnikalari samarali bo'ladi."
    },
    {
      "id": 349,
      "input": "MMA jangida yakkalash (submission) usullaridan qanday foydalanish mumkin?",
      "output": "Yakkalash usullari, masalan, armbar, triangle choke va kimura, raqibni nazorat qilish va og'riq orqali jangni tugatishga yordam beradi."
    },
    {
      "id": 350,
      "input": "MMA jangida qanday kuchli zarba berish texnikalari mavjud?",
      "output": "Kuchli zarbalar uchun, oyoq va qo'l zarbalari kombinatsiyasi, to'g'ri tekislikda zarba berish va kuchli og'riq keltiruvchi hujumlar muhim."
    },
    {
      "id": 351,
      "input": "MMA jangida jismoniy chidamlilikni qanday oshirish mumkin?",
      "output": "Chidamlilikni oshirish uchun uzoq masofalarga yugurish, interval mashqlari, plyometrik mashqlar va jismoniy yuklamalarni doimiy ravishda oshirish zarur."
    },
    {
      "id": 352,
      "input": "MMA jangida zarbalar va grapplingni qanday samarali kombinatsiya qilish mumkin?",
      "output": "Zarbalarni raqibning himoyasini buzish uchun ishlatib, keyin grappling usullariga o'tish, ya'ni to'pni olish yoki bo'g'ish texnikalarini qo'llash muhim."
    },
    {
      "id": 353,
      "input": "MMA jangida qaysi pozitsiyalarda eng ko'p zarba olish xavfi bor?",
      "output": "Eng ko'p zarba olish xavfi bo'lgan pozitsiyalar — bu ochiq pozitsiyalar, masalan, raqib hujumga o'tishga tayyor bo'lgan yoki himoya qilishni unutan holatlar."
    },
    {
      "id": 354,
      "input": "MMA jangida jangning psixologik tomonlarini qanday boshqarish kerak?",
      "output": "Psixologik jihatdan jangni boshlashdan oldin o'z his-tuyg'ularini nazorat qilish, qattiq konsentratsiya qilish va jang davomida xavotirni kamaytirish kerak."
    },
    {
      "id": 355,
      "input": "MMA jangida ko'proq oyoq zarbalarini qanday qo'llash mumkin?",
      "output": "Oyoq zarbalarini, masalan, low kick, high kick, roundhouse kick kabi texnikalarni tezkorlik bilan bajarish, raqibni aldash va uning himoyasini buzish uchun ishlatish zarur."
    },
    {
      "id": 356,
      "input": "MMA jangida kuch-quvvat mashqlari qanday yordam beradi?",
      "output": "Kuch-quvvat mashqlari, raqibni erga yiqitish va zarbalarni kuchaytirish uchun juda muhim. Mashqlar orasida squats, deadlifts, push-ups va kettlebell mashqlari qo'llaniladi."
    },
    {
      "id": 357,
      "input": "MMA jangida erdagi jangni yutish uchun qanday texnikalar qo'llanadi?",
      "output": "Erdagi jangda raqibni pozitsiyaga olish, qo'l yoki oyoqni bo'g'ish, ularni to'g'ri tartibda ushlash va yakkalash texnikalarini qo'llash kerak."
    },
    {
      "id": 358,
      "input": "MMA jangida zarba olishdan qanday saqlanish mumkin?",
      "output": "Zarbalardan saqlanish uchun doimiy ravishda pozitsiyani o'zgartirish, tezkor harakat qilish va zarbalarni bloklash texnikalarini o'rganish zarur."
    },
    {
      "id": 359,
      "input": "MMA jangida qanday qilib raqibni o'zgartirish yoki charchatish mumkin?",
      "output": "Raqibni charchatish uchun harakatlarni tez-tez o'zgartirish, uzoq davom etadigan grappling va pozitsiya o'zgarishlari yordamida uning energiyasini kamaytirish kerak."
    },
    {
      "id": 360,
      "input": "MMA jangida jangovar ruhiyatni qanday saqlash mumkin?",
      "output": "Ruhiyatni saqlash uchun, motivatsiya, o'ziga bo'lgan ishonchni oshirish, muvaffaqiyatni ko'zlash va strategiyani izchil bajarish muhim."
    },
    {
      "id": 361,
      "input": "MMA jangida qo'l zarbalarini qanday kuchaytirish mumkin?",
      "output": "Qo'l zarbalarini kuchaytirish uchun, pishiq qo'l mashqlarini bajarish, katta shinalar yoki qo'l og'irliklari bilan mashq qilish va aniq maqsadga qaratilgan zarbalar berish kerak."
    },
    {
      "id": 362,
      "input": "MMA jangida o'z himoya strategiyasini qanday ishlab chiqish mumkin?",
      "output": "Himoya strategiyasini ishlab chiqishda, raqibning kuchli tomonlarini tahlil qilib, zarbalardan qochish, pozitsiyani yaxshi saqlash va har doim tezkor reaksiya berish zarur."
    },
    {
      "id": 363,
      "input": "MMA jangida jismoniy hamda ruhiy tayyorgarlikni qanday uyg'unlashtirish kerak?",
      "output": "Jismoniy tayyorgarlikni intensiv mashqlar bilan oshirish, ruhiy tayyorgarlikni esa vizualizatsiya, meditatsiya va psixologik mashqlar orqali rivojlantirish zarur."
    },
    {
      "id": 364,
      "input": "MMA jangida qanday qilib o'z kuchli tomonlarni aniqlash mumkin?",
      "output": "O'z kuchli tomonlarini aniqlash uchun turli jang texnikalarini sinab ko'rish, o'z ustuvor imkoniyatlarini topish va doimiy ravishda mashqlarni takomillashtirish kerak."
    },
    {
      "id": 365,
      "input": "MMA jangida qo'lni qanday samarali himoya qilish mumkin?",
      "output": "Qo'lni samarali himoya qilish uchun, zarbalarni to'g'ri bloklash, raqibni aldagan holatda qo'lni kuchli ushlash va yaxshi pozitsiyada bo'lish zarur."
    },
    {
      "id": 366,
      "input": "MMA jangida qaysi usul raqibni eng tezda tushirish uchun ishlatiladi?",
      "output": "Raqibni eng tezda tushirish uchun, ko'pincha \"double leg takedown\" yoki \"single leg takedown\" usullari qo'llaniladi."
    },
    {
      "id": 367,
      "input": "MMA jangida jamoaning roli qanday ahamiyatga ega?",
      "output": "Jamoaning roli jangchi uchun muhim, chunki murabbiylar va qo'llab-quvvatlovchilar jangchi uchun psixologik, strategik va jismoniy tayyorgarlikda katta yordam beradi."
    },
    {
      "id": 368,
      "input": "MMA jangida qanday texnikalar raqibni aldaydi?",
      "output": "Raqibni aldaydigan texnikalar orasida zarbalarni tez-tez o'zgartirish, unga qaratilgan bo'g'ish va zarbalar bilan aldaydigan hujumlar kiritish zarur."
    },
    {
      "id": 369,
      "input": "MMA jangida qanday qilib o'z himoya pozitsiyasini saqlash mumkin?",
      "output": "Himoya pozitsiyasini saqlash uchun, doimiy ravishda raqibning harakatlarini kuzatib, pozitsiyalarni o'zgartirib va zarbalardan qochish kerak."
    },
    {
      "id": 370,
      "input": "MMA jangida qaysi sport usuli ko'proq ishlatiladi?",
      "output": "MMA jangida boks, wrestling va braziliya jiu-jitsu usullari eng ko'p ishlatiladi."
    },
    {
      "id": 371,
      "input": "MMA jangida erga yiqilmaslik uchun qanday texnikalar mavjud?",
      "output": "Erga yiqilmaslik uchun yaxshi balansni saqlash, pozitsiyani o'zgartirish va zarbalardan qochish kerak."
    },
    {
      "id": 372,
      "input": "MMA jangida qaysi sport turlari qo'llaniladi?",
      "output": "MMA janglarida boks, kickboks, muay thai, braziliya jiu-jitsu, wrestling va judo kabi sport turlari qo'llaniladi."
    },
    {
      "id": 373,
      "input": "MMA jangida raqibni qanday tushirish mumkin?",
      "output": "Raqibni tushirish uchun wrestling texnikalari, masalan, double leg takedown yoki hip toss qo'llaniladi."
    },
    {
      "id": 374,
      "input": "MMA jangida eng muhim qobiliyat nima?",
      "output": "Eng muhim qobiliyat - tezkor reaksiya va jangda pozitsiyani to'g'ri saqlash."
    },
    {
      "id": 375,
      "input": "MMA jangida qaysi pozitsiyada eng yaxshi hujum qilish mumkin?",
      "output": "\"Mount\" pozitsiyasi eng yaxshi hujum qilish uchun ideal, chunki raqibni to'liq nazorat qilish imkonini beradi."
    },
    {
      "id": 376,
      "input": "MMA jangida qanday qilib zarbalarni kuchaytirish mumkin?",
      "output": "Zarbalarni kuchaytirish uchun oyoqlarni va qo'llarni maxsus mashqlar bilan kuchaytirish zarur."
    },
    {
      "id": 377,
      "input": "MMA jangida raqibni qanday aniqlash mumkin?",
      "output": "Raqibni aniqlash uchun uning harakatlarini kuzatib, kuchli tomonlarini va zaif nuqtalarini topish zarur."
    },
    {
      "id": 378,
      "input": "MMA jangida doimo qaysi pozitsiyada qolish kerak?",
      "output": "Doimo himoya pozitsiyasida qolish kerak, bu sizga raqibning harakatlarini o'rganish va zarbalardan qochishga yordam beradi."
    },
    {
      "id": 379,
      "input": "MMA jangida yuqori zarba berish uchun qanday mashqlar qilish kerak?",
      "output": "Yuqori zarba uchun, oyoq va qo'l mushaklarini kuchaytiruvchi mashqlar, shuningdek, kuchli zarba berishga yordam beruvchi plyometrik mashqlarni bajarish zarur."
    },
    {
      "id": 380,
      "input": "MMA jangida qancha davom etadi?",
      "output": "MMA janglari odatda uch raunddan iborat bo'ladi, har bir raund 5 daqiqa davom etadi."
    },
    {
      "id": 381,
      "input": "MMA jangida qanday zarba turidan qochish kerak?",
      "output": "Yuqori zarbalardan qochish kerak, chunki ular raqibni tezda nokaut qilishga olib kelishi mumkin."
    },
    {
      "id": 382,
      "input": "MMA jangida qanday qilib ko'proq chidamlilikni oshirish mumkin?",
      "output": "Ko'proq chidamlilikni oshirish uchun interval mashqlari, uzoq masofaga yugurish va kuch-quvvat mashqlari yordam beradi."
    },
    {
      "id": 383,
      "input": "MMA jangida erga tushganingizda nima qilish kerak?",
      "output": "Erga tushganingizda, darhol himoya pozitsiyasini olish, raqibni ko'rsatadigan nuqtadan chetlashish va tizzalardan himoya qilish kerak."
    },
    {
      "id": 384,
      "input": "MMA jangida yaxshi urish texnikasi qanday bo'lishi kerak?",
      "output": "Yaxshi urish texnikasi tez, aniq va kuchli bo'lishi kerak. Zarba berishda barcha kuchni to'g'ri kanalizatsiya qilish muhim."
    },
    {
      "id": 385,
      "input": "MMA jangida qanday qilib raqibni aldaydi?",
      "output": "Raqibni aldaydigan usul — tezkor harakatlar va zarba kombinatsiyalarini qo'llash orqali uning his-tuyg'ularini chalg'itish."
    },
    {
      "id": 386,
      "input": "MMA jangida qanday pozitsiyani tanlash kerak?",
      "output": "Har bir jangda raqibga qarab pozitsiyani o'zgartirish zarur. Agar erga tushish xavfi bo'lsa, yuqori pozitsiyani tanlash kerak."
    },
    {
      "id": 387,
      "input": "MMA jangida qanday holatlarda zudlik bilan hujum qilish kerak?",
      "output": "Zudlik bilan hujum qilish kerak bo'lgan holatlar — raqib charchagan, kam kuchli yoki xato qilgan paytlarda."
    },
    {
      "id": 388,
      "input": "MMA jangida qanday qilib raqibni jarohatlardan saqlash mumkin?",
      "output": "Jarohatlardan saqlanish uchun to'g'ri himoya pozitsiyalarini saqlash, zarbalardan qochish va og'riqni boshqarish muhim."
    },
    {
      "id": 389,
      "input": "MMA jangida \"knockout\"ni qanday tushuntirish mumkin?",
      "output": "\"Knockout\" — bu raqibning boshiga kuchli zarba berib, uning hushini yo'qotish va jangni yakunlash."
    },
    {
      "id": 390,
      "input": "MMA jangida qanday qilib kuchli pozitsiya olish mumkin?",
      "output": "Kuchli pozitsiya olish uchun raqibni yerga tushirish, bo'g'ish yoki nazorat qilish va yaxshi himoya pozitsiyasini saqlash zarur."
    },
    {
      "id": 391,
      "input": "MMA jangida qancha vaqt davomida tayyorlanish kerak?",
      "output": "MMA jangiga tayyorlanish odatda 8-12 hafta davom etadi, ammo bu jangchining jismoniy holatiga bog'liq."
    },
    {
      "id": 392,
      "input": "MMA jangida raqibni qanday yaxshi bloklash mumkin?",
      "output": "Raqibni yaxshi bloklash uchun zarbalarni oldindan ko'rib chiqish, to'g'ri timing va pozitsiya saqlash zarur."
    },
    {
      "id": 393,
      "input": "MMA jangida qanday zarbalar qanchalik samarali?",
      "output": "Qanchalik aniq va kuchli zarbalar bo'lsa, shunchalik samarali bo'ladi. Yaxshi zarba kombinatsiyalari va o'zgarishlar ko'proq muvaffaqiyatga olib keladi."
    },
    {
      "id": 394,
      "input": "MMA jangida himoya texnikasini qanday rivojlantirish mumkin?",
      "output": "Himoya texnikasini rivojlantirish uchun zarbalarni bloklash, himoya pozitsiyalarini o'rganish va hujumdan keyin tezkor qaytish zarur."
    },
    {
      "id": 395,
      "input": "MMA jangida qanday qilib shoshilmaslik kerak?",
      "output": "Shoshilmaslik uchun, jang davomida sabrli bo'lish, raqibni o'rganish va zarba berishda aniq maqsadni ko'zlash kerak."
    },
    {
      "id": 396,
      "input": "Taekwondo nima?",
      "output": "Taekwondo — janubiy koreys jang san'ati bo'lib, asosan oyoq zarbalariga va tezkor harakatlarga asoslanadi."
    },
    {
      "id": 397,
      "input": "Taekwondo'da qaysi zarbalar eng ko'p ishlatiladi?",
      "output": "Taekwondo'da oyoq zarbalari, ayniqsa, high kick (yuqori zarba), roundhouse kick va spinning kick ko'p ishlatiladi."
    },
    {
      "id": 398,
      "input": "Taekwondo va karate o'rtasidagi farq nima?",
      "output": "Taekwondo ko'proq oyoq zarbalariga e'tibor beradi, karate esa qo'l zarbalariga ko'proq qaratilgan."
    },
    {
      "id": 399,
      "input": "Taekwondo jangida qanday pozitsiyalar mavjud?",
      "output": "Taekwondo jangida \"front stance\" (oldinga qarab pozitsiya), \"back stance\" (orqaga qarab pozitsiya), va \"horse stance\" (ot pozitsiyasi) mavjud."
    },
    {
      "id": 400,
      "input": "Taekwondo jangida raqibni qanday tushirish mumkin?",
      "output": "Taekwondo jangida raqibni o'zingizga tortib, oyoq zarbasi bilan tasodifiy yoki muayyan tushirish texnikalari qo'llaniladi."
    },
    {
      "id": 401,
      "input": "Taekwondo'da eng samarali zarba turi qaysi?",
      "output": "Eng samarali zarba turi – yuqori zarba (high kick), chunki u raqibning boshiga bevosita urish imkonini beradi."
    },
    {
      "id": 402,
      "input": "Taekwondo jangida o'qish qanday ishlatiladi?",
      "output": "Taekwondo jangida o'qish (yoki \"poomsae\") — bu tartibda bajariladigan texnikalar majmuasi bo'lib, har bir poomsae o'ziga xos maqsadga ega."
    },
    {
      "id": 403,
      "input": "Taekwondo jangida qaysi himoya usullari qo'llaniladi?",
      "output": "Taekwondo'da zarbalarni bloklash, \"parry\" texnikalari, qo'l va oyoqlarni qo'llash orqali himoya qilish mumkin."
    },
    {
      "id": 404,
      "input": "Taekwondo'da qaysi turdagi oyoq zarbalarini ishlatish mumkin?",
      "output": "Taekwondo'da \"front kick\", \"side kick\", \"roundhouse kick\" va \"back kick\" kabi oyoq zarbalari ishlatiladi."
    },
    {
      "id": 405,
      "input": "Taekwondo'da qaysi pozitsiyalarda hujum qilish osonroq?",
      "output": "\"Front stance\" yoki \"back stance\" pozitsiyalarida hujum qilish osonroq, chunki bu pozitsiyalar kuchli zarba berish uchun yaxshiroq tayyorlangan."
    },
    {
      "id": 406,
      "input": "Taekwondo jangida qanday raqibni to'liq nazorat qilish mumkin?",
      "output": "Raqibni to'liq nazorat qilish uchun, uning harakatlarini o'qib, to'g'ri pozitsiya saqlash va tezkor zarbalarni qo'llash zarur."
    },
    {
      "id": 407,
      "input": "Taekwondo'da qanday qilib kuchli zarba berish mumkin?",
      "output": "Kuchli zarba berish uchun oyoq mushaklarini kuchaytirish, balansni saqlash va zarbalarni tezkor va to'g'ri bajarish kerak."
    },
    {
      "id": 408,
      "input": "Taekwondo jangida jangchi nima uchun \"kiai\" (hayqiriq) qilishi kerak?",
      "output": "\"Kiai\" — bu jangda kuchni oshirish, raqibni qo'rqitish va o'zining ichki energiyasini yo'naltirish uchun ishlatiladi."
    },
    {
      "id": 409,
      "input": "Taekwondo jangida oyoq zarbalari qanchalik samarali?",
      "output": "Oyoq zarbalari taekwondo'da eng samarali, chunki ular uzun masofadan raqibni urish imkoniyatini beradi va tezkorlik bilan bajariladi."
    },
    {
      "id": 410,
      "input": "Taekwondo'da qanday qilib baland zarba berish mumkin?",
      "output": "Baland zarba berish uchun oyoq mushaklarini kuchaytirish, qadamni baland qilib tashlash va zarbani yuqoriga qarab berish zarur."
    },
    {
      "id": 411,
      "input": "Taekwondo'da nima uchun poomsae o'rganish zarur?",
      "output": "Poomsae o'rganish zarur, chunki u jangchi uchun to'g'ri texnika va harakatlarni rivojlantirishga yordam beradi, shuningdek, o'zgaruvchan vaziyatlarda qanday harakat qilishni o'rgatadi."
    },
    {
      "id": 412,
      "input": "Taekwondo'da o'qish (poomsae) bilan jang qilish o'rtasidagi farq nima?",
      "output": "O'qish (poomsae) — bu tekis va tartibli texnikalarni bajarish bo'lsa, jangda raqibga qarshi real vaziyatlarda kurashish talab etiladi."
    },
    {
      "id": 413,
      "input": "Taekwondo jangida oyoq bilan to'g'ri zarba berish qanday amalga oshiriladi?",
      "output": "Oyoq bilan to'g'ri zarba berish uchun, qadamni aniq va tezkor qilib, oyoqning kuchli qismini (masalan, oyoq to'pi yoki shin) ishlatish zarur."
    },
    {
      "id": 414,
      "input": "Taekwondo jangida raqibni qanday chalg'itish mumkin?",
      "output": "Raqibni chalg'itish uchun, tez-tez o'zgarib turadigan zarba kombinatsiyalarini va pozitsiya o'zgarishlarini qo'llash kerak."
    },
    {
      "id": 415,
      "input": "Taekwondo jangida himoya qilish uchun qanday zarbalar ishlatiladi?",
      "output": "Himoya qilish uchun, qo'llarni va oyoqlarni bloklash, masalan, side kick va front kick zarbalaridan foydalanish mumkin."
    },
    {
      "id": 416,
      "input": "Taekwondo jangida o'zgaruvchan pozitsiyalarni qanday qo'llash kerak?",
      "output": "O'zgaruvchan pozitsiyalarni qo'llash uchun, raqibning harakatlariga mos ravishda tezkor ravishda pozitsiyalarni o'zgartirib, hujumni davom ettirish zarur."
    },
    {
      "id": 417,
      "input": "Taekwondo jangida raqibni qanday tutilishlardan saqlash mumkin?",
      "output": "Raqibni tutilishlardan saqlash uchun, oyoqlarga va qo'llarga tezkor zarbalar berib, uning balansini yo'qotishga harakat qilish zarur."
    },
    {
      "id": 418,
      "input": "Taekwondo jangida qaysi yoshda boshlash mumkin?",
      "output": "Taekwondo jangini 4-5 yoshdan boshlab boshlash mumkin, ammo har qanday yoshdagi odam o'rganish uchun tayyor bo'lishi mumkin."
    },
    {
      "id": 419,
      "input": "Taekwondo'da qanday qilib kuchli zarba berish mumkin?",
      "output": "Kuchli zarba berish uchun oyoqlarning moslashuvchanligi va tezligini oshirish, shuningdek, mushaklarni kuchaytirish zarur."
    },
    {
      "id": 420,
      "input": "Taekwondo jangida qanday himoya texnikalari ishlatiladi?",
      "output": "Himoya texnikalariga qo'lni yoki oyoqni bloklash, qochish, va raqibning harakatlariga moslashuvchan tarzda javob berish kiradi."
    },
    {
      "id": 421,
      "input": "Taekwondo jangida har bir zarbaning turi qanday nomlanadi?",
      "output": "Taekwondo'da zarbalar \"front kick\" (oldinga zarba), \"side kick\" (yon zarba), \"roundhouse kick\" (aylanma zarba) va \"axe kick\" (bolg'a zarba) kabi nomlanadi."
    },
    {
      "id": 422,
      "input": "Taekwondo jangida qanday qilib raqibni taslim qilish mumkin?",
      "output": "Taekwondo'da raqibni taslim qilishning o'ziga xos usullari yo'q, ammo tezkor zarbalar va raqibning xato pozitsiyalaridan foydalanish mumkin."
    },
    {
      "id": 423,
      "input": "Taekwondo jangida oyoq bilan qanday zarbalarni ishlatish kerak?",
      "output": "Oyoq bilan yuqori zarbalar, masalan, \"head kick\" yoki \"spinning kick\" juda samarali, chunki ular tez va kuchli bo'ladi."
    },
    {
      "id": 424,
      "input": "Taekwondo jangida mashg'ulotlar qanday o'zgaradi?",
      "output": "Mashg'ulotlar qismiga jismoniy tayyorgarlik, poomsae (texnika), zarba va himoya mashqlarini kiritish zarur."
    },
    {
      "id": 425,
      "input": "Taekwondo jangida raqibni qanday zarbalar bilan qo'rqitish mumkin?",
      "output": "Tez-tez, kutilmagan zarbalar va kombinatsiyalar qo'rqitish usuli sifatida samarali bo'ladi."
    },
    {
      "id": 426,
      "input": "Taekwondo jangida qancha vaqt davomida tayyorgarlik qilish kerak?",
      "output": "Taekwondo jangiga tayyorlanish uchun odatda 2-3 oy davomida muntazam mashg'ulotlar o'tkazish kerak."
    },
    {
      "id": 427,
      "input": "Taekwondo jangida qaysi pozitsiyalar eng samarali?",
      "output": "\"Front stance\" (oldinga qarab pozitsiya) va \"back stance\" (orqaga qarab pozitsiya) eng samarali hisoblanadi, chunki ular kuch va barqarorlikni saqlaydi."
    },
    {
      "id": 428,
      "input": "Taekwondo'da qanday qilib yuqori zarba berish o'rganiladi?",
      "output": "Yuqori zarbani o'rganish uchun oyoq mushaklarini kuchaytirish, yuqori pozitsiyalarda qadamni uzunroq tashlash va muvozanatni saqlash kerak."
    },
    {
      "id": 429,
      "input": "Taekwondo'da qaysi yoshda yuqori darajaga erishish mumkin?",
      "output": "Taekwondo'da yuqori darajaga erishish mumkin, ammo buni ko'p yillik mashg'ulotlar, sabr va doimiy takomillashtirish orqali amalga oshirish kerak."
    },
    {
      "id": 430,
      "input": "Taekwondo jangida raqibning pozitsiyasini qanday o'qish mumkin?",
      "output": "Raqibning pozitsiyasini o'qish uchun uning harakatlarini diqqat bilan kuzatish va raqibning og'irligi va balansiga qarab mos javob berish kerak."
    },
    {
      "id": 431,
      "input": "Taekwondo'da o'qishning roli qanday?",
      "output": "O'qish (poomsae) taekwondo jangchisi uchun zarba va harakatlarni o'rganish, shuningdek, tartib va disiplinani rivojlantirishga yordam beradi."
    },
    {
      "id": 432,
      "input": "Taekwondo jangida qanday qilib yuqori darajada himoya qilish mumkin?",
      "output": "Yuqori darajada himoya qilish uchun tezkor va aniq bloklash texnikalarini, raqibning zarbalarini oldindan sezib, harakatlarga javob berish kerak."
    },
    {
      "id": 433,
      "input": "Taekwondo jangida \"kiai\"ning roli nima?",
      "output": "\"Kiai\" jangda raqibni qo'rqitish, jangchining energiyasini oshirish va zarba kuchini kuchaytirish uchun ishlatiladi."
    },
    {
      "id": 434,
      "input": "Taekwondo jangida qanday qilib uzoq muddatgacha chidamlilikni oshirish mumkin?",
      "output": "Uzoq muddatli chidamlilikni oshirish uchun kardiyo mashqlari, uzoq masofaga yugurish va interval mashqlari yordam beradi."
    },
    {
      "id": 435,
      "input": "Taekwondo jangida raqibga qanday qilib aniqlik bilan zarba berish mumkin?",
      "output": "Aniqlik bilan zarba berish uchun zarbani to'g'ri va aniq bajarish, raqibning himoya pozitsiyasini buzish va zarbaning kuchini to'g'ri kanalizatsiya qilish zarur."
    },
    {
      "id": 436,
      "input": "Taekwondo'da qanday qilib raqibni chalg'itish mumkin?",
      "output": "Raqibni chalg'itish uchun tezkor harakatlar, kuchli va kutilmagan zarba kombinatsiyalaridan foydalanish kerak."
    },
    {
      "id": 437,
      "input": "Taekwondo jangida qanday qilib tezkor hujum qilish mumkin?",
      "output": "Tezkor hujum qilish uchun raqibni xavotirga solib, jismoniy kuchni va pozitsiyalarni tezda o'zgartirib hujum qilish zarur."
    },
    {
      "id": 438,
      "input": "Taekwondo jangida qanday qilib mustahkam pozitsiyada qolish mumkin?",
      "output": "Mustahkam pozitsiyada qolish uchun har doim oyoq va tana mushaklarini kuchaytirish, yaxshi balansni saqlash va o'z pozitsiyani doimiy tekshirish zarur."
    },
    {
      "id": 439,
      "input": "Taekwondo jangida qaysi zarba turlari ko'proq ishlatiladi?",
      "output": "Taekwondo jangida \"side kick\", \"roundhouse kick\" va \"front kick\" kabi zarbalar eng ko'p ishlatiladi."
    },
    {
      "id": 440,
      "input": "Taekwondo jangida qanday qilib balansni saqlash kerak?",
      "output": "Balansni saqlash uchun oyoqlarni kengroq qo'yish, tana markazini pastroq tutish va harakatlarni to'g'ri vaqt bilan bajarish zarur."
    },
    {
      "id": 441,
      "input": "Taekwondo jangida himoya qilish uchun qaysi texnikalar ishlatiladi?",
      "output": "Himoya qilish uchun, zarbalarni bloklash, raqibning harakatlariga moslashish va qochish texnikalarini qo'llash kerak."
    },
    {
      "id": 442,
      "input": "Taekwondo'da raqibni qanday qilib boshqarish mumkin?",
      "output": "Raqibni boshqarish uchun, uning harakatlarini to'g'ri tahlil qilish va unga qarshi mos zarbalar yoki bloklashlarni qo'llash zarur."
    },
    {
      "id": 443,
      "input": "Taekwondo'da oyoqni qanday qilib kuchli va aniq zarba qilish uchun tayyorlash mumkin?",
      "output": "Oyoq mushaklarini kuchaytirish, oyoqni to'g'ri pozitsiyada ushlab, aniq maqsadga zarba berishni o'rganish kerak."
    },
    {
      "id": 444,
      "input": "Taekwondo'da o'qish va jang o'rtasidagi farq nima?",
      "output": "O'qish (poomsae) — bu texnikalar va harakatlarni tartibda bajarish, jang esa raqibga qarshi real vaziyatda kurashishdir."
    },
    {
      "id": 445,
      "input": "Taekwondo jangida qanday qilib zarba va himoyani birlashtirish mumkin?",
      "output": "Zarba va himoyani birlashtirish uchun, birinchi navbatda himoya texnikasini qo'llash va keyin osonlik bilan zarbaga o'tish kerak."
    },
    {
      "id": 446,
      "input": "Taekwondo jangida raqibni qanday qilib charchatish mumkin?",
      "output": "Raqibni charchatish uchun tez-tez hujum qilib, uning balansini yo'qotish va masofani saqlash zarur."
    },
    {
      "id": 447,
      "input": "Taekwondo jangida oyoq zarbalari qancha samarali?",
      "output": "Oyoq zarbalari taekwondo jangida juda samarali, chunki ular uzoq masofaga yetib boradi va yuqori tezlikda amalga oshiriladi."
    },
    {
      "id": 448,
      "input": "Taekwondo'da \"spinning kick\" qanday amalga oshiriladi?",
      "output": "\"Spinning kick\" uchun, avvalo raqibga qarab turgan holda 180° aylanish kerak, so'ngra oyoq bilan yuqori zarba beriladi."
    },
    {
      "id": 449,
      "input": "Taekwondo jangida qanday qilib raqibning hujumidan qochish mumkin?",
      "output": "Raqibning hujumidan qochish uchun, vaqtida va tezkor harakat qilish, masofani oshirish va pozitsiyani o'zgartirish kerak."
    },
    {
      "id": 450,
      "input": "Taekwondo jangida qanday qilib himoya pozitsiyasini o'zgartirish mumkin?",
      "output": "Himoya pozitsiyasini o'zgartirish uchun, oyoqlarni tezda joylashtirib, jismoniy holatni saqlash va zarbalarni boshqarish kerak."
    },
    {
      "id": 451,
      "input": "Taekwondo jangida qanday qilib yuqori darajaga erishish mumkin?",
      "output": "Yuqori darajaga erishish uchun, muntazam mashg'ulotlar, o'zgaruvchan strategiyalar va texnikalarni o'rganish zarur."
    },
    {
      "id": 452,
      "input": "Taekwondo'da qanday qilib to'g'ri urushni boshqarish mumkin?",
      "output": "To'g'ri urushni boshqarish uchun, jismoniy va ruhiy tayyorgarlik, raqibning xatolaridan foydalanish va vaqtni to'g'ri boshqarish zarur."
    },
    {
      "id": 453,
      "input": "Taekwondo'da qanday qilib tezkor javob bera olish mumkin?",
      "output": "Tezkor javob berish uchun, jangda o'zgaruvchan pozitsiyalarni tezda bajarish, raqibning harakatlarini oldindan sezish zarur."
    },
    {
      "id": 454,
      "input": "Taekwondo'da qanday qilib to'g'ri pozitsiyalarni saqlash kerak?",
      "output": "To'g'ri pozitsiyani saqlash uchun, oyoqlarni turg'un va aniq holatda qo'yish, tana markazini to'g'ri joylashtirish kerak."
    },
    {
      "id": 455,
      "input": "Taekwondo jangida raqibni qanday chalg'itish mumkin?",
      "output": "Raqibni chalg'itish uchun tezkor harakatlar, kutilmagan zarba va pozitsiya o'zgarishlari yordamida uni chalg'itish mumkin."
    },
    {
      "id": 456,
      "input": "Taekwondo jangida qanday qilib yaxshi himoya pozitsiyasini saqlash mumkin?",
      "output": "Himoya pozitsiyasini saqlash uchun, oyoqlarning mustahkam joylashuvi va har doim raqibning zarbalariga tayyor bo'lish zarur."
    },
    {
      "id": 457,
      "input": "Taekwondo jangida oyoq zarbalarini qanday kuchaytirish mumkin?",
      "output": "Oyoq zarbalarini kuchaytirish uchun oyoq mushaklarini rivojlantirish, shuningdek, balandlik va tezlikni oshirish zarur."
    },
    {
      "id": 458,
      "input": "Taekwondo'da qanday qilib muvozanatni yaxshilash mumkin?",
      "output": "Muvozanatni yaxshilash uchun, oyoqlarning joylashuvini va tana markazini nazorat qilish, shuningdek, kuchli va barqaror pozitsiyalarni ishlatish zarur."
    },
    {
      "id": 459,
      "input": "Taekwondo jangida qanday qilib raqibning zaif joylariga hujum qilish mumkin?",
      "output": "Raqibning zaif joylariga, masalan, bosh, bo'yin yoki qorin qismlariga aniq zarbalar berish mumkin."
    },
    {
      "id": 460,
      "input": "Taekwondo jangida qanday qilib himoya qilishda muvaffaqiyat qozonish mumkin?",
      "output": "Himoya qilishda muvaffaqiyat qozonish uchun raqibning harakatlarini oldindan sezish, tezkor bloklash va zarbalarga tayyor turish zarur."
    },
    {
      "id": 461,
      "input": "Taekwondo jangida qanday qilib zarba va himoyani to'g'ri birlashtirish mumkin?",
      "output": "Zarba va himoyani birlashtirish uchun, hujumdan keyin darhol bloklash texnikalarini qo'llash va raqibning harakatlarini oldindan sezish kerak."
    },
    {
      "id": 462,
      "input": "Taekwondo'da qanday qilib o'qishni yaxshilash mumkin?",
      "output": "O'qishni yaxshilash uchun, poomsae (tekinikalarni) muntazam ravishda takrorlash, har bir harakatni aniq bajarishga intilish zarur."
    },
    {
      "id": 463,
      "input": "Taekwondo jangida qanday qilib raqibni to'g'ri boshqarish mumkin?",
      "output": "Raqibni boshqarish uchun, uning harakatlarini tahlil qilish va unga qarshi yaxshi tayyorlangan zarbalar qo'llash kerak."
    },
    {
      "id": 464,
      "input": "Basketbol nima?",
      "output": "Basketbol — bu ikki jamoa o'rtasida o'ynaladigan sport turi bo'lib, maqsad raqibning savatiga to'pni tashlashdir."
    },
    {
      "id": 465,
      "input": "Basketbol o'yinida qancha o'yinchi bo'ladi?",
      "output": "Basketbol o'yinida har bir jamoada 5 o'yinchi bo'ladi."
    },
    {
      "id": 466,
      "input": "Basketbol o'yinida qaysi pozitsiyalar mavjud?",
      "output": "Basketbol o'yinida asosiy pozitsiyalar: himoyachi, hujumchi, markaz va uchinchi pog'ona (small forward, power forward)."
    },
    {
      "id": 467,
      "input": "Basketbol o'yinida qanday himoya texnikalari mavjud?",
      "output": "Himoya texnikalariga zarba bloklash, raqibni ta'qib qilish, qo'lda to'pni olib olish (steal) va o'z pozitsiyasini saqlash kiradi."
    },
    {
      "id": 468,
      "input": "Basketbol o'yinida qanday qilib samarali to'pni tashlash mumkin?",
      "output": "Samarali to'pni tashlash uchun, to'pni yuqoriga va to'g'ri burchakda ushlash, tizzani bukib, harakatni kuchli va aniqlik bilan bajarish kerak."
    },
    {
      "id": 469,
      "input": "Basketbol o'yinida qaysi turdagi zarbalar ishlatiladi?",
      "output": "Basketbolda \"layup\" (yaqin masofadan savatga urish), \"jump shot\" (sakrab to'pni tashlash), va \"dunk\" (savatchaga to'pni kuch bilan urish) kabi zarbalar ishlatiladi."
    },
    {
      "id": 470,
      "input": "Basketbolda \"assist\" nima?",
      "output": "\"Assist\" — bu bir o'yinchining raqibni chalg'itib yoki joylashib, uning to'pni tashlashiga yordam berishidir."
    },
    {
      "id": 471,
      "input": "Basketbol o'yinida qanday qilib yaxshi himoya qilish mumkin?",
      "output": "Yaxshi himoya qilish uchun, raqibning harakatlarini oldindan sezish, pozitsiyani to'g'ri tanlash va savatga yaqinlashishga ruxsat bermaslik kerak."
    },
    {
      "id": 472,
      "input": "Basketbol o'yinida qanday qilib samarali hujum qilish mumkin?",
      "output": "Samarali hujum qilish uchun, to'pni tezda o'zgartirish, kutilmagan paslar va to'pni yaxshi joylashgan o'yinchiga uzatish zarur."
    },
    {
      "id": 473,
      "input": "Basketbol o'yinida \"fast break\" nima?",
      "output": "\"Fast break\" — bu jamoa raqibning hujumidan keyin tezda hujumga o'tishi va savatga yaqinlashishidir."
    },
    {
      "id": 474,
      "input": "Basketbol o'yinida qanday qilib to'pni yaxshi uzatish mumkin?",
      "output": "To'pni yaxshi uzatish uchun, to'pni aniq va kuchli uzatish, uzoq masofada ham to'pni yengil va aniq tarzda uzatish zarur."
    },
    {
      "id": 475,
      "input": "Basketbolda \"rebound\" nima?",
      "output": "\"Rebound\" — bu to'pning savatdan yoki yuzadan qaytib kelganidan so'ng, uni olib olishdir."
    },
    {
      "id": 476,
      "input": "Basketbol o'yinida qanday qilib o'yinchilarni motivatsiya qilish mumkin?",
      "output": "O'yinchilarni motivatsiya qilish uchun, doimiy rag'batlantirish, yaxshi o'yin namoyish qilish va jamoaviy ruhni rivojlantirish zarur."
    },
    {
      "id": 477,
      "input": "Basketbol o'yinida qaysi jismoniy ko'nikmalar eng muhim?",
      "output": "Basketbol o'yinida tezlik, koordinatsiya, kuch va chidamlilik kabi jismoniy ko'nikmalar eng muhim hisoblanadi."
    },
    {
      "id": 478,
      "input": "Basketbol o'yinida qanday qilib yaxshi paslar berish mumkin?",
      "output": "Yaxshi paslar berish uchun, raqibning pozitsiyasini kuzatish, to'pni yaxshi boshqarish va aniq ko'rinishda pas berish kerak."
    },
    {
      "id": 479,
      "input": "Basketbolda \"screen\" (blok) nima?",
      "output": "\"Screen\" yoki \"blok\" — bu bir o'yinchining raqibni to'sib, jamoasidagi boshqa o'yinchiga yo'l ochishidir."
    },
    {
      "id": 480,
      "input": "Basketbol o'yinida qanday qilib to'pni tezkor tarzda olib olish mumkin?",
      "output": "Tezkor tarzda to'pni olib olish uchun, to'pni raqibdan vaqtida olish va pozitsiyani tezda o'zgartirish zarur."
    },
    {
      "id": 481,
      "input": "Basketbolda qaysi turdagi sakrashlar ishlatiladi?",
      "output": "Basketbolda \"layup\", \"jump shot\", \"dunk\", va \"alley-oop\" kabi sakrashlar ishlatiladi."
    },
    {
      "id": 482,
      "input": "Basketbolda \"triple-double\" nima?",
      "output": "\"Triple-double\" — bu o'yinchi uchta asosiy statistik ko'rsatkichni (to'plar, assist, rebound) bir o'yinda ikki xonada (10) va undan ortiq bo'lgan holatdir."
    },
    {
      "id": 483,
      "input": "Basketbolda to'pni uzatishda qanday xatolarni qilish mumkin?",
      "output": "Xatolar orasida to'pni noto'g'ri uzatish, raqibga uzatish, uzoq masofada aniq emas yoki o'ylangan joyga uzatish kabi holatlar mavjud."
    },
    {
      "id": 484,
      "input": "Basketbol o'yinida qanday qilib raqibni chalg'itish mumkin?",
      "output": "Raqibni chalg'itish uchun, tezkor harakatlar, noto'g'ri yo'nalishlar va ko'p o'zgaruvchan paslardan foydalanish kerak."
    },
    {
      "id": 485,
      "input": "Basketbol o'yinida \"offensive foul\" nima?",
      "output": "\"Offensive foul\" — bu hujum qilayotgan jamoaning raqibga to'sqinlik qilishi, masalan, \"charging\" (yo'lni to'sish) yoki shaxsiy xatolarni qilishidir."
    },
    {
      "id": 486,
      "input": "Basketbol o'yinida qaysi vazifalar birinchi o'rinda turadi?",
      "output": "Birinchi o'rinda o'yinchilarni himoya qilish, jamoa ruhini qo'llab-quvvatlash, to'pni aniq va samarali tashlash va assistlar berish turadi."
    },
    {
      "id": 487,
      "input": "Basketbolda \"double dribble\" nima?",
      "output": "\"Double dribble\" — bu to'pni ikki marta o'ynab, boshqacha holatda dribllashni boshlashdir, bu qoidabuzarlik hisoblanadi."
    },
    {
      "id": 488,
      "input": "Basketbol o'yinida qanday qilib o'yinni qaytarish mumkin?",
      "output": "O'yinni qaytarish uchun jamoaning birgalikda ishlashini ta'minlash, to'pni tez va aniq uzatish, shuningdek, raqibni yaxshi himoya qilish kerak."
    },
    {
      "id": 489,
      "input": "Basketbol o'yinida jismoniy tayyorgarlik qanday ahamiyatga ega?",
      "output": "Jismoniy tayyorgarlik basketbolda juda muhim, chunki o'yinchilar tezkor harakatlanish, sakrash, yengil dribllash va to'pni aniq tashlash uchun jismoniy tayyor bo'lishlari kerak."
    },
    {
      "id": 490,
      "input": "Basketbolda \"zone defense\" nima?",
      "output": "\"Zone defense\" — bu himoya turidir, unda har bir himoyachi o'z hududida raqibni kuzatib, zarba berishga yoki pas berishga to'sqinlik qiladi."
    },
    {
      "id": 491,
      "input": "Basketbol o'yinida \"man-to-man defense\" qanday ishlaydi?",
      "output": "\"Man-to-man defense\" — bu himoya turida har bir himoyachi o'z raqibini shaxsiy ravishda kuzatib, unga qarshi kurashadi."
    },
    {
      "id": 492,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"free throw\" (erkin zarba) olish mumkin?",
      "output": "Yaxshi \"free throw\" uchun to'g'ri holatda turing, qo'llarni tik tuting, to'pni yuqori va aniq tashlang."
    },
    {
      "id": 493,
      "input": "Basketbol o'yinida \"pick and roll\" nima?",
      "output": "\"Pick and roll\" — bu ikki o'yinchi o'rtasidagi hamkorlikdagi harakat bo'lib, birinchi o'yinchi raqibni to'sib, ikkinchisi savatga to'p tashlash uchun ochiq bo'ladi."
    },
    {
      "id": 494,
      "input": "Basketbol o'yinida raqibni qanday qilib samarali bloklash mumkin?",
      "output": "Raqibni samarali bloklash uchun pozitsiyani to'g'ri tanlash, to'pni qaytarib olishga tayyor turish va vaqtida zarbani to'xtatish zarur."
    },
    {
      "id": 495,
      "input": "Basketbol o'yinida qanday qilib uzoq masofaga aniq uzatish mumkin?",
      "output": "Uzoq masofaga aniq uzatish uchun to'pni kuch bilan, lekin nazoratli tarzda uzatish va raqibni chalg'itib, aniqlikni saqlash kerak."
    },
    {
      "id": 496,
      "input": "Basketbol o'yinida raqibning \"screen\" (blok)idan qanday o'tish mumkin?",
      "output": "Raqibning \"screen\"idan o'tish uchun tezkor harakatlar, o'z pozitsiyasini tezda o'zgartirish va raqibni aldash zarur."
    },
    {
      "id": 497,
      "input": "Basketbol o'yinida qanday qilib jamoaviy o'yinni rivojlantirish mumkin?",
      "output": "Jamoaviy o'yinni rivojlantirish uchun doimiy ravishda paslarni o'zaro almashish, yaxshi himoya qilish va birgalikda strategiyalarni amalga oshirish kerak."
    },
    {
      "id": 498,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"fast break\" tashkil etish mumkin?",
      "output": "\"Fast break\"ni tashkil etish uchun, raqibning hujumidan so'ng to'pni tezda uzatish va birgalikda tez harakat qilib, ochiq pozitsiyaga kirish zarur."
    },
    {
      "id": 499,
      "input": "Basketbol o'yinida \"turnover\" nima?",
      "output": "\"Turnover\" — bu o'yinchi tomonidan to'pni yo'qotish yoki raqibga noto'g'ri uzatish natijasida, raqibning hujumga o'tishidir."
    },
    {
      "id": 500,
      "input": "Basketbol o'yinida qanday qilib raqibni yaxshi kuzatish mumkin?",
      "output": "Raqibni yaxshi kuzatish uchun uning harakatlarini oldindan taxmin qilish, qo'ldan to'pni olib olishga tayyor bo'lish zarur."
    },
    {
      "id": 501,
      "input": "Basketbol o'yinida qanday qilib o'zgaruvchan strategiyalarni qo'llash mumkin?",
      "output": "O'zgaruvchan strategiyalarni qo'llash uchun jamoa o'yinchilari orasida yaxshi kommunikatsiya va moslashuvchanlik kerak."
    },
    {
      "id": 502,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"block shot\" (zarba bloklash) qilish mumkin?",
      "output": "Yaxshi \"block shot\" qilish uchun, raqibning zarba berayotgan paytida to'g'ri pozitsiyada turish va zarbani to'xtatishga tayyor bo'lish kerak."
    },
    {
      "id": 503,
      "input": "Basketbol o'yinida qanday qilib aniq \"jump shot\" (sakrab zarba) olish mumkin?",
      "output": "\"Jump shot\"ni olish uchun, yaxshi balansni saqlab, tizzalarni bukib, sakrab to'pni yuqoriga va to'g'ri burchakda tashlash kerak."
    },
    {
      "id": 504,
      "input": "Basketbol o'yinida \"traveling\" nima?",
      "output": "\"Traveling\" — bu o'yinchi to'pni olib yurib, poyabzalini o'zgartirganidan keyin, unga ruxsat etilmagan masofada harakat qilishi hisoblanadi."
    },
    {
      "id": 505,
      "input": "Basketbol o'yinida \"double team\" nima?",
      "output": "\"Double team\" — bu ikki himoyachi bir vaqtning o'zida bitta raqibni to'sib, uning harakatlarini cheklashga harakat qilishidir."
    },
    {
      "id": 506,
      "input": "Basketbol o'yinida \"technical foul\" nima?",
      "output": "\"Technical foul\" — bu o'yinchining yoki murabbiyning jamoaga yoki hakamlar qaroriga nisbatan qoidabuzarlik yoki norozilik bildirishidir."
    },
    {
      "id": 507,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"assist\" olish mumkin?",
      "output": "Yaxshi \"assist\" olish uchun, to'pni to'g'ri vaqt va joyda uzatish, jamoa doshingizni ochiq pozitsiyaga chiqarish zarur."
    },
    {
      "id": 508,
      "input": "Basketbol o'yinida \"3-point shot\" qanday amalga oshiriladi?",
      "output": "\"3-point shot\" — bu savatdan uzoqda joylashgan hududdan to'pni tashlash, shu bilan 3 ballni qo'lga kiritishdir."
    },
    {
      "id": 509,
      "input": "Basketbol o'yinida \"box out\" nima?",
      "output": "\"Box out\" — bu himoyachi o'z raqibidan savatga qarshi to'pni olish uchun o'z tanasini to'sib, raqibni orqaga itarishdir."
    },
    {
      "id": 510,
      "input": "Basketbol o'yinida qanday qilib to'pni tezkor uzatish mumkin?",
      "output": "Tezkor uzatish uchun to'pni ko'zni qamashtirmay, aniq va kuchli tarzda uzatish, harakatlarni tezlashtirish zarur."
    },
    {
      "id": 511,
      "input": "Basketbol o'yinida qanday qilib jamoaviy ruhni qo'llab-quvvatlash mumkin?",
      "output": "Jamoaviy ruhni qo'llab-quvvatlash uchun, o'zaro rag'batlantirish, muvaffaqiyatlarni birgalikda nishonlash va o'zgarishlarga tayyor bo'lish kerak."
    },
    {
      "id": 512,
      "input": "Basketbol o'yinida \"pick and pop\" nima?",
      "output": "\"Pick and pop\" — bu harakatda bir o'yinchi raqibni bloklab, keyin savatga uzoq masofadan zarba berish uchun ochiq joyni egallaydi."
    },
    {
      "id": 513,
      "input": "Basketbol o'yinida \"full-court press\" nima?",
      "output": "\"Full-court press\" — bu himoya strategiyasi bo'lib, jamoa raqibni butun maydonda ta'qib qilib, harakatini cheklashga harakat qiladi."
    },
    {
      "id": 514,
      "input": "Basketbol o'yinida \"fast break\"ni qanday qilib samarali bajarish mumkin?",
      "output": "\"Fast break\"ni samarali bajarish uchun to'pni tezda o'zgartirish, ochiq maydonda tezkor yugurish va yaxshi pas berish zarur."
    },
    {
      "id": 515,
      "input": "Basketbol o'yinida \"floater\" zarbasi nima?",
      "output": "\"Floater\" zarbasi — bu baland va yumshoq tarzda, raqib himoyachilaridan osonlik bilan o'tish uchun amalga oshiriladigan zarba turidir."
    },
    {
      "id": 516,
      "input": "Basketbol o'yinida \"pump fake\" nima?",
      "output": "\"Pump fake\" — bu raqibni aldash usuli bo'lib, o'yinchi to'pni tashlashga tayyor ekanligini ko'rsatib, keyin hujumni o'zgartiradi."
    },
    {
      "id": 517,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"defensive rebound\" olish mumkin?",
      "output": "Yaxshi \"defensive rebound\" olish uchun, o'z pozitsiyasini to'g'ri tanlab, raqibni orqaga itarib, to'pni ushlab qolish kerak."
    },
    {
      "id": 518,
      "input": "Basketbol o'yinida \"inbound pass\" qanday amalga oshiriladi?",
      "output": "\"Inbound pass\" — bu to'pni jamoaga uzatishning boshlang'ich usuli bo'lib, uni to'g'ri burchakda va aniq tarzda amalga oshirish zarur."
    },
    {
      "id": 519,
      "input": "Basketbol o'yinida \"buzzer beater\" nima?",
      "output": "\"Buzzer beater\" — bu o'yin vaqtining oxirida amalga oshirilgan va vaqt tugaganidan keyin kiritilgan zarba hisoblanadi."
    },
    {
      "id": 520,
      "input": "Basketbol o'yinida \"sixth man\" kim?",
      "output": "\"Sixth man\" — bu o'yin boshida maydonga tushmaydigan, lekin o'yin davomida katta ta'sir ko'rsatish uchun tayyor bo'lgan zaxiradagi o'yinchi."
    },
    {
      "id": 521,
      "input": "Basketbol o'yinida \"loose ball\" nima?",
      "output": "\"Loose ball\" — bu to'pni hech bir jamoa egallamagan va ikkala jamoa tomonidan kurashayotgan holatdir."
    },
    {
      "id": 522,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"offensive rebound\" olish mumkin?",
      "output": "\"Offensive rebound\"ni olish uchun, savatdan qaytgan to'pni tezda ushlab, yangi hujum boshlash kerak."
    },
    {
      "id": 523,
      "input": "Basketbol o'yinida qanday qilib to'pni bir joydan ikkinchi joyga aniq uzatish mumkin?",
      "output": "To'pni aniq uzatish uchun, yaxshi ushlash va raqibni chalg'itib, pozitsiyani to'g'ri tanlash kerak."
    },
    {
      "id": 524,
      "input": "Basketbol o'yinida \"screen assist\" nima?",
      "output": "\"Screen assist\" — bu o'yinchining raqibni bloklab, jamoasidagi boshqa o'yinchiga zarba berish uchun imkoniyat yaratishidir."
    },
    {
      "id": 525,
      "input": "Basketbol o'yinida \"clutch\" o'yinchi kim?",
      "output": "\"Clutch\" o'yinchi — bu o'yinning muhim daqiqalarida, masalan, oxirgi soniyalarda yaxshi o'ynab, g'alaba keltiradigan o'yinchidir."
    },
    {
      "id": 526,
      "input": "Basketbol o'yinida \"and-one\" nima?",
      "output": "\"And-one\" — bu o'yinchi to'pni tashlab, raqibning himoyasiga qarshi ko'rsatma bilan savatga zarba berishi va qo'shimcha erkin zarba olishidir."
    },
    {
      "id": 527,
      "input": "Basketbol o'yinida \"triple threat\" pozitsiyasi qanday?",
      "output": "\"Triple threat\" pozitsiyasi — bu o'yinchining to'pni olib turgan paytda, zarba berish, pas berish va dribllash uchun imkoniyat yaratadigan pozitsiya turidir."
    },
    {
      "id": 528,
      "input": "Basketbol o'yinida qanday qilib kuchli \"crossover dribble\" qilish mumkin?",
      "output": "\"Crossover dribble\"ni kuchli qilish uchun, raqibni aldash uchun tezkor harakatlar va qo'llarni mos ravishda ishlatish zarur."
    },
    {
      "id": 529,
      "input": "Basketbol o'yinida \"alley-oop\" nima?",
      "output": "\"Alley-oop\" — bu bir o'yinchi to'pni havoga tashlab, boshqa o'yinchi uni havo orqali tutib, to'g'ridan-to'g'ri savatga urishi hisoblanadi."
    },
    {
      "id": 530,
      "input": "Basketbol o'yinida \"fast break\"da qanday qilib to'g'ri pozitsiyada bo'lish kerak?",
      "output": "\"Fast break\"da to'g'ri pozitsiyada bo'lish uchun, o'yinchilar o'rtasida tezkor kommunikatsiya, ochiq maydonni egallash va tezkor harakat qilish zarur."
    },
    {
      "id": 531,
      "input": "Basketbol o'yinida \"double dribble\" qanday aniqlanadi?",
      "output": "\"Double dribble\" — bu o'yinchi to'pi bilan dribblashni bir necha marta boshlab, keyin yana bir necha marta o'ynab yuborishi hisoblanadi."
    },
    {
      "id": 532,
      "input": "Basketbol o'yinida \"swish\" nima?",
      "output": "\"Swish\" — bu zarbaning to'liq savatga kirishi, ya'ni to'p savatga tegmasdan to'g'ri kiritilishi hisoblanadi."
    },
    {
      "id": 533,
      "input": "Basketbol o'yinida \"rebound\" olishda qanday texnikalar ishlatiladi?",
      "output": "\"Rebound\" olishda to'g'ri pozitsiya, raqibni ortda qoldirish va to'pni ushlab qolish uchun kuchli jismoniy harakatlar zarur."
    },
    {
      "id": 534,
      "input": "Basketbol o'yinida \"court vision\" nima?",
      "output": "\"Court vision\" — bu o'yinchining maydondagi boshqa o'yinchilarni kuzatish, paslar berish va raqibning pozitsiyasini aniqlash qobiliyatidir."
    },
    {
      "id": 535,
      "input": "Basketbol o'yinida \"charge\" nima?",
      "output": "\"Charge\" — bu hujumchi o'yinchining himoyachi o'yinchi tomonidan to'siqlanganida, ya'ni himoyachiga to'liq hujum qilib, unga zarba berishidir."
    },
    {
      "id": 536,
      "input": "Basketbol o'yinida \"backcourt violation\" nima?",
      "output": "\"Backcourt violation\" — bu o'yinchi to'pni o'z maydoniga qaytarmasdan, hujum qilish uchun orqaga o'tishi hisoblanadi."
    },
    {
      "id": 537,
      "input": "Basketbol o'yinida \"shot clock\" nima?",
      "output": "\"Shot clock\" — bu to'pni uzatish uchun belgilangan vaqtni ko'rsatuvchi qurilma, odatda 24 soniya. Agar vaqt tugasa, jamoa to'pni yo'qotadi."
    },
    {
      "id": 538,
      "input": "Basketbol o'yinida \"over and back\" nima?",
      "output": "\"Over and back\" — bu o'yinchi to'pni o'z maydoniga qaytarish uchun ortga o'tganida, to'pni qabul qilganda qayta orqaga o'tishi hisoblanadi."
    },
    {
      "id": 539,
      "input": "Basketbol o'yinida \"offensive foul\" nima?",
      "output": "\"Offensive foul\" — bu hujumchi tomonidan raqibga to'siqlik qilish yoki belgilangan qoidalarni buzish hisoblanadi."
    },
    {
      "id": 540,
      "input": "Basketbol o'yinida \"basket interference\" nima?",
      "output": "\"Basket interference\" — bu o'yinchi to'pni savatga kiritish yoki bloklash paytida savatning ustki qismiga qo'l tegsa, bu qoidabuzarlik hisoblanadi."
    },
    {
      "id": 541,
      "input": "Basketbol o'yinida \"screen\" qanday ishlaydi?",
      "output": "\"Screen\" — bu o'yinchi raqibni bloklab, jamoasiga o'z pozitsiyasini ochish uchun yo'l ochadi. Bu himoya uchun samarali texnika hisoblanadi."
    },
    {
      "id": 542,
      "input": "Basketbol o'yinida qanday qilib yaxshi \"pass fake\" qilish mumkin?",
      "output": "\"Pass fake\" qilish uchun, raqibni aldash maqsadida, to'pni uzatishga tayyor ekanligingizni ko'rsating, keyin o'zingizga kerakli zarbani bajarish kerak."
    },
    {
      "id": 543,
      "input": "Basketbol o'yinida \"double team\"ni qanday samarali yengish mumkin?",
      "output": "\"Double team\"ni yengish uchun, to'pni tezda uzatish, ochiq o'yinchiga pas berish va raqiblarni chalg'itish zarur."
    },
    {
      "id": 544,
      "input": "Basketbol o'yinida \"no-look pass\" nima?",
      "output": "\"No-look pass\" — bu o'yinchining to'pni qarashmasdan, boshqa o'yinchiga aniq tarzda uzatishidir. Bu texnika raqibni aldagan holda amalga oshiriladi."
    },
    {
      "id": 545,
      "input": "Basketbol o'yinida \"free throw line\" qayerda joylashgan?",
      "output": "\"Free throw line\" — bu savatdan 4.6 metr (15 fut) masofada joylashgan va o'yinchi erkin zarbani amalga oshirishi uchun belgilangan joy."
    },
    {
      "id": 546,
      "input": "Basketbol o'yinida \"alley-oop\"ni qanday amalga oshirish mumkin?",
      "output": "\"Alley-oop\"ni amalga oshirish uchun, bir o'yinchi to'pni havoga tashlab, boshqa o'yinchi uni tutib, savatga to'liq kiritishi kerak."
    },
    {
      "id": 547,
      "input": "Basketbol o'yinida qanday qilib to'pni yaxshi dribblash mumkin?",
      "output": "Yaxshi dribblash uchun, pastda to'pni ushlab, tezkor harakatlar va yaxshi koordinatsiya bilan to'pni boshqarish kerak."
    },
    {
      "id": 548,
      "input": "Basketbol o'yinida \"spin move\" nima?",
      "output": "\"Spin move\" — bu o'yinchining raqibni aldash uchun aylanish harakati bilan to'pni olib o'tishi hisoblanadi."
    },
    {
      "id": 549,
      "input": "Basketbol o'yinida \"take charge\" (to'siqlik qilish) qanday amalga oshiriladi?",
      "output": "\"Take charge\"ni amalga oshirish uchun, himoyachi raqibga qarshi to'g'ri pozitsiyada turib, to'siqlik qilish orqali hujumchi to'pni yo'qotishiga olib keladi."
    },
    {
      "id": 550,
      "input": "Basketbol o'yinida \"loose ball foul\" nima?",
      "output": "\"Loose ball foul\" — bu to'pni raqibga olib ketishga uringan o'yinchi tomonidan amalga oshirilgan xato hisoblanadi."
    },
    {
      "id": 551,
      "input": "Basketbol o'yinida \"jump ball\" nima?",
      "output": "\"Jump ball\" — bu o'yin boshlanishida yoki to'plarni egallashda ikki o'yinchi orasida savolni yechish uchun hakam tomonidan amalga oshiriladigan vaziyatdir."
    },
    {
      "id": 552,
      "input": "Basketbol o'yinida \"jump stop\" nima?",
      "output": "\"Jump stop\" — bu o'yinchining to'pni olib yugurayotgan paytda, bir nuqtada to'xtab, tizzalarni bukib, to'pni aniq ushlash uchun amalga oshiriladigan texnika."
    },
    {
      "id": 553,
      "input": "Basketbol o'yinida \"pivot\" nima?",
      "output": "\"Pivot\" — bu o'yinchining bir oyoqda turib, boshqa oyoqqa qarab aylanishi va to'pni boshqarish uchun pozitsiya o'zgartirishi hisoblanadi."
    },
    {
      "id": 554,
      "input": "Basketbol o'yinida \"team chemistry\" nima?",
      "output": "\"Team chemistry\" — bu jamoa o'yinchilari orasidagi o'zaro ishonch, hamkorlik va kommunikatsiyaning yuqori darajasi."
    },
    {
      "id": 555,
      "input": "Basketbol o'yinida \"swish\"ni qanday amalga oshirish mumkin?",
      "output": "\"Swish\"ni amalga oshirish uchun, to'pni to'g'ri burchakda va yuqoridan aniq tarzda savatga yo'naltirish kerak, bu savatga qoqilmasdan kirishi kerak."
    },
    {
      "id": 556,
      "input": "Basketbol o'yinida \"defensive three-second violation\" nima?",
      "output": "\"Defensive three-second violation\" — bu himoyachi o'yinchining o'z hududida to'rt soniyadan ko'proq vaqt turishi va raqibni himoya qilishga ruxsat bermasligidir."
    },
    {
      "id": 557,
      "input": "Basketbol o'yinida \"cut\" nima?",
      "output": "\"Cut\" — bu o'yinchining maydonni tezda kesib o'tib, ochiq pozitsiyaga chiqishi va to'p olish uchun harakat qilishi hisoblanadi."
    },
    {
      "id": 558,
      "input": "Basketbol o'yinida \"corner three\" nima?",
      "output": "\"Corner three\" — bu basketbol maydonining burchagidagi uchlik zarbasi. Bu hududdan zarba berish odatda eng aniq va samarali hisoblanadi."
    },
    {
      "id": 559,
      "input": "Basketbol o'yinida \"handoff\" nima?",
      "output": "\"Handoff\" — bu to'pni bir o'yinchidan boshqasiga berish usuli bo'lib, o'yinchi to'pni raqibdan himoya qilib, boshqa o'yinchiga uzatadi."
    },
    {
      "id": 560,
      "input": "Basketbol o'yinida \"weak side\" va \"strong side\" nima?",
      "output": "\"Weak side\" — bu himoyachining raqibdan uzoqroq bo'lgan tomoni, \"strong side\" esa to'p joylashgan tomondir."
    },
    {
      "id": 561,
      "input": "Basketbol o'yinida \"offensive rebound\"ni qanday olish mumkin?",
      "output": "\"Offensive rebound\"ni olish uchun, o'yinchi savatga o'qilgan zarba qaytganida, pozitsiyani to'g'ri tanlab, kuchli va tez harakat qilishi kerak."
    },
    {
      "id": 562,
      "input": "Basketbol o'yinida \"low post\" va \"high post\" pozitsiyalari qanday farqlanadi?",
      "output": "\"Low post\" — bu savatga yaqin bo'lgan pozitsiya, \"high post\" esa savatga uzoqroq, 3 nuqtali zona yaqinida joylashgan pozitsiyadir."
    },
    {
      "id": 563,
      "input": "Basketbol o'yinida \"catch and shoot\" nima?",
      "output": "\"Catch and shoot\" — bu to'pni olish va darhol zarba berishni anglatadi. Bu texnika, o'yinchining to'pni tezda tashlashiga yordam beradi."
    },
    {
      "id": 564,
      "input": "Basketbol o'yinida \"point guard\" va \"shooting guard\"ning farqi nima?",
      "output": "\"Point guard\" — bu jamoaning asosiy pas beruvchi o'yinchisi, \"shooting guard\" esa zarba berish bo'yicha mutaxassis hisoblanadi."
    },
    {
      "id": 565,
      "input": "Basketbol o'yinida \"three-second violation\" nima?",
      "output": "\"Three-second violation\" — bu hujumchi o'yinchi savatga yaqin hududda 3 soniyadan ko'proq vaqt davomida turishi hisoblanadi."
    },
    {
      "id": 566,
      "input": "Basketbol o'yinida \"transition offense\" nima?",
      "output": "\"Transition offense\" — bu jamoaning himoyadan hujumga tezda o'tishi. Bu harakatni amalga oshirish uchun tezkor paslar va ko'proq yugurish kerak."
    },
    {
      "id": 567,
      "input": "Basketbol o'yinida \"paint\" nima?",
      "output": "\"Paint\" — bu savat atrofidagi hudud bo'lib, odatda hujumchilar va himoyachilar o'rtasida kurashlar sodir bo'ladi."
    },
    {
      "id": 568,
      "input": "Basketbol o'yinida \"fast break\"ni qanday qilib samarali amalga oshirish mumkin?",
      "output": "\"Fast break\"ni samarali amalga oshirish uchun, o'yinchilar bir-biriga yaqin joylashib, to'pni tezda uzatish va ochiq pozitsiyaga chiqish zarur."
    },
    {
      "id": 569,
      "input": "Basketbol o'yinida \"box out\" nima?",
      "output": "\"Box out\" — bu himoyachi o'yinchining to'pni olish uchun raqibni orqaga surib, o'z pozitsiyasini saqlashidir."
    },
    {
      "id": 570,
      "input": "Basketbol o'yinida \"step-back\" zarbasi nima?",
      "output": "\"Step-back\" — bu o'yinchi raqibni aldash uchun orqaga qadam tashlab, zarbani amalga oshirishidir."
    },
    {
      "id": 571,
      "input": "Basketbol o'yinida \"post move\" nima?",
      "output": "\"Post move\" — bu o'yinchining \"low post\" hududida raqibni aldash uchun bajargan harakati."
    },
    {
      "id": 572,
      "input": "Basketbol o'yinida \"screen roll\" qanday ishlaydi?",
      "output": "\"Screen roll\" — bu to'pni ushlab turadigan o'yinchi raqibni bloklab, keyin to'pni qayta olish uchun savat tomon harakat qiladi."
    },
    {
      "id": 573,
      "input": "Basketbol o'yinida \"buzzer beater\" qanday amalga oshiriladi?",
      "output": "\"Buzzer beater\" — o'yin vaqtining tugashiga bir necha soniya qolganda amalga oshirilgan zarba hisoblanadi, bu zarba vaqt tugaganidan keyin kiritiladi."
    },
    {
      "id": 574,
      "input": "Basketbol o'yinida \"mismatch\" nima?",
      "output": "\"Mismatch\" — bu o'yinchining raqibiga qaraganda jismonan yoki texnik jihatdan ustun bo'lgan holatdir, bu jamoaga imkoniyat yaratadi."
    },
    {
      "id": 575,
      "input": "Basketbol o'yinida \"flagrant foul\" nima?",
      "output": "\"Flagrant foul\" — bu juda qattiq yoki xavfli bo'lgan qoidabuzarlik bo'lib, jiddiy to'siqlik yoki raqibga zarar yetkazish bilan bog'liq."
    },
    {
      "id": 576,
      "input": "Basketbol o'yinida \"hustle play\" nima?",
      "output": "\"Hustle play\" — bu o'yinchi har bir imkoniyatda maksimal harakatni amalga oshirgan holda, maydonning har bir burchagida kurashishidir."
    },
    {
      "id": 577,
      "input": "Basketbol o'yinida \"assist to turnover ratio\" nima?",
      "output": "\"Assist to turnover ratio\" — bu o'yinchining pas berish va to'pni yo'qotish o'rtasidagi nisbati. Yuqori ko'rsatkich yaxshi pas berishni anglatadi."
    },
    {
      "id": 578,
      "input": "Basketbol o'yinida \"full-court pass\" nima?",
      "output": "\"Full-court pass\" — bu to'pni butun maydon bo'ylab uzun masofaga uzatish. Bu usul tezkor hujumlarni tashkil etishda qo'llaniladi."
    },
    {
      "id": 579,
      "input": "Sport tarixida birinchi Olimpiya o'yinlari qachon o'tkazilgan?",
      "output": "Birinchi Olimpiya o'yinlari miloddan avvalgi 776-yilda Yunonistonning Olimpiya shahrida o'tkazilgan."
    },
    {
      "id": 580,
      "input": "Futbolning dastlabki prototipi qayerda paydo bo'lgan?",
      "output": "Futbolning dastlabki prototipi Xitoyda, \"Cuju\" nomli o'yinda paydo bo'lgan, bu o'yin miloddan avvalgi 2-asrda mavjud bo'lgan."
    },
    {
      "id": 581,
      "input": "Xalqaro futbol federatsiyasi (FIFA) qachon tashkil etilgan?",
      "output": "Xalqaro futbol federatsiyasi (FIFA) 1904-yil 21-martda tashkil etilgan."
    },
    {
      "id": 582,
      "input": "Tennisning dastlabki prototipi qayerda paydo bo'lgan?",
      "output": "Tennisning dastlabki prototipi Fransiyada, \"jeu de paume\" (paloche o'yini) nomi bilan 12-asrda paydo bo'lgan."
    },
    {
      "id": 583,
      "input": "Birinchi tennis turniri qachon o'tkazilgan?",
      "output": "Birinchi tennis turniri 1877-yilda Londondagi All England Croquet and Lawn Tennis Clubda o'tkazilgan."
    },
    {
      "id": 584,
      "input": "Amerika futboli qanday shaklda o'ynalgan va u qachon paydo bo'lgan?",
      "output": "Amerika futboli XIX asrning oxirlarida, futbol va ragbi o'yinlarining aralashmasi sifatida paydo bo'lgan."
    },
    {
      "id": 585,
      "input": "Basketbol sport turi qachon paydo bo'lgan?",
      "output": "Basketbol 1891-yilda Amerikalik olim James Naismith tomonidan o'ylab topilgan."
    },
    {
      "id": 586,
      "input": "Birinchi basketbol o'yini qachon o'tkazildi?",
      "output": "Birinchi basketbol o'yini 1891-yil 21-dekabrda Springfield, Massachusettsda o'tkazilgan."
    },
    {
      "id": 587,
      "input": "Olimpiya o'yinlarida ayollar sporti qachon rasman qabul qilindi?",
      "output": "Ayollar sporti Olimpiya o'yinlarida 1900-yilda Parijda bo'lib o'tgan Olimpiadada rasman qabul qilindi."
    },
    {
      "id": 588,
      "input": "Futbol bo'yicha Jahon chempionati qachon boshlandi?",
      "output": "Futbol bo'yicha birinchi Jahon chempionati 1930-yilda Urugvayda bo'lib o'tgan."
    },
    {
      "id": 589,
      "input": "Yuqori sportchilarni to'plagan \"NBA\" qachon tashkil etilgan?",
      "output": "NBA (National Basketball Association) 1946-yilda tashkil etilgan, lekin uning hozirgi shakli 1976-yilda yig'ildi."
    },
    {
      "id": 590,
      "input": "Boks tarixidagi birinchi professional jang qachon bo'lib o'tgan?",
      "output": "Boks tarixidagi birinchi professional jang 18-asr oxirlarida Angliyada bo'lib o'tgan, u \"prize fighting\" deb atalgan."
    },
    {
      "id": 591,
      "input": "Olimpiya o'yinlarida birinchi marotaba kompyuter sportlari qachon paydo bo'ldi?",
      "output": "Kompyuter sportlari Olimpiya o'yinlarida 2024-yilda Parijda tan olinishi rejalashtirilgan."
    },
    {
      "id": 592,
      "input": "\"Formula 1\" musobaqalari qachon boshlandi?",
      "output": "Formula 1 musobaqalari 1950-yilda boshlandi, birinchi chempionni Italiyaning Giuseppe Farina qo'lga kiritgan."
    },
    {
      "id": 593,
      "input": "Yuqori sportchilarning \"Tour de France\"ni yutgan birinchi sportchi kim?",
      "output": "\"Tour de France\"ni birinchi bo'lib 1903-yilda Maurice Garin yutgan."
    },
    {
      "id": 594,
      "input": "Hokeyning dastlabki shakli qayerda paydo bo'lgan?",
      "output": "Hokeyning dastlabki shakli XVI asrda Angliyada va Shotlandiyada paydo bo'lgan, uni \"shinty\" deb atashgan."
    },
    {
      "id": 595,
      "input": "Birinchi olimpiya o'yinlarida nechta mamlakat qatnashgan?",
      "output": "Birinchi Olimpiya o'yinlarida 12 mamlakat ishtirok etgan."
    },
    {
      "id": 596,
      "input": "Birinchi jahon urushidan keyin Olimpiya o'yinlari qachon qayta tiklandi?",
      "output": "Birinchi jahon urushidan keyin Olimpiya o'yinlari 1920-yilda Anversda qayta tiklandi."
    },
    {
      "id": 597,
      "input": "Jahon chempionati musobaqalari futbol tarixidagi eng katta musobaqa qachon o'tkazilgan?",
      "output": "2014-yilgi Jahon chempionati Braziliyadagi eng katta futbol musobaqasi bo'ldi, bu musobaqada 32 jamoa ishtirok etdi."
    },
    {
      "id": 598,
      "input": "Xalqaro olimpiya qo'mitasi (IOC) qachon tashkil etilgan?",
      "output": "Xalqaro olimpiya qo'mitasi (IOC) 1894-yilda Pierre de Coubertin tomonidan Parijda tashkil etilgan."
    },
    {
      "id": 599,
      "input": "Yuqori sportchilar orasida birinchi \"Grand Slam\"ni yutgan tennischi kim?",
      "output": "Tennischi Don Budge 1938-yilda birinchi \"Grand Slam\"ni yutgan."
    },
    {
      "id": 600,
      "input": "Futbolning kelib chiqishi qanday?",
      "output": "Futbolning kelib chiqishi qadimiy Xitoy, Misr va Gretsiyaga borib taqaladi, ammo zamonaviy futbolni Angliyada 19-asrda shakllantirishgan."
    },
    {
      "id": 601,
      "input": "Futbol o'yinidagi birinchi qoidalar qachon belgilangan?",
      "output": "1863-yilda Angliyada futbolning birinchi rasmiy qoidalari, \"The Laws of the Game\", The Football Association tomonidan belgilangan."
    },
    {
      "id": 602,
      "input": "Birinchi Olimpiya o'yinlarida nechta sport turi bo'lgan?",
      "output": "Birinchi Olimpiya o'yinlarida 13 ta sport turi bo'lgan."
    },
    {
      "id": 603,
      "input": "Birinchi Olimpiyada nechta jamoa ishtirok etgan?",
      "output": "Birinchi Olimpiya o'yinlarida 13 mamlakat ishtirok etgan."
    },
    {
      "id": 604,
      "input": "Futbol bo'yicha birinchi Jahon chempionati qachon tashkil etilgan?",
      "output": "Birinchi Jahon chempionati 1930-yilda Urugvayda tashkil etilgan."
    },
    {
      "id": 605,
      "input": "Birinchi professional futbol ligasi qachon tashkil etilgan?",
      "output": "Birinchi professional futbol ligasi Angliyada 1888-yilda tashkil etilgan."
    },
    {
      "id": 606,
      "input": "NBA ligasi qachon tashkil etilgan?",
      "output": "NBA (National Basketball Association) 1946-yilda tashkil etilgan."
    },
    {
      "id": 607,
      "input": "Birinchi NBA o'yini qachon o'tkazilgan?",
      "output": "Birinchi NBA o'yini 1946-yil 1-noyabrda o'ynalgan."
    },
    {
      "id": 608,
      "input": "Futbol bo'yicha Jahon chempionatida eng ko'p g'olib bo'lgan jamoa qaysi?",
      "output": "Braziliya — 5 marta Jahon chempionligini qo'lga kiritgan (1958, 1962, 1970, 1994, 2002)."
    },
    {
      "id": 609,
      "input": "Basketbolning dastlabki versiyasi qachon yaratilgan?",
      "output": "Basketbolning dastlabki versiyasi 1891-yilda James Naismith tomonidan yaratilgan."
    },
    {
      "id": 610,
      "input": "Birinchi basketbol o'yini qachon o'tkazildi?",
      "output": "Birinchi basketbol o'yini 1891-yil 21-dekabrda Springfield, Massachusettsda o'ynalgan."
    },
    {
      "id": 611,
      "input": "Amerika futbolining asosiy qoidalari qachon ishlab chiqilgan?",
      "output": "Amerika futbolining asosiy qoidalari 1869-yilda tuzilgan, lekin zamonaviy qoidalar 1880-yillarda shakllangan."
    },
    {
      "id": 612,
      "input": "Birinchi Super Bowl qachon o'tkazilgan?",
      "output": "Birinchi Super Bowl 1967-yilda o'tkazilgan va Green Bay Packers jamoasi g'olib bo'lgan."
    },
    {
      "id": 613,
      "input": "Olimpiya o'yinlarida ayollar sporti qachon tan olindi?",
      "output": "Ayollar sporti 1900-yilgi Parij Olimpiadasida tan olingan."
    },
    {
      "id": 614,
      "input": "Futbol bo'yicha eng ko'p gol urgan o'yinchi kim?",
      "output": "Pelé (Braziliya) va Cristiano Ronaldo (Portugaliya) 700+ gol bilan eng ko'p gol urgan o'yinchilar hisoblanadi."
    },
    {
      "id": 615,
      "input": "Xalqaro olimpiya qo'mitasi (IOC) qachon tashkil etilgan?",
      "output": "Xalqaro olimpiya qo'mitasi (IOC) 1894-yilda tashkil etilgan."
    },
    {
      "id": 616,
      "input": "Birinchi Formula 1 musobaqasi qachon o'tkazildi?",
      "output": "Birinchi Formula 1 musobaqasi 1950-yilda Angliyadagi Silverstone yo'lida o'tkazilgan."
    },
    {
      "id": 617,
      "input": "Olimpiya o'yinlarida birinchi marotaba sovrinlar berildi?",
      "output": "1900-yilgi Parij Olimpiadasida birinchi marotaba sovrinlar berildi."
    },
    {
      "id": 618,
      "input": "Yuqori sportchilarni \"Tour de France\"ni yutgan birinchi sportchi kim?",
      "output": "1903-yilda Maurice Garin Tour de France musobaqasini birinchi marta yutgan."
    },
    {
      "id": 619,
      "input": "Tennisning birinchi Grand Slam musobaqasi qachon o'tkazilgan?",
      "output": "Birinchi Grand Slam musobaqasi 1881-yilda Amerika Ochig'i sifatida o'tkazilgan."
    },
    {
      "id": 620,
      "input": "Basketbol o'yinida birinchi 3 nuqtali zarba qachon joriy etilgan?",
      "output": "1980-yillarda 3 nuqtali zarba qo'llanila boshlandi."
    },
    {
      "id": 621,
      "input": "Birinchi jahon urushidan keyin Olimpiya o'yinlari qachon qayta tiklandi?",
      "output": "Birinchi jahon urushidan keyin Olimpiya o'yinlari 1920-yilda Anversda qayta tiklandi."
    },
    {
      "id": 622,
      "input": "Futbol bo'yicha Jahon chempionati birinchi marta qanday mamlakatda o'tkazildi?",
      "output": "1930-yilda Urugvayda birinchi futbol bo'yicha Jahon chempionati o'tkazildi."
    },
    {
      "id": 623,
      "input": "Futbol o'yinida \"VAR\" tizimi qachon joriy etildi?",
      "output": "\"VAR\" (Video Assistant Referee) tizimi 2018-yilgi Jahon chempionatida rasmiy ravishda joriy etilgan."
    },
    {
      "id": 624,
      "input": "Birinchi Olimpiyada nechta sport turi bo'lgan?",
      "output": "13 sport turi 1896-yilgi birinchi Olimpiya o'yinlarida o'ynalgan."
    },
    {
      "id": 625,
      "input": "Xalqaro boks federatsiyasi (AIBA) qachon tashkil etilgan?",
      "output": "Xalqaro boks federatsiyasi (AIBA) 1946-yilda tashkil etilgan."
    },
    {
      "id": 626,
      "input": "Basketbol o'yinida eng ko'p g'olib bo'lgan jamoa qaysi?",
      "output": "NBA tarixida eng ko'p chempionlikni Los Angeles Lakers va Boston Celtics jamoalari qo'lga kiritgan (har biri 17 marta)."
    },
    {
      "id": 627,
      "input": "Futbol bo'yicha Eng yaxshi futbolchi mukofoti (Ballon d'Or) qachon joriy etilgan?",
      "output": "\"Ballon d'Or\" mukofoti 1956-yilda Fransuz futbol jurnalisti Gabriel Hanot tomonidan joriy etilgan."
    },
    {
      "id": 628,
      "input": "Birinchi boks janglaridan biri qachon bo'lib o'tgan?",
      "output": "Birinchi boks janglaridan biri 1681-yilda Angliyada tashkil etilgan."
    },
    {
      "id": 629,
      "input": "Futbol tarixida eng tez gol kim tomonidan urilgan?",
      "output": "2009-yilda \"Hellas Verona\" futbolchisi, Paolo Poggi, futbol tarixida eng tez golni urgan — 8 soniya ichida."
    },
    {
      "id": 630,
      "input": "Birinchi \"Tour de France\"ni kim yutgan?",
      "output": "Maurice Garin 1903-yilda birinchi \"Tour de France\"ni yutgan."
    },
    {
      "id": 631,
      "input": "Basketbol o'yinida to'pni to'g'ri ushlab yurishning nomi nima?",
      "output": "\"Dribbling\" — to'pni yerga urib ushlab yurish."
    },
    {
      "id": 632,
      "input": "Futbol bo'yicha Jahon chempionati 1966-yil qaysi mamlakatda o'tkazildi?",
      "output": "1966-yilgi futbol bo'yicha Jahon chempionati Angliyada o'tkazildi."
    },
    {
      "id": 633,
      "input": "Birinchi jahon futbol chempionati qachon o'tkazildi?",
      "output": "1930-yilda Urugvayda birinchi jahon futbol chempionati o'tkazildi."
    },
    {
      "id": 634,
      "input": "Boksda eng ko'p chempionlikni qo'lga kiritgan o'yinchi kim?",
      "output": "Muhammad Ali boks tarixidagi eng ko'p chempionlikni qo'lga kiritgan o'yinchilardan biridir."
    },
    {
      "id": 635,
      "input": "Birinchi Amerika kubogi musobaqasi qachon tashkil etilgan?",
      "output": "Birinchi Amerika kubogi musobaqasi 1870-yilda tashkil etilgan."
    },
    {
      "id": 636,
      "input": "Futbol o'yinida eng tez gol kim tomonidan urilgan?",
      "output": "2009-yilda Paolo Poggi, 8 soniya ichida gol urgan."
    },
    {
      "id": 637,
      "input": "Futbol o'yinida birinchi \"hat-trick\"ni kim urgan?",
      "output": "Birinchi \"hat-trick\"ni 1878-yilda England Football Club o'yinchisi, Steve Bloomer urgan."
    },
    {
      "id": 638,
      "input": "Futbol tarixidagi birinchi professional jamoa qaysi?",
      "output": "Birinchi professional futbol jamoasi 1885-yilda Sheffield Wednesday tashkil etilgan."
    },
    {
      "id": 639,
      "input": "Tennis o'yinida birinchi uyushtirilgan davra qachon bo'lgan?",
      "output": "1874-yilda Britaniyada \"All England Tennis Club\"da birinchi rasmiy tennis turniri o'tkazilgan."
    },
    {
      "id": 640,
      "input": "Futbol bo'yicha Jahon chempionatida birinchi musobaqa kim tomonidan g'olib bo'ldi?",
      "output": "1930-yilda, Urugvay futbol bo'yicha birinchi Jahon chempionatida g'olib bo'ldi."
    },
    {
      "id": 641,
      "input": "Birinchi Olimpiya o'yinlari uchun qanday taqvim belgilangan?",
      "output": "Birinchi Olimpiya o'yinlari miloddan avvalgi 776-yilda Yunonistonning Olimpiya shahrida o'tkazilgan."
    },
    {
      "id": 642,
      "input": "Hokeyning dastlabki shakli qayerda paydo bo'lgan?",
      "output": "Hokeyning dastlabki shakli XIII asrda Shotlandiyada \"shinty\" nomi bilan paydo bo'lgan."
    },
    {
      "id": 643,
      "input": "Olimpiya o'yinlarida futbol qachon ilk bor tashkil etilgan?",
      "output": "Futbol Olimpiya o'yinlarida 1900-yilda Parijda birinchi marotaba ishtirok etdi."
    },
    {
      "id": 644,
      "input": "Basketbol o'yinida eng tez qabul qilingan qoidalar qachon bo'ldi?",
      "output": "1930-yilda basketbol o'yinida barcha jahon bo'ylab qoidalar birlashtirildi."
    },
    {
      "id": 645,
      "input": "Tennis o'yinida birinchi \"Open Era\" qachon boshladi?",
      "output": "Tennisning \"Open Era\"si 1968-yilda boshlandi, bu davrda professional o'yinchilar amaliyotga kiritildi."
    },
    {
      "id": 646,
      "input": "Xalqaro futbol federatsiyasi (FIFA) tashkil topgan yili nima?",
      "output": "FIFA 1904-yil 21-martda tashkil etilgan."
    },
    {
      "id": 647,
      "input": "Futbol bo'yicha birinchi jahon chempionatining finali qachon o'tkazilgan?",
      "output": "Birinchi Jahon chempionati finali 1930-yilda, Urugvayda o'tkazilgan."
    },
    {
      "id": 648,
      "input": "Birinchi \"Super Bowl\" musobaqasi qachon o'tkazilgan?",
      "output": "Birinchi \"Super Bowl\" 1967-yil 15-yanvarda o'tkazilgan."
    },
    {
      "id": 649,
      "input": "Futbol o'yinida eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniya ichida eng tez golni urgan."
    },
    {
      "id": 650,
      "input": "Olimpiya o'yinlarida \"basketbol\"ni joriy etish qachon amalga oshdi?",
      "output": "Basketbol Olimpiya o'yinlarida 1936-yilda Berlinda joriy etildi."
    },
    {
      "id": 651,
      "input": "Futbol bo'yicha eng ko'p g'olib bo'lgan mamlakat kim?",
      "output": "Braziliya futbol bo'yicha eng ko'p Jahon chempionatini (5 marta) qo'lga kiritgan."
    },
    {
      "id": 652,
      "input": "Birinchi \"Tour de France\" qachon o'tkazilgan?",
      "output": "Birinchi \"Tour de France\" 1903-yilda o'tkazilgan."
    },
    {
      "id": 653,
      "input": "Basketbol tarixidagi eng baland dunkni kim amalga oshirgan?",
      "output": "Michael Jordan 1988-yildagi dunk musobaqasida eng baland dunkni amalga oshirgan."
    },
    {
      "id": 654,
      "input": "Futbol bo'yicha birinchi \"hat-trick\"ni kim urgan?",
      "output": "1878-yilda Steve Bloomer futbol tarixida birinchi \"hat-trick\"ni urgan."
    },
    {
      "id": 655,
      "input": "Tennis tarixidagi birinchi \"Grand Slam\"ni kim qo'lga kiritgan?",
      "output": "Don Budge 1938-yilda birinchi \"Grand Slam\"ni yutgan."
    },
    {
      "id": 656,
      "input": "Formula 1 musobaqalarining asoschisi kim?",
      "output": "Formula 1 musobaqalarining asoschisi va tashkilotchisi 1950-yilda tashkil etilgan \"Fédération Internationale de l'Automobile\" (FIA)dir."
    },
    {
      "id": 657,
      "input": "Futbol tarixidagi eng ko'p gol urgan futbolchi kim?",
      "output": "Pelé va Cristiano Ronaldo eng ko'p gol urgan futbolchilar hisoblanadi."
    },
    {
      "id": 658,
      "input": "Basketbol o'yinida 3 nuqtali zarba qachon joriy etilgan?",
      "output": "Basketbol o'yinida 3 nuqtali zarba 1980-yillarda joriy etilgan."
    },
    {
      "id": 659,
      "input": "Birinchi futbol jamoasi qachon tashkil etilgan?",
      "output": "Birinchi futbol jamoasi 1857-yilda Angliyada tashkil etilgan."
    },
    {
      "id": 660,
      "input": "Amerika futbolining tarixi qachon boshlanadi?",
      "output": "Amerika futboli 1869-yilda boshlanadi, o'sha paytda u futbol va ragbi o'yinlarining aralashmasi edi."
    },
    {
      "id": 661,
      "input": "Tennis o'yinida birinchi Wimbledon musobaqasi qachon o'tkazilgan?",
      "output": "Birinchi Wimbledon musobaqasi 1877-yilda o'tkazilgan."
    },
    {
      "id": 662,
      "input": "Futbol tarixidagi eng tez golni kim urgan?",
      "output": "2009-yilda, \"Hellas Verona\" futbolchisi Paolo Poggi 8 soniya ichida eng tez golni urgan."
    },
    {
      "id": 663,
      "input": "Boks sportida eng ko'p g'olib bo'lgan jangchi kim?",
      "output": "Muhammad Ali eng ko'p chempionlikni qo'lga kiritgan boks jangchilaridan biridir."
    },
    {
      "id": 664,
      "input": "Futbol bo'yicha eng tez g'oya kim tomonidan urilgan?",
      "output": "\"Hellas Verona\" futbolchisi Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 665,
      "input": "Birinchi \"basketball game\" qachon o'tkazildi?",
      "output": "Birinchi basketbol o'yini 1891-yil 21-dekabrda Springfieldda o'ynalgan."
    },
    {
      "id": 666,
      "input": "Tennisning zamonaviy qoidalari qachon ishlab chiqilgan?",
      "output": "Tennisning zamonaviy qoidalari 1877-yilda All England Clubda ishlab chiqilgan."
    },
    {
      "id": 667,
      "input": "Futbol o'yinida birinchi professional ligalar qachon tashkil etilgan?",
      "output": "Birinchi professional futbol ligasi 1888-yilda Angliyada tashkil etilgan."
    },
    {
      "id": 668,
      "input": "Formula 1 musobaqalari qachon tashkil etilgan?",
      "output": "Formula 1 musobaqalari 1950-yilda tashkil etilgan va 1950-yilgi Britaniya GP musobaqasi birinchi Formula 1 musobaqasi bo'ldi."
    },
    {
      "id": 669,
      "input": "Birinchi professional futbol ligasi qachon tashkil etilgan?",
      "output": "Birinchi professional futbol ligasi 1888-yilda Angliyada tashkil etilgan."
    },
    {
      "id": 670,
      "input": "Futbol o'yinida \"hand ball\" qanday tushuniladi?",
      "output": "\"Hand ball\" — bu o'yinchining to'pni qo'li bilan o'ynashi yoki to'pponi bilakka olishidir."
    },
    {
      "id": 671,
      "input": "Futbol bo'yicha eng ko'p g'olib bo'lgan futbolchi kim?",
      "output": "Pele va Cristiano Ronaldo futbol tarixida eng ko'p gol urgan o'yinchilar hisoblanadi."
    },
    {
      "id": 672,
      "input": "Birinchi World Cup futbol musobaqasi qachon bo'lib o'tgan?",
      "output": "1930-yilda Urugvayda birinchi futbol bo'yicha Jahon chempionati o'tkazilgan."
    },
    {
      "id": 673,
      "input": "Futbol bo'yicha eng ko'p Jahon chempionligini qo'lga kiritgan mamlakat qaysi?",
      "output": "Braziliya 5 marta (1958, 1962, 1970, 1994, 2002) Jahon chempionligini qo'lga kiritgan."
    },
    {
      "id": 674,
      "input": "Boks bo'yicha eng ko'p og'ir vazn chempioni kim?",
      "output": "Muhammad Ali, Evander Holyfield va Lennox Lewis boks tarixida eng ko'p og'ir vazn chempionlari sifatida tanilgan."
    },
    {
      "id": 675,
      "input": "Tennis bo'yicha eng ko'p Grand Slam chempionligini qo'lga kiritgan o'yinchi kim?",
      "output": "Novak Djokovic, Rafael Nadal va Roger Federer — har biri 20 ta Grand Slam chempionligini qo'lga kiritgan."
    },
    {
      "id": 676,
      "input": "NBA tarixidagi eng ko'p chempion bo'lgan jamoa qaysi?",
      "output": "NBA tarixida eng ko'p chempionlikni Los Angeles Lakers va Boston Celtics jamoalari qo'lga kiritgan, har biri 17 marta chempion bo'lgan."
    },
    {
      "id": 677,
      "input": "Futbol bo'yicha eng ko'p gol urgan futbolchi kim?",
      "output": "Cristiano Ronaldo va Pelé futbol tarixida eng ko'p gol urgan o'yinchilardir, har biri 700+ gol bilan eng yaxshi natijaga ega."
    },
    {
      "id": 678,
      "input": "F1 tarixidagi eng ko'p chempion bo'lgan poygachi kim?",
      "output": "Michael Schumacher va Lewis Hamilton — har biri 7 marta Formula 1 chempioni bo'lgan."
    },
    {
      "id": 679,
      "input": "Birinchi Olimpiya chempioni kim bo'lgan?",
      "output": "Birinchi Olimpiya chempioni 776-yilda Olimpiya shahrida Gretsiyada o'ynagan diskus tashlash bo'yicha o'yinchi Koroibos bo'lgan."
    },
    {
      "id": 680,
      "input": "Futbol bo'yicha eng ko'p Ballon d'Or g'olibi kim?",
      "output": "Lionel Messi 7 marta Ballon d'Or mukofotini qo'lga kiritgan."
    },
    {
      "id": 681,
      "input": "Basketbol bo'yicha eng ko'p MVP mukofotini qo'lga kiritgan o'yinchi kim?",
      "output": "Kareem Abdul-Jabbar 6 marta NBA MVP mukofotini qo'lga kiritgan."
    },
    {
      "id": 682,
      "input": "Hokey bo'yicha eng ko'p chempion bo'lgan o'yinchi kim?",
      "output": "Wayne Gretzky — 4 marta Stanley Cup g'olibi bo'lgan, shuningdek, NHLning eng yaxshi o'yinchisi deb tanilgan."
    },
    {
      "id": 683,
      "input": "Tennis tarixidagi eng ko'p yirik musobaqalarni yutgan o'yinchi kim?",
      "output": "Serena Williams 23 ta Grand Slam musobaqasini yutgan, bu rekord ayollar tenisida eng yuqori hisoblanadi."
    },
    {
      "id": 684,
      "input": "Amerika futboli bo'yicha eng ko'p Super Bowl g'olibi kim?",
      "output": "Tom Brady 7 marta Super Bowlni yutgan, bu rekorddir."
    },
    {
      "id": 685,
      "input": "Futbol bo'yicha eng ko'p jahon chempionlikni qo'lga kiritgan o'yinchi kim?",
      "output": "Cafu (Braziliya) — 2 marta Jahon chempionligini yutgan (1994, 2002)."
    },
    {
      "id": 686,
      "input": "Boksda eng tez nokaut qilgan jangchi kim?",
      "output": "Mike Tyson 1986-yilda 91 soniya ichida boks tarixidagi eng tez nokautni amalga oshirgan."
    },
    {
      "id": 687,
      "input": "Futbol tarixida eng ko'p o'yin o'ynagan futbolchi kim?",
      "output": "Cristiano Ronaldo 1,100 dan ortiq professional o'yinlarda ishtirok etgan."
    },
    {
      "id": 688,
      "input": "MMA tarixidagi eng ko'p himoya chempioni kim?",
      "output": "Georges St-Pierre 9 marta UFC himoya chempioni bo'ldi."
    },
    {
      "id": 689,
      "input": "Birinchi Olimpiya o'yinlarida chempionlikni qo'lga kiritgan mamlakat qaysi?",
      "output": "Gretsiya 1896-yilgi birinchi Olimpiya o'yinlarida eng ko'p chempionlikni qo'lga kiritgan."
    },
    {
      "id": 690,
      "input": "Futbol tarixida eng ko'p debyut golini kim urgan?",
      "output": "Zlatan Ibrahimović 2004-yilda 6 ta turli jamoada debyut goli urgan."
    },
    {
      "id": 691,
      "input": "F1 tarixida eng ko'p yutgan poygachilar kimlar?",
      "output": "Michael Schumacher va Lewis Hamilton har biri 7 marta Formula 1 jahon chempioni bo'lgan."
    },
    {
      "id": 692,
      "input": "Birinchi Xalqaro Futbol chempionati qachon bo'lib o'tgan?",
      "output": "Birinchi Xalqaro Futbol chempionati 1930-yilda Urugvayda bo'lib o'tgan."
    },
    {
      "id": 693,
      "input": "Tennis bo'yicha eng ko'p turli maydonlarda g'olib bo'lgan o'yinchi kim?",
      "output": "Rafael Nadal 14 marta Frantsiya Ochiq musobaqasini yutgan."
    },
    {
      "id": 694,
      "input": "Futbol bo'yicha eng ko'p jahon chempionligini yutgan futbolchi kim?",
      "output": "Pelé 3 marta Jahon chempionligini yutgan (1958, 1962, 1970)."
    },
    {
      "id": 695,
      "input": "Basketbol bo'yicha eng ko'p chempionlikni qo'lga kiritgan o'yinchi kim?",
      "output": "Bill Russell NBA tarixida 11 marta chempionlikni qo'lga kiritgan."
    },
    {
      "id": 696,
      "input": "Amerika futboli bo'yicha eng ko'p Super Bowl g'olibi kim?",
      "output": "Tom Brady 7 marta Super Bowl g'olibi bo'lgan."
    },
    {
      "id": 697,
      "input": "Futbol bo'yicha eng ko'p gol urgan o'yinchi kim?",
      "output": "Cristiano Ronaldo hozirda futbol tarixidagi eng ko'p gol urgan o'yinchi hisoblanadi."
    },
    {
      "id": 698,
      "input": "Boks bo'yicha eng ko'p og'ir vazn chempionligi kimda?",
      "output": "Evander Holyfield 4 marta og'ir vazn chempioni bo'lgan."
    },
    {
      "id": 699,
      "input": "Basketbol bo'yicha eng ko'p chempion bo'lgan jamoa qaysi?",
      "output": "Los Angeles Lakers va Boston Celtics jamoalari 17 marta chempion bo'lishgan."
    },
    {
      "id": 700,
      "input": "Futbol bo'yicha eng ko'p o'yin o'ynagan futbolchi kim?",
      "output": "Peter Shilton (Angliya) futbol tarixida eng ko'p o'yin o'ynagan futbolchi hisoblanadi — 1,390 o'yin."
    },
    {
      "id": 701,
      "input": "MMA tarixida eng ko'p himoya chempioni kim?",
      "output": "Anderson Silva 10 marta UFC chempioni bo'lib, rekordni o'rnatgan."
    },
    {
      "id": 702,
      "input": "Futbol bo'yicha eng ko'p \"hat-trick\"ni kim urgan?",
      "output": "Cristiano Ronaldo 3 marta \"hat-trick\"ni urgan futbolchilar orasida rekord o'rnatgan."
    },
    {
      "id": 703,
      "input": "Futbol tarixidagi eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi futbol tarixida eng tez golni urgan — 8 soniya ichida."
    },
    {
      "id": 704,
      "input": "Boksda eng ko'p jangni kim yutgan?",
      "output": "Manny Pacquiao 62 jangni yutgan va boks tarixida eng ko'p yutgan jangchidir."
    },
    {
      "id": 705,
      "input": "Tennis tarixida eng ko'p \"Grand Slam\" g'olibi kim?",
      "output": "Novak Djokovic 24 ta Grand Slamni yutgan."
    },
    {
      "id": 706,
      "input": "Futbol tarixidagi eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniya ichida gol urgan."
    },
    {
      "id": 707,
      "input": "Boks bo'yicha eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniyada boks tarixidagi eng tez nokautni amalga oshirgan."
    },
    {
      "id": 708,
      "input": "utbol bo'yicha eng ko'p Jahon chempionatini yutgan o'yinchi kim?",
      "output": "Pelé va Cafu ikkalasi ham Braziliya futboli uchun 3 marta Jahon chempionligini qo'lga kiritgan."
    },
    {
      "id": 709,
      "input": "Tennis bo'yicha eng ko'p yirik musobaqalarda g'olib bo'lgan o'yinchi kim?",
      "output": "Serena Williams 23 ta Grand Slam g'olibidir, bu rekord ayollar tennisida eng yuqori hisoblanadi."
    },
    {
      "id": 710,
      "input": "Futbol bo'yicha eng ko'p gol urgan futbolchi kim?",
      "output": "Cristiano Ronaldo 800+ gol bilan futbol tarixidagi eng ko'p gol urgan futbolchi hisoblanadi."
    },
    {
      "id": 711,
      "input": "Futbol bo'yicha eng ko'p gol urgan himoyachi kim?",
      "output": "Cafu, Braziliya futboli afsonasining rekordlaridan biri, ko'plab gol urgan himoyachidir."
    },
    {
      "id": 712,
      "input": "Formula 1 tarixidagi eng ko'p chempionlikni qo'lga kiritgan poygachi kim?",
      "output": "Michael Schumacher va Lewis Hamilton 7 marta Formula 1 jahon chempioni bo'lgan."
    },
    {
      "id": 713,
      "input": "Futbol bo'yicha eng tez hat-trickni kim urgan?",
      "output": "Tommy Ross 1964-yilda 2 daqiqada hat-trick urgan va shu bilan rekord o'rnatgan."
    },
    {
      "id": 714,
      "input": "Basketbol bo'yicha eng ko'p NBA chempionligini yutgan jamoa qaysi?",
      "output": "Los Angeles Lakers va Boston Celtics har biri 17 marta NBA chempionligi qo'lga kiritgan."
    },
    {
      "id": 715,
      "input": "Futbol bo'yicha eng ko'p gol urgan futbolchi kim?",
      "output": "Lionel Messi 700+ gol bilan futbol tarixidagi eng ko'p gol urgan futbolchilardan biridir."
    },
    {
      "id": 716,
      "input": "Boks bo'yicha eng ko'p vazn toifasida chempionlikni yutgan jangchi kim?",
      "output": "Manny Pacquiao 8 ta vazn toifasida chempionlikni yutgan boks tarixidagi eng ko'p chempiondir."
    },
    {
      "id": 717,
      "input": "Hokey bo'yicha eng ko'p g'olib bo'lgan o'yinchi kim?",
      "output": "Wayne Gretzky 4 marta Stanley Cupni qo'lga kiritgan."
    },
    {
      "id": 718,
      "input": "MMA tarixida eng ko'p himoya chempioni bo'lgan jangchi kim?",
      "output": "Georges St-Pierre 9 marta UFC himoya chempioni bo'lgan."
    },
    {
      "id": 719,
      "input": "Olimpiya o'yinlarida eng ko'p medalni qo'lga kiritgan sportchi kim?",
      "output": "Michael Phelps 28 ta Olimpiya medalini qo'lga kiritgan, bu rekord hozircha yangilanmagan."
    },
    {
      "id": 720,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 721,
      "input": "Basketbol bo'yicha eng ko'p MVP mukofotini yutgan o'yinchi kim?",
      "output": "Kareem Abdul-Jabbar 6 marta NBA MVP mukofotini qo'lga kiritgan."
    },
    {
      "id": 722,
      "input": "Boksda eng ko'p nockautlar bilan g'olib bo'lgan jangchi kim?",
      "output": "George Foreman 68 nockaut bilan eng ko'p nockautlarga ega bo'lgan boks jangchisidir."
    },
    {
      "id": 723,
      "input": "Tennis tarixida eng ko'p Wimbledon musobaqasini yutgan o'yinchi kim?",
      "output": "Roger Federer 8 marta Wimbledon musobaqasini yutgan."
    },
    {
      "id": 724,
      "input": "Futbol bo'yicha eng ko'p jahon chempionligini yutgan mamlakat qaysi?",
      "output": "Braziliya 5 marta (1958, 1962, 1970, 1994, 2002) Jahon chempionligini qo'lga kiritgan."
    },
    {
      "id": 725,
      "input": "Futbol bo'yicha eng ko'p debyut golini kim urgan?",
      "output": "Zlatan Ibrahimović 6 turli klubda debyut goli urgan."
    },
    {
      "id": 726,
      "input": "Birinchi Super Bowl chempioni kim?",
      "output": "Green Bay Packers 1967-yilda birinchi Super Bowlni yutgan."
    },
    {
      "id": 727,
      "input": "Amerika futboli bo'yicha eng ko'p Super Bowl g'olibi kim?",
      "output": "Tom Brady 7 marta Super Bowlni qo'lga kiritgan."
    },
    {
      "id": 728,
      "input": "Basketbol bo'yicha eng ko'p \"triple double\"ni kim amalga oshirgan?",
      "output": "Russell Westbrook NBA tarixida eng ko'p triple doubleni amalga oshirgan o'yinchi hisoblanadi."
    },
    {
      "id": 729,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda, \"Hellas Verona\" futbolchisi Paolo Poggi 8 soniya ichida eng tez golni urgan."
    },
    {
      "id": 730,
      "input": "Futbol bo'yicha eng ko'p \"assist\"ni kim amalga oshirgan?",
      "output": "Xavi Hernandez 200 assist bilan futbol tarixida eng ko'p assistni amalga oshirgan."
    },
    {
      "id": 731,
      "input": "MMA tarixida eng ko'p jangni yutgan jangchi kim?",
      "output": "Anderson Silva 16 ta g'alaba bilan eng ko'p jangni yutgan UFC jangchisi hisoblanadi."
    },
    {
      "id": 732,
      "input": "Boks tarixidagi eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniya ichida eng tez nokautni amalga oshirgan."
    },
    {
      "id": 733,
      "input": "Futbol tarixida eng ko'p jahon chempionatida ishtirok etgan futbolchi kim?",
      "output": "Antonio Carbajal (Meksika) 5 marta Jahon chempionatida ishtirok etgan."
    },
    {
      "id": 734,
      "input": "Tennis bo'yicha eng ko'p \"French Open\" g'olibi kim?",
      "output": "Rafael Nadal 14 marta Frantsiya Ochiq musobaqasini yutgan."
    },
    {
      "id": 735,
      "input": "Basketbol bo'yicha eng ko'p chempion bo'lgan o'yinchi kim?",
      "output": "Bill Russell NBA tarixida 11 marta chempion bo'lgan."
    },
    {
      "id": 736,
      "input": "Formula 1 tarixida eng ko'p pole-position yutgan poygachi kim?",
      "output": "Lewis Hamilton eng ko'p pole-positionni qo'lga kiritgan poygachi hisoblanadi."
    },
    {
      "id": 737,
      "input": "Futbol tarixida eng ko'p \"hat-trick\"ni kim urgan?",
      "output": "Cristiano Ronaldo 3 marta \"hat-trick\"ni urgan futbolchilar orasida rekord o'rnatgan."
    },
    {
      "id": 738,
      "input": "Futbol tarixida eng tez \"hat-trick\"ni kim urgan?",
      "output": "Tommy Ross 1964-yilda 2 daqiqada hat-trick urgan."
    },
    {
      "id": 739,
      "input": "Boks bo'yicha eng ko'p jangni kim yutgan?",
      "output": "Sugar Ray Robinson 173 ta jangni yutgan."
    },
    {
      "id": 740,
      "input": "Tennis bo'yicha eng ko'p \"Australian Open\" g'olibi kim?",
      "output": "Novak Djokovic 10 marta Avstraliya Ochiq musobaqasini yutgan."
    },
    {
      "id": 741,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 742,
      "input": "Boks bo'yicha eng ko'p chempionlikni qo'lga kiritgan jangchi kim?",
      "output": "Floyd Mayweather 5 ta vazn toifasida chempionlikni qo'lga kiritgan."
    },
    {
      "id": 743,
      "input": "Futbol bo'yicha eng ko'p gol urgan himoyachi kim?",
      "output": "Cafu, Braziliya futboli afsonasining rekordlaridan biri, ko'plab gol urgan himoyachidir."
    },
    {
      "id": 744,
      "input": "Boks tarixidagi eng ko'p vazn toifasida chempionlikni yutgan jangchi kim?",
      "output": "Manny Pacquiao 8 ta vazn toifasida chempionlikni qo'lga kiritgan."
    },
    {
      "id": 745,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 746,
      "input": "MMA bo'yicha eng ko'p jangni yutgan jangchi kim?",
      "output": "Georges St-Pierre 26 jangni yutgan."
    },
    {
      "id": 747,
      "input": "Futbol tarixidagi eng tez \"hat-trick\"ni kim urgan?",
      "output": "Tommy Ross 1964-yilda 2 daqiqada hat-trick urgan."
    },
    {
      "id": 748,
      "input": "Basketbol bo'yicha eng ko'p yirik musobaqalarni yutgan o'yinchi kim?",
      "output": "Michael Jordan 6 marta NBA chempionligini qo'lga kiritgan."
    },
    {
      "id": 749,
      "input": "Futbol tarixidagi eng ko'p \"assist\"ni kim amalga oshirgan?",
      "output": "Xavi Hernandez 200 assist bilan eng ko'p assistni amalga oshirgan."
    },
    {
      "id": 750,
      "input": "F1 tarixida eng ko'p g'olib bo'lgan poygachi kim?",
      "output": "Michael Schumacher 91 marta g'olib bo'lgan."
    },
    {
      "id": 751,
      "input": "Tennis bo'yicha eng ko'p \"Grand Slam\" g'olibi kim?",
      "output": "Novak Djokovic 24 ta Grand Slam g'olibi hisoblanadi."
    },
    {
      "id": 752,
      "input": "Futbol bo'yicha eng ko'p \"Jahon chempionligi\"ni yutgan mamlakat qaysi?",
      "output": "Braziliya 5 marta (1958, 1962, 1970, 1994, 2002) Jahon chempionligini yutgan."
    },
    {
      "id": 753,
      "input": "Basketbol bo'yicha eng ko'p \"MVP\" mukofotini yutgan o'yinchi kim?",
      "output": "Kareem Abdul-Jabbar 6 marta MVP bo'lgan."
    },
    {
      "id": 754,
      "input": "Boks bo'yicha eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniyada eng tez nokautni amalga oshirgan."
    },
    {
      "id": 755,
      "input": "Futbol bo'yicha eng ko'p debyut golini kim urgan?",
      "output": "Zlatan Ibrahimović 6 turli jamoada debyut goli urgan."
    },
    {
      "id": 756,
      "input": "Tennis bo'yicha eng ko'p \"French Open\" g'olibi kim?",
      "output": "Rafael Nadal 14 marta Frantsiya Ochiq musobaqasini yutgan."
    },
    {
      "id": 757,
      "input": "Futbol bo'yicha eng ko'p jahon chempionatida ishtirok etgan futbolchi kim?",
      "output": "Antonio Carbajal (Meksika) 5 marta Jahon chempionatida ishtirok etgan."
    },
    {
      "id": 758,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 759,
      "input": "Amerika futboli bo'yicha eng ko'p Super Bowl g'olibi kim?",
      "output": "Tom Brady 7 marta Super Bowlni yutgan."
    },
    {
      "id": 760,
      "input": "Futbol bo'yicha eng ko'p gol urgan himoyachi kim?",
      "output": "Cafu, Braziliya futboli afsonasining rekordlaridan biri, ko'plab gol urgan himoyachidir."
    },
    {
      "id": 761,
      "input": "MMA tarixida eng ko'p himoya chempioni bo'lgan jangchi kim?",
      "output": "Anderson Silva 10 marta UFC himoya chempioni bo'lib, rekordni o'rnatgan."
    },
    {
      "id": 762,
      "input": "Boks bo'yicha eng ko'p jangni kim yutgan?",
      "output": "Sugar Ray Robinson 173 ta jangni yutgan va boks tarixida eng ko'p yutgan jangchidir."
    },
    {
      "id": 763,
      "input": "Tennis bo'yicha eng ko'p Wimbledon musobaqasini yutgan o'yinchi kim?",
      "output": "Roger Federer 8 marta Wimbledon musobaqasini yutgan."
    },
    {
      "id": 764,
      "input": "Basketbol bo'yicha eng ko'p triple-doubleni kim amalga oshirgan?",
      "output": "Russell Westbrook NBA tarixida eng ko'p triple-doubleni amalga oshirgan o'yinchi hisoblanadi."
    },
    {
      "id": 765,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 766,
      "input": "Boks bo'yicha eng ko'p nockautlar bilan g'olib bo'lgan jangchi kim?",
      "output": "George Foreman 68 nockaut bilan eng ko'p nockautlarga ega bo'lgan boks jangchisidir."
    },
    {
      "id": 767,
      "input": "Tennis tarixida eng ko'p \"Australian Open\" g'olibi kim?",
      "output": "Novak Djokovic 10 marta Avstraliya Ochiq musobaqasini yutgan."
    },
    {
      "id": 768,
      "input": "Boks bo'yicha eng ko'p chempionlikni qo'lga kiritgan jangchi kim?",
      "output": "Floyd Mayweather 5 ta vazn toifasida chempionlikni qo'lga kiritgan."
    },
    {
      "id": 769,
      "input": "Futbol bo'yicha eng ko'p \"hat-trick\"ni kim urgan?",
      "output": "Cristiano Ronaldo 3 marta \"hat-trick\"ni urgan futbolchilar orasida rekord o'rnatgan."
    },
    {
      "id": 770,
      "input": "MMA bo'yicha eng ko'p jangni yutgan jangchi kim?",
      "output": "Anderson Silva 16 ta g'alaba bilan eng ko'p jangni yutgan UFC jangchisi hisoblanadi."
    },
    {
      "id": 771,
      "input": "Boks tarixidagi eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniya ichida eng tez nokautni amalga oshirgan."
    },
    {
      "id": 772,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 773,
      "input": "Futbol bo'yicha eng ko'p o'yin o'ynagan futbolchi kim?",
      "output": "Peter Shilton (Angliya) futbol tarixida eng ko'p o'yin o'ynagan futbolchi hisoblanadi — 1,390 o'yin."
    },
    {
      "id": 774,
      "input": "Formula 1 tarixidagi eng ko'p chempionlikni qo'lga kiritgan poygachi kim?",
      "output": "Michael Schumacher va Lewis Hamilton 7 marta Formula 1 jahon chempioni bo'lgan."
    },
    {
      "id": 775,
      "input": "Futbol bo'yicha eng ko'p gol urgan futbolchi kim?",
      "output": "Cristiano Ronaldo hozirda futbol tarixidagi eng ko'p gol urgan futbolchi hisoblanadi."
    },
    {
      "id": 776,
      "input": "Basketbol bo'yicha eng ko'p NBA chempionligini yutgan jamoa qaysi?",
      "output": "Los Angeles Lakers va Boston Celtics 17 marta chempion bo'lishgan."
    },
    {
      "id": 777,
      "input": "Boksda eng ko'p vazn toifasida chempion bo'lgan jangchi kim?",
      "output": "Evander Holyfield 4 marta og'ir vazn chempioni bo'lgan."
    },
    {
      "id": 778,
      "input": "Tennis bo'yicha eng ko'p turli maydonlarda g'olib bo'lgan o'yinchi kim?",
      "output": "Rafael Nadal 14 marta Frantsiya Ochiq musobaqasini yutgan."
    },
    {
      "id": 779,
      "input": "Formula 1 tarixida eng ko'p poyga g'olibligi kimda?",
      "output": "Lewis Hamilton 103 marta poyga g'olibi bo'lgan."
    },
    {
      "id": 780,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniya ichida eng tez golni urgan."
    },
    {
      "id": 781,
      "input": "Tennis bo'yicha eng ko'p Wimbledon musobaqasini yutgan o'yinchi kim?",
      "output": "Roger Federer 8 marta Wimbledonni yutgan."
    },
    {
      "id": 782,
      "input": "Basketbol bo'yicha eng ko'p \"MVP\" mukofotini yutgan o'yinchi kim?",
      "output": "Kareem Abdul-Jabbar 6 marta NBA MVP mukofotini qo'lga kiritgan."
    },
    {
      "id": 783,
      "input": "Futbol bo'yicha eng ko'p jahon chempionatida ishtirok etgan futbolchi kim?",
      "output": "Antonio Carbajal (Meksika) 5 marta Jahon chempionatida ishtirok etgan."
    },
    {
      "id": 784,
      "input": "Boksda eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniyada eng tez nokautni amalga oshirgan."
    },
    {
      "id": 785,
      "input": "Futbol bo'yicha eng ko'p \"assist\"ni kim amalga oshirgan?",
      "output": "Xavi Hernandez 200 assist bilan eng ko'p assistni amalga oshirgan."
    },
    {
      "id": 786,
      "input": "MMA tarixida eng ko'p jangni yutgan jangchi kim?",
      "output": "Georges St-Pierre 26 jangni yutgan."
    },
    {
      "id": 787,
      "input": "Futbol tarixida eng ko'p \"hat-trick\"ni kim urgan?",
      "output": "Cristiano Ronaldo 3 marta \"hat-trick\"ni urgan futbolchilar orasida rekord o'rnatgan."
    },
    {
      "id": 788,
      "input": "Tennis bo'yicha eng ko'p \"Grand Slam\" g'olibi kim?",
      "output": "Novak Djokovic 24 ta Grand Slam g'olibi hisoblanadi."
    },
    {
      "id": 789,
      "input": "Boks tarixidagi eng ko'p vazn toifasida chempionlikni yutgan jangchi kim?",
      "output": "Manny Pacquiao 8 ta vazn toifasida chempionlikni qo'lga kiritgan."
    },
    {
      "id": 790,
      "input": "Futbol bo'yicha eng ko'p debyut golini kim urgan?",
      "output": "Zlatan Ibrahimović 6 turli jamoada debyut goli urgan."
    },
    {
      "id": 791,
      "input": "MMA bo'yicha eng ko'p himoya chempioni bo'lgan jangchi kim?",
      "output": "Anderson Silva 10 marta UFC himoya chempioni bo'lib, rekordni o'rnatgan."
    },
    {
      "id": 792,
      "input": "Basketbol bo'yicha eng ko'p triple-doubleni kim amalga oshirgan?",
      "output": "Russell Westbrook NBA tarixida eng ko'p triple-doubleni amalga oshirgan o'yinchi hisoblanadi."
    },
    {
      "id": 793,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 794,
      "input": "Formula 1 tarixidagi eng ko'p chempionlikni qo'lga kiritgan poygachi kim?",
      "output": "Michael Schumacher va Lewis Hamilton 7 marta Formula 1 jahon chempioni bo'lgan."
    },
    {
      "id": 795,
      "input": "Boks bo'yicha eng ko'p jangni kim yutgan?",
      "output": "Sugar Ray Robinson 173 ta jangni yutgan va boks tarixida eng ko'p yutgan jangchidir."
    },
    {
      "id": 796,
      "input": "Tennis bo'yicha eng ko'p \"French Open\" g'olibi kim?",
      "output": "Rafael Nadal 14 marta Frantsiya Ochiq musobaqasini yutgan."
    },
    {
      "id": 797,
      "input": "Basketbol bo'yicha eng ko'p NBA chempionligini yutgan jamoa qaysi?",
      "output": "Los Angeles Lakers va Boston Celtics 17 marta chempion bo'lishgan."
    },
    {
      "id": 798,
      "input": "Futbol bo'yicha eng ko'p \"hat-trick\"ni kim urgan?",
      "output": "Cristiano Ronaldo 3 marta \"hat-trick\"ni urgan futbolchilar orasida rekord o'rnatgan."
    },
    {
      "id": 799,
      "input": "Futbol bo'yicha eng ko'p gol urgan himoyachi kim?",
      "output": "Cafu, Braziliya futboli afsonasining rekordlaridan biri, ko'plab gol urgan himoyachidir."
    },
    {
      "id": 800,
      "input": "Boks bo'yicha eng ko'p nockautlar bilan g'olib bo'lgan jangchi kim?",
      "output": "George Foreman 68 nockaut bilan eng ko'p nockautlarga ega bo'lgan boks jangchisidir."
    },
    {
      "id": 801,
      "input": "Futbol bo'yicha eng ko'p jahon chempionatida ishtirok etgan futbolchi kim?",
      "output": "Antonio Carbajal (Meksika) 5 marta Jahon chempionatida ishtirok etgan."
    },
    {
      "id": 802,
      "input": "MMA bo'yicha eng ko'p jangni yutgan jangchi kim?",
      "output": "Anderson Silva 16 ta g'alaba bilan eng ko'p jangni yutgan UFC jangchisi hisoblanadi."
    },
    {
      "id": 803,
      "input": "Futbol bo'yicha eng tez golni kim urgan?",
      "output": "2009-yilda Paolo Poggi 8 soniyada eng tez golni urgan."
    },
    {
      "id": 804,
      "input": "Boks bo'yicha eng tez nokautni kim amalga oshirgan?",
      "output": "Mike Tyson 91 soniyada eng tez nokautni amalga oshirgan."
    },
    {
      "id": 805,
      "input": "Formula 1 tarixida eng ko'p poyga g'olibligi kimda?",
      "output": "Lewis Hamilton 103 marta poyga g'olibi bo'lgan."
    },
    {
      "id": 806,
      "input": "Basketbol bo'yicha eng ko'p \"MVP\" mukofotini yutgan o'yinchi kim?",
      "output": "Kareem Abdul-Jabbar 6 marta NBA MVP mukofotini qo'lga kiritgan."
    },
    {
      "id": 807,
      "input": "Karate sportining asoschisi kim?",
      "output": "Gichin Funakoshi, karatening zamonaviy shaklini yaratuvchi shaxs."
    },
    {
      "id": 808,
      "input": "Karateda eng yuqori daraja qaysi?",
      "output": "10-dan (10-dan) yoki \"Jūdan\" eng yuqori daraja hisoblanadi."
    },
    {
      "id": 809,
      "input": "Karateda eng ko'p uriladigan va asosiy harakat qaysi?",
      "output": "\"Oi-zuki\" — oldinga zarba berish, karateda eng asosiy va ko'p ishlatiladigan zarbadan biridir."
    },
    {
      "id": 810,
      "input": "Karateda \"kata\" nima?",
      "output": "\"Kata\" - bu belgilangan jangni o'z ichiga olgan, texnikani o'rganish va rivojlantirish uchun o'rgatiladigan shakl."
    },
    {
      "id": 811,
      "input": "Karateda \"kumite\" nima?",
      "output": "\"Kumite\" - bu jangovar mashg'ulot yoki to'liq jang, unda ikki raqib bir-biriga qarshi kurashadi."
    },
    {
      "id": 812,
      "input": "Karateda kimlar qatnasha oladi?",
      "output": "Karate musobaqalarida har qanday yoshdagi odamlar, erkaklar va ayollar qatnasha olishadi."
    },
    {
      "id": 813,
      "input": "Karateda nima uchun belbog'lar ranglari muhim?",
      "output": "Belbog'lar ranglari karatechining mahorat darajasini bildiradi; oq belbog'dan qora belbog'ga qadar bo'ladi."
    },
    {
      "id": 814,
      "input": "Karateda \"dojo\" nima?",
      "output": "\"Dojo\" - bu karateni o'rgatish va mashq qilish uchun mo'ljallangan maxsus joy."
    },
    {
      "id": 815,
      "input": "Karateda \"kihon\" nima?",
      "output": "\"Kihon\" - bu asosiy texnikalarni o'rganish va mashq qilishning boshlang'ich bosqichi."
    },
    {
      "id": 816,
      "input": "Karateda eng mashhur karateka kim?",
      "output": "Bruce Lee, u karate va boshqa jang san'atlarida o'zining katta mahoratini ko'rsatgan va mashhur bo'lgan."
    },
    {
      "id": 817,
      "input": "Karateda qaysi zarba turini \"gyaku-zuki\" deb atashadi?",
      "output": "\"Gyaku-zuki\" - bu orqa qo'l bilan amalga oshiriladigan zarba."
    },
    {
      "id": 818,
      "input": "Karateda qaysi yurish turi \"zenkutsu-dachi\" deb ataladi?",
      "output": "\"Zenkutsu-dachi\" - bu oldinga qaragan holatda turgan holat, katta oyoq kengaytirilgan va mustahkam turg'unlikni ta'minlaydi."
    },
    {
      "id": 819,
      "input": "Karateda \"ko\" va \"do\" tushunchalari nima?",
      "output": "\"Ko\" - \"yo'l\" yoki \"maqsad\", \"do\" esa \"yo'l\" degan ma'noni anglatadi, ya'ni \"karate-do\" - \"karate yo'li\"."
    },
    {
      "id": 820,
      "input": "Karateda \"shuto\" nima?",
      "output": "\"Shuto\" - bu qo'ldan foydalanib, qo'li bilan chopish yoki kesish harakati."
    },
    {
      "id": 821,
      "input": "Karate musobaqalarida necha daqiqa davomida jang qilish mumkin?",
      "output": "Karate musobaqalarida janglar odatda 3 minut davom etadi."
    },
    {
      "id": 822,
      "input": "Karate bo'yicha eng yuqori \"dan\" darajasi kimga tegishli?",
      "output": "Masutatsu Oyama, 10-dan darajasini egallagan mashhur karate ustasi."
    },
    {
      "id": 823,
      "input": "Karateda qaysi uslub keng tarqalgan?",
      "output": "Shotokan, Goju-ryu, Wado-ryu va Shito-ryu — eng mashhur karate uslublaridir."
    },
    {
      "id": 824,
      "input": "Karate musobaqalarida qaysi uslubda g'alaba qozonish uchun ko'proq ball olish kerak?",
      "output": "Karate musobaqalarida g'alaba qozonish uchun texnik va taktik jihatlarni birgalikda ishlash kerak, ya'ni to'g'ri zarbalar, himoya va nazoratni qo'lga kiritish."
    },
    {
      "id": 825,
      "input": "Karate sportida eng yuqori baholangan zarba turi qaysi?",
      "output": "\"Kizami-zuki\" - bu juda tez va aniqlik bilan amalga oshirilgan oldinga zarba berish."
    },
    {
      "id": 826,
      "input": "Karateda zarba qilish uchun eng yaxshi holat qanday?",
      "output": "Karateda eng yaxshi holat to'liq balansda bo'lish va kuchni to'g'ri ishlatish, bu uchun \"kiba-dachi\" yoki \"zenkutsu-dachi\" holatlari qulay."
    },
    {
      "id": 827,
      "input": "Karateda \"ippon\" nima?",
      "output": "\"Ippon\" - bu qarshi tomonga qarshi amalga oshirilgan zarba yoki texnikaning muvaffaqiyatli bajarilishi, shunda jangni yutish mumkin."
    },
    {
      "id": 828,
      "input": "Karateda qaysi harakat \"mae geri\" deb ataladi?",
      "output": "\"Mae geri\" - bu oldinga qarab, tizzani ko'tarib amalga oshiriladigan to'liq zarba."
    },
    {
      "id": 829,
      "input": "Karateda jangchi qanday maqsadga ega?",
      "output": "Jangchi, karateda mahoratini rivojlantirish, tanani va ruhni shakllantirish va kuchni to'g'ri yo'naltirishni maqsad qilgan."
    },
    {
      "id": 830,
      "input": "Karateda \"te\" nima?",
      "output": "\"Te\" - bu qo'l va qo'l harakatlarini bildiradi, masalan, \"te\" yordamida zarba va himoya amalga oshiriladi."
    },
    {
      "id": 831,
      "input": "Karateda qaysi belbog'ni olish uchun qancha vaqt kerak?",
      "output": "Karatega boshlovchi uchun o'qish va mashq qilishda, birinchi \"ko'k belbog'\" olish uchun taxminan 1 yil vaqt kerak bo'lishi mumkin."
    },
    {
      "id": 832,
      "input": "Karateda \"tachi waza\" nima?",
      "output": "\"Tachi waza\" - bu turli turg'unlik holatlari va zarba usullarini o'z ichiga olgan mashqlarni bildiradi."
    },
    {
      "id": 833,
      "input": "Karatega kirish uchun qanday jismoniy tayyorgarlik zarur?",
      "output": "Karatega kirish uchun asosiy jismoniy tayyorgarlik kerak, bu esa elastiklik, kuch va chidamlilikni rivojlantirishni o'z ichiga oladi."
    },
    {
      "id": 834,
      "input": "Karate sportida \"mawashi geri\" nima?",
      "output": "\"Mawashi geri\" - bu yon tomondan zarba berish bo'lib, oyoq bilan bo'yi yuqoriga qarab amalga oshiriladi."
    },
    {
      "id": 835,
      "input": "Karateda \"kiai\" nima?",
      "output": "\"Kiai\" - bu g'azab yoki ruhiy kuchni ko'rsatish uchun chiqarilgan ovoz, bu zarba yoki hujumni kuchaytiradi."
    },
    {
      "id": 836,
      "input": "Karate musobaqalarida jangchilarni qanday baholashadi?",
      "output": "Karate musobaqalarida jangchilarni zarbalar, himoya va umumiy texnika asosida baholashadi."
    },
    {
      "id": 837,
      "input": "Karate musobaqalarida qaysi jismoniy harakatlar muhimroq hisoblanadi?",
      "output": "To'g'ri zarba berish, tezkor harakatlar va kuchli himoya - musobaqada g'alaba qozonish uchun muhim."
    },
    {
      "id": 838,
      "input": "Karate sportida eng ko'p ishlatiladigan zarba turi qanday?",
      "output": "\"Zuki\" (zarba) - bu eng ko'p ishlatiladigan zarba turidir, unda oldinga berilgan kuchli qo'l zarbasi ishlatiladi."
    },
    {
      "id": 839,
      "input": "Karatega kirish uchun qanday yoshda bo'lish kerak?",
      "output": "Karatega 4-5 yoshdan boshlab kirish mumkin, lekin har bir dojo o'z qoidalariga ega."
    },
    {
      "id": 840,
      "input": "Karate bo'yicha birinchi daraja belbog'ini olish uchun qancha vaqt kerak?",
      "output": "Birinchi daraja belbog'ini olish uchun odatda 6-12 oy orasida mashq qilish talab etiladi."
    },
    {
      "id": 841,
      "input": "Karate musobaqalarida jangchilarga qanday boshqaruv beriladi?",
      "output": "Jangchilar musobaqalarda ko'rsatilgan texnikalarni amalga oshiradilar, har bir zarba va himoya uchun baho beriladi."
    },
    {
      "id": 842,
      "input": "Karate sportida \"bunkai\" nima?",
      "output": "\"Bunkai\" - bu kata (jang shakli) harakatlarining amaliy qo'llanilishi, ya'ni harakatlarning jangda qanday ishlatilishini tushuntiruvchi texnikalar."
    },
    {
      "id": 843,
      "input": "Karateda \"gyaku-zuki\" nima?",
      "output": "\"Gyaku-zuki\" - bu orqa qo'l bilan amalga oshiriladigan kuchli zarba, ko'pincha oldinga qarab bajariladi."
    },
    {
      "id": 844,
      "input": "Karate musobaqalarida baholashni kim amalga oshiradi?",
      "output": "Karate musobaqalarida baholashni hakamlar yoki sudyalar amalga oshiradi. Ular zarbalarni, himoyalarni va jangchilarning texnikasini baholaydilar."
    },
    {
      "id": 845,
      "input": "Karate belbog'larining ranglari qanday tartibda joylashgan?",
      "output": "Oq, sariq, yashil, ko'k, qora — bu eng keng tarqalgan belbog' ranglari, har biri texnik ko'nikmalarni o'zgartirishni bildiradi."
    },
    {
      "id": 846,
      "input": "Karateda \"te-zuki\" nima?",
      "output": "\"Te-zuki\" - bu qo'l bilan amalga oshiriladigan zarba turi, odatda oyoqlar bilan kombinatsiyalangan zarbalar bilan ishlatiladi."
    },
    {
      "id": 847,
      "input": "Karateda \"kizami-zuki\" qanday zarba?",
      "output": "\"Kizami-zuki\" - bu juda tezkor oldinga zarba berish bo'lib, tezlik va aniqlikni talab qiladi."
    },
    {
      "id": 848,
      "input": "Karateda raqibni qanday yengish mumkin?",
      "output": "Raqibni yengish uchun aniq va kuchli zarbalar, yaxshi himoya va zarba kombinatsiyalarini qo'llash zarur."
    },
    {
      "id": 849,
      "input": "Karateda \"shuto-uchi\" nima?",
      "output": "\"Shuto-uchi\" - bu qo'lning ochiq holatida amalga oshiriladigan kesuvchi zarba, odatda raqibning bo'yniga yoki boshiga qaratiladi."
    },
    {
      "id": 850,
      "input": "Karate sportida raqibni qanday himoya qilish mumkin?",
      "output": "Raqibning zarbalaridan himoyalanish uchun qo'l va oyoq bilan himoya qilish, zarbalarni vaqtida to'xtatish va moslashuvchan bo'lish zarur."
    },
    {
      "id": 851,
      "input": "Karateda \"uke\" nima?",
      "output": "\"Uke\" - bu himoya yoki qarshi hujumni amalga oshiruvchi harakat, odatda zarbani to'xtatish yoki uni qaytarish uchun ishlatiladi."
    },
    {
      "id": 852,
      "input": "Karate sportida jangchining ahamiyati qanday?",
      "output": "Jangchining ahamiyati uning jismoniy va ruhiy holatiga bog'liq, mahoratni rivojlantirish va sabr-toqatni oshirish juda muhim."
    },
    {
      "id": 853,
      "input": "Karateda \"tobi-geri\" nima?",
      "output": "\"Tobi-geri\" - bu sakrab zarba berish bo'lib, raqibning yuqori qismiga qaratilgan kuchli zarba turidir."
    },
    {
      "id": 854,
      "input": "Karateda qaysi holatda zarba samarali bo'ladi?",
      "output": "Zarba samarali bo'lishi uchun u tez va aniqlik bilan amalga oshirilishi, to'g'ri balandlik va kuchni o'z ichiga olishi kerak."
    },
    {
      "id": 855,
      "input": "Karateda \"makikomi\" nima?",
      "output": "\"Makikomi\" - bu raqibni ko'tarib, uni tashlab yuborish harakati bo'lib, asosan yapon judo uslubidan olingan."
    },
    {
      "id": 856,
      "input": "Karateda qaysi yoshdagi odamlar qatnashishi mumkin?",
      "output": "Karateni yoshdan qat'i nazar boshlash mumkin, ammo jismoniy tayyorgarlik va moslashuvchanlikni oshirish uchun yoshlar osonroq rivojlanadi."
    },
    {
      "id": 857,
      "input": "Karateda \"jo\" nima?",
      "output": "\"Jo\" - bu uzun tayoq bo'lib, ba'zi karate uslublarida himoya va hujum texnikalarini o'rganish uchun ishlatiladi."
    },
    {
      "id": 858,
      "input": "Karateda \"hiza-geri\" nima?",
      "output": "\"Hiza-geri\" - bu tizzadan zarba berish, odatda raqibning tanasiga yoki boshiga qaratiladi."
    },
    {
      "id": 859,
      "input": "Karate sportida \"kiai\" ovozi nima uchun kerak?",
      "output": "\"Kiai\" - bu jangchining kuchini ko'rsatadigan ovoz bo'lib, zarba yoki harakatni kuchaytiradi va raqibni ruhiy jihatdan qo'rqitadi."
    },
    {
      "id": 860,
      "input": "Karate musobaqalarida raqibni \"ippon\" bilan yutish uchun nima qilish kerak?",
      "output": "\"Ippon\" - bu raqibni bir zarba yoki texnika yordamida yengishdir, bunda zarba aniq, kuchli va raqibni ishdan chiqaradigan darajada bo'lishi kerak."
    },
    {
      "id": 861,
      "input": "Karateda \"soto-uke\" nima?",
      "output": "\"Soto-uke\" - bu tashqi qo'l himoyasi bo'lib, zarba yoki hujumdan raqibni himoya qilish uchun qo'llaniladi."
    },
    {
      "id": 862,
      "input": "Karateda \"ushiro-geri\" nima?",
      "output": "\"Ushiro-geri\" - bu orqa tarafdan zarba berish, raqibning orqasiga qarab amalga oshiriladi."
    },
    {
      "id": 863,
      "input": "Karateda \"mawashi-geri\" nima?",
      "output": "\"Mawashi-geri\" - bu aylantirilgan oyoq zarbasi, ko'pincha raqibning boshiga yoki tanasiga qaratiladi."
    },
    {
      "id": 864,
      "input": "Karate sportida maqsad qanday belgilanadi?",
      "output": "Karateni o'rganishdagi asosiy maqsad jismoniy va ruhiy holatni yaxshilash, texnikalarni mukammallashtirish va jangovar mahoratni rivojlantirishdan iborat."
    },
    {
      "id": 865,
      "input": "Karate sportida \"shuto\" qo'l harakati qanday amalga oshiriladi?",
      "output": "\"Shuto\" - bu qo'lning ochiq holatida, o'ng yoki chap qo'lni ishlatib, kesuvchi zarba berish texnikasi."
    },
    {
      "id": 866,
      "input": "Karate sportida jangchi qaysi uslubda yuqori darajaga chiqadi?",
      "output": "Jangchi yuqori darajaga chiqishi uchun mustahkam texnikalarni o'zlashtirishi, jismoniy tayyorgarlikni oshirishi va ruhiy barqarorlikni rivojlantirishi kerak."
    },
    {
      "id": 867,
      "input": "Karate sportida \"hansoku\" nima?",
      "output": "\"Hansoku\" - bu raqibga zarar yetkazish yoki qoidabuzarlik qilish holatida chiqarilgan ogohlantirish yoki diskvalifikatsiya."
    },
    {
      "id": 868,
      "input": "Karateda \"jodan\" nima?",
      "output": "\"Jodan\" - yuqori darajadagi zarbalar yoki himoya harakatlari, odatda bosh va yuqori tanaga qaratilgan."
    },
    {
      "id": 869,
      "input": "Karateda \"chudan\" nima?",
      "output": "\"Chudan\" - o'rta darajadagi zarbalar yoki himoya harakatlari, odatda tananing o'rta qismiga qaratilgan."
    },
    {
      "id": 870,
      "input": "Karateda \"gedan-barai\" nima?",
      "output": "\"Gedan-barai\" - bu pastki darajali himoya harakati, odatda oyoqlar yoki pastki qismga qaratilgan zarbalarni bloklash uchun ishlatiladi."
    },
    {
      "id": 871,
      "input": "Karate sportida raqibning harakatlarini qanday tahlil qilish kerak?",
      "output": "Raqibning harakatlarini kuzatib, uning zaif tomonlarini aniqlash, undan keyin unga qarshi texnikalar qo'llash kerak."
    },
    {
      "id": 872,
      "input": "Karateda qanday qilib hujumni yaxshiroq rejalashtirish mumkin?",
      "output": "Hujumni rejalashtirish uchun raqibning pozitsiyasini, vaqtni va zarba qobiliyatini hisobga olish zarur."
    },
    {
      "id": 873,
      "input": "Karateda \"hiki-ashi\" nima?",
      "output": "\"Hiki-ashi\" - bu orqa oyoq bilan orqaga qadam qo'yish harakati, odatda himoya yoki holatni o'zgartirish uchun ishlatiladi."
    },
    {
      "id": 874,
      "input": "Karateda \"yoko-geri\" nima?",
      "output": "\"Yoko-geri\" - bu yon tarafdan zarba berish, oyoq bilan amalga oshiriladi va odatda raqibning tanasiga yoki boshiga qaratiladi."
    },
    {
      "id": 875,
      "input": "Karate sportida mahoratni qanday rivojlantirish mumkin?",
      "output": "Mahoratni rivojlantirish uchun muntazam mashqlar, to'g'ri texnika, va ko'p treninglarga qatnashish zarur."
    },
    {
      "id": 876,
      "input": "Karate sportida qanday yuqori daraja belbog'iga erishish mumkin?",
      "output": "Yuqori daraja belbog'iga erishish uchun ko'plab yillik tajriba, jismoniy va ruhiy mehnat va ko'nikmalarni mukammallashtirish zarur."
    },
    {
      "id": 877,
      "input": "Karateda \"koshin\" nima?",
      "output": "\"Koshin\" - bu jangchining ruhiy holatini va intizomini ifodalovchi tushuncha, shuningdek, o'z maqsadlariga erishish uchun qat'iyatlilik."
    },
    {
      "id": 878,
      "input": "Karate sportida \"bunkai\" ni qanday o'rganish kerak?",
      "output": "\"Bunkai\" ni o'rganish uchun har bir kata harakatining amaliy qo'llanilishini tushunish va unga mos texnikalarni qo'llash zarur."
    },
    {
      "id": 879,
      "input": "Karateda jangda qanday ruhiy tayyorgarlik zarur?",
      "output": "Jangchi uchun ruhiy tayyorgarlik o'z-o'zini nazorat qilish, tashvishlarni yengish va muvaffaqiyatga erishish uchun o'z maqsadiga qaratilgan bo'lishi kerak."
    },
    {
      "id": 880,
      "input": "Karate sportida \"tameshiwari\" nima?",
      "output": "\"Tameshiwari\" - bu taxta, plitka yoki boshqa materiallarni sindirish harakati, jangchilar uchun kuch va qobiliyatni sinovdan o'tkazish usuli."
    },
    {
      "id": 881,
      "input": "Karateda \"sokuto\" nima?",
      "output": "\"Sokuto\" - bu oyoqning tashqi qismidan amalga oshiriladigan zarba, odatda raqibning bo'yniga yoki boshiga qaratiladi."
    },
    {
      "id": 882,
      "input": "Karateda \"kesa-giri\" nima?",
      "output": "\"Kesa-giri\" - bu boshdan yuqori tomondan amalga oshiriladigan kesuvchi zarba, ko'pincha qo'l yordamida amalga oshiriladi."
    },
    {
      "id": 883,
      "input": "Karate sportida o'z maqsadlariga erishish uchun nima qilish kerak?",
      "output": "O'z maqsadlariga erishish uchun qat'iyatlilik, yaxshi reja, sabr-toqat va doimiy mashg'ulotlar kerak."
    },
    {
      "id": 884,
      "input": "Karate sportida o'qituvchining roli qanday?",
      "output": "O'qituvchi yoki \"sensei\" o'quvchilarga texnikalarni o'rgatadi, ularni motivatsiya qiladi va ruhiy tayyorgarlikni mustahkamlashda yordam beradi."
    },
    {
      "id": 885,
      "input": "Karateda \"kubi\" nima?",
      "output": "\"Kubi\" - bu boshni anglatadi, ko'plab zarbalar boshga qaratilgan, shuningdek, boshga qarshi himoya usullari mavjud."
    },
    {
      "id": 886,
      "input": "Karateda qanday qilib o'z-o'zini himoya qilishni o'rganish mumkin?",
      "output": "O'z-o'zini himoya qilishni o'rganish uchun zarbalarni bloklash, himoya harakatlarini o'zlashtirish va raqibning harakatlarini oldindan sezish kerak."
    },
    {
      "id": 887,
      "input": "Karateda jangchining shaxsiy rivojlanishi qanday amalga oshiriladi?",
      "output": "Jangchining shaxsiy rivojlanishi uchun, uning jismoniy va ruhiy holatini doimiy ravishda yaxshilash, texnikalarni o'zlashtirish va yangi usullarni o'rganish kerak."
    },
    {
      "id": 888,
      "input": "Karateda \"zuki\" nima?",
      "output": "\"Zuki\" - bu zarba, odatda qo'l bilan amalga oshiriladi va karateda eng asosiy harakatlardan biridir."
    },
    {
      "id": 889,
      "input": "Karate musobaqalarida qanday baholash tizimi mavjud?",
      "output": "Karate musobaqalarida baholash tizimi zarbalarni, texnikalarni, himoyani va jangchining umumiy mahoratini baholashga asoslangan."
    },
    {
      "id": 890,
      "input": "Karateda eng samarali himoya harakati qaysi?",
      "output": "Eng samarali himoya harakati - zarbalarni vaqtida bloklash, moslashuvchan bo'lish va himoya holatini tezda o'zgartirishdir."
    },
    {
      "id": 891,
      "input": "Karate sportida \"shuto-uchi\" qanday ishlatiladi?",
      "output": "\"Shuto-uchi\" - bu qo'ldan ishlatiladigan kesuvchi zarba, bu zarba ko'pincha raqibning boshiga yoki bo'yniga qaratiladi."
    },
    {
      "id": 892,
      "input": "Karateda raqibga qarshi qanday strategiyalarni qo'llash mumkin?",
      "output": "Raqibga qarshi yaxshi strategiya - uning zaif tomonlarini aniqlash, himoyasini buzish va kuchli zarbalarni qo'llashdir."
    },
    {
      "id": 893,
      "input": "Karateda \"shihan\" unvoni nima?",
      "output": "\"Shihan\" - bu yuqori darajadagi o'qituvchi unvoni bo'lib, odatda 5 dan 7 dan gacha bo'lgan qora belbog'ni egallagan ustozlarga beriladi."
    },
    {
      "id": 894,
      "input": "Karate sportida \"kyu\" darajasi nima?",
      "output": "\"Kyu\" darajasi - bu boshlang'ich va o'rta darajadagi jangchilar uchun belgilangan daraja, qora belbog'ga erishish uchun zarur bo'lgan ko'nikmalarni rivojlantiradi."
    },
    {
      "id": 895,
      "input": "Karate musobaqalarida jangchilarning pozitsiyasi qanday bo'lishi kerak?",
      "output": "Jangchi pozitsiyasi to'g'ri bo'lishi kerak, ya'ni oyoqlari va qo'llari qulay va mustahkam bo'lishi zarur. Bu raqibni kuzatish va hujumni amalga oshirish uchun muhimdir."
    },
    {
      "id": 896,
      "input": "Karate sportida \"tekki\" nima?",
      "output": "\"Tekki\" - bu kata, ya'ni raqibni o'zgarishsiz jang holatiga o'tkazishga mo'ljallangan shakl. Bu kata ko'pincha kuchni va chidamlilikni oshirishga yordam beradi."
    },
    {
      "id": 897,
      "input": "Karate sportida \"fudo-dachi\" pozitsiyasi nima?",
      "output": "\"Fudo-dachi\" - bu turgan pozitsiya bo'lib, qarshi hujum qilish va himoya qilish uchun mo'ljallangan. Oyoqlar keng va pastga qarab o'rnatiladi."
    },
    {
      "id": 898,
      "input": "Karateda \"kansetsu-waza\" nima?",
      "output": "\"Kansetsu-waza\" - bu qo'l yoki oyoq yordamida bo'g'imni qattiq ushlab, raqibni taslim qilishga olib keladigan texnika."
    },
    {
      "id": 899,
      "input": "Karateda \"tobi-zuki\" qanday amalga oshiriladi?",
      "output": "\"Tobi-zuki\" - bu sakrab zarba berish texnikasidir, ko'pincha yuqori yoki pastki darajadagi zarba uchun ishlatiladi."
    },
    {
      "id": 900,
      "input": "Karateda \"suri-ashi\" nima?",
      "output": "\"Suri-ashi\" - bu oyoqning yurgan holatida orqaga siljish yoki oldinga qadam qo'yish harakatidir, bu harakat jangni o'tkazishda juda muhim."
    },
    {
      "id": 901,
      "input": "Karateda \"seiken\" qo'l zarbasi qanday ishlatiladi?",
      "output": "\"Seiken\" - bu qo'lning eng kuchli qismini, ya'ni barmoqlar orasidagi bo'shliqni ishlatib zarba berish texnikasidir."
    },
    {
      "id": 902,
      "input": "Karate musobaqalarida \"koka\" nima?",
      "output": "\"Koka\" - bu kichik ball, odatda raqibga qattiq zarba yetkazilmagan yoki tekis amalga oshirilgan zarbalar uchun beriladi."
    },
    {
      "id": 903,
      "input": "Karate sportida \"zanshin\" nima?",
      "output": "\"Zanshin\" - bu doimiy hushyorlik holati, jangchi o'z raqibining harakatlarini oldindan sezishga va unga tezkor javob berishga tayyor bo'lishi kerak."
    },
    {
      "id": 904,
      "input": "Karateda \"furi-uke\" nima?",
      "output": "\"Furi-uke\" - bu keng qo'l bilan amalga oshiriladigan himoya harakati bo'lib, zarbalarni to'xtatish uchun ishlatiladi."
    },
    {
      "id": 905,
      "input": "Karate sportida \"go-no-sen\" nima?",
      "output": "\"Go-no-sen\" - bu qarshi hujum strategiyasi bo'lib, raqibning zarbasidan keyin hujum qilishni o'z ichiga oladi."
    },
    {
      "id": 906,
      "input": "Karate sportida \"seiken-zuki\" qanday amalga oshiriladi?",
      "output": "\"Seiken-zuki\" - bu qo'l bilan amalga oshiriladigan to'g'ridan-to'g'ri zarba, u kuchli va tezkor bo'lishi kerak."
    },
    {
      "id": 907,
      "input": "Karateda \"chikama\" nima?",
      "output": "\"Chikama\" - bu oyoqning tezligi va harakati, raqibning harakatlarini o'zgartirish va unga qarshi to'g'ri zarba berish uchun ishlatiladi."
    },
    {
      "id": 908,
      "input": "Karateda \"shime-waza\" nima?",
      "output": "\"Shime-waza\" - bu bo'g'imni, asosan bilak yoki bo'yin bo'g'imini siqish orqali taslim qilish texnikasidir."
    },
    {
      "id": 909,
      "input": "Karate sportida \"rensei\" nima?",
      "output": "\"Rensei\" - bu mashqlar yoki tayyorgarlik jarayonini anglatadi, u karate mahoratini oshirish uchun zarur bo'lgan muhim bosqichdir."
    },
    {
      "id": 910,
      "input": "Karateda \"taisabaki\" nima?",
      "output": "\"Taisabaki\" - bu qarshi hujum qilish uchun foydalaniladigan pozitsiya va harakat usuli bo'lib, jangchi pozitsiyasini tezda o'zgartirishi kerak."
    },
    {
      "id": 911,
      "input": "Karateda \"kiai\" ovozi nima uchun kerak?",
      "output": "\"Kiai\" - bu jangchining kuchini oshirish uchun ishlatiladigan ovoz bo'lib, raqibga psixologik ta'sir ko'rsatadi va zarbaning samaradorligini oshiradi."
    },
    {
      "id": 912,
      "input": "Karate sportida \"seisan\" nima?",
      "output": "\"Seisan\" - bu kata bo'lib, uni bajarish orqali jangchining chidamliligi, kuchi va texnikasi sinovdan o'tkaziladi."
    },
    {
      "id": 913,
      "input": "Karateda \"kuzushi\" nima?",
      "output": "\"Kuzushi\" - bu raqibni to'g'ri usulda balandlikda yoki pastda beqarorlashtirish texnikasidir, odatda u jangning o'zida yordam beradi."
    },
    {
      "id": 914,
      "input": "Karate sportida \"hojo-undo\" nima?",
      "output": "\"Hojo-undo\" - bu sportchilar uchun jismoniy tayyorgarlik mashqlarini anglatadi, ular kuch, tezlik va chidamlilikni oshirishga yordam beradi."
    },
    {
      "id": 915,
      "input": "Karateda \"kansetsu-geri\" qanday amalga oshiriladi?",
      "output": "\"Kansetsu-geri\" - bu bo'g'imni qattiq ushlab, raqibni taslim qilishga olib keladigan zarba turidir, oyoq yoki qo'l yordamida amalga oshiriladi."
    },
    {
      "id": 916,
      "input": "Karateda \"shin\" qanday ishlatiladi?",
      "output": "\"Shin\" - bu jangchining ruhiy holatini bildiradi, ruhiy tayyorgarlik, konsentratsiya va maqsadga erishish uchun kerakli ichki kuchni anglatadi."
    },
    {
      "id": 917,
      "input": "Karateda \"koku-geri\" nima?",
      "output": "\"Koku-geri\" - bu oyoq bilan raqibni pastga tushirish uchun ishlatiladigan texnikadir. Raqibning sezgirligini hisobga olib, uni taslim qilish uchun ishlatiladi."
    },
    {
      "id": 918,
      "input": "Karateda \"tenshin\" nima?",
      "output": "\"Tenshin\" - bu tezkor harakatni o'zgartirish texnikasidir, jangchining pozitsiyasini tezda o'zgartirishi va raqibning zarbalarini o'zgarishsiz qabul qilishni anglatadi."
    },
    {
      "id": 919,
      "input": "Karateda \"hiki-ashi\" harakati qanday ishlatiladi?",
      "output": "\"Hiki-ashi\" - bu orqaga siljish harakati bo'lib, qarshi hujum qilish uchun foydalaniladi, tezda yangi pozitsiyani egallashga yordam beradi."
    },
    {
      "id": 920,
      "input": "Karate sportida \"soto-uke\" nima?",
      "output": "\"Soto-uke\" - bu tashqi qo'l bilan himoya qilish texnikasidir, raqibning zarbasini tashqariga surish uchun ishlatiladi."
    },
    {
      "id": 921,
      "input": "Karateda \"maai\" nima?",
      "output": "\"Maai\" - bu jangchining masofani boshqarish qobiliyatidir, o'z pozitsiyasini va raqibni nazorat qilish uchun juda muhimdir."
    },
    {
      "id": 922,
      "input": "Karate sportida \"rakka\" nima?",
      "output": "\"Rakka\" - bu qattiq zarba yoki himoya harakati bo'lib, odatda raqibning pastki qismiga qaratilgan zarbalar uchun ishlatiladi."
    },
    {
      "id": 923,
      "input": "Karate sportida jangga kirishdan oldin qanday tayyorgarlik kerak?",
      "output": "Jangga kirishdan oldin, jangchi jismoniy va ruhiy ravishda tayyor bo'lishi, mushaklarni isitish, diqqatni jamlash va raqibni o'rganish zarur."
    },
    {
      "id": 924,
      "input": "Karateda \"mae-geri\" qanday zarba turidir?",
      "output": "\"Mae-geri\" - bu oldinga qarab qo'yilgan oyoq bilan zarba berish texnikasidir, ko'pincha raqibning o'rta qismiga yoki boshiga qaratiladi."
    },
    {
      "id": 925,
      "input": "Karate musobaqalarida eng muhim qoidalar qaysilar?",
      "output": "Eng muhim qoidalar - hujumni vaqtida va to'g'ri bajarish, raqibga zarar yetkazmaslik, va to'g'ri himoya harakatlarini amalga oshirish."
    },
    {
      "id": 926,
      "input": "Karate sportida \"sen-no-sen\" nima?",
      "output": "\"Sen-no-sen\" - bu raqibning hujumidan keyin, zarbani to'g'ridan-to'g'ri yoki raqib harakatlanayotganda hujum qilish strategiyasidir."
    },
    {
      "id": 927,
      "input": "Karateda \"migi-geri\" nima?",
      "output": "\"Migi-geri\" - bu o'ngga qarab orqaga siljish harakati, tezda yangi pozitsiyani egallash va raqibni boshqarish uchun ishlatiladi."
    },
    {
      "id": 928,
      "input": "Karateda \"empisai\" nima?",
      "output": "\"Empisai\" - bu qamchi harakati bilan amalga oshiriladigan zarba, qo'llarni yuqoriga yoki yon tomonlarga ko'tarib, raqibga kuchli zarba berishga qaratiladi."
    },
    {
      "id": 929,
      "input": "Karateda \"gyaku-zuki\" qanday ishlatiladi?",
      "output": "\"Gyaku-zuki\" - bu kuchli qo'l zarbasi bo'lib, uni boshqa qo'l bilan orqaga qaytarib amalga oshirish, ko'pincha raqibning o'rta yoki yuqori qismiga qaratiladi."
    },
    {
      "id": 930,
      "input": "Karateda \"zuki\" harakatining o'ziga xosligi nima?",
      "output": "\"Zuki\" - bu qo'l bilan to'g'ridan-to'g'ri zarba berish texnikasidir, kuchli, tezkor va samarali bo'lishi kerak."
    },
    {
      "id": 931,
      "input": "Karate sportida qanday qilib himoyani kuchaytirish mumkin?",
      "output": "Himoyani kuchaytirish uchun zarbalarni samarali bloklash, tezda harakatlanish va doimiy ravishda yangi himoya texnikalarini o'rganish zarur."
    },
    {
      "id": 932,
      "input": "Karate sportida \"kaeshi-geri\" qanday amalga oshiriladi?",
      "output": "\"Kaeshi-geri\" - bu raqibning zarbasiga javoban, o'zining oyoq zarbasini qaytarish texnikasidir."
    },
    {
      "id": 933,
      "input": "Karateda \"gyaku-geri\" nima?",
      "output": "\"Gyaku-geri\" - bu orqaga qarab qilinadigan oyoq zarbasidir, raqibni beqaror holatga olib kelish uchun ishlatiladi."
    },
    {
      "id": 934,
      "input": "Karate musobaqalarida jangchilarning psixologik tayyorgarligi qanday amalga oshiriladi?",
      "output": "Jangchining psixologik tayyorgarligi o'z-o'zini nazorat qilish, stressni boshqarish va jangga tayyorlanishda qat'iyatlilikni o'z ichiga oladi."
    },
    {
      "id": 935,
      "input": "Karateda \"kesa-uchi\" nima?",
      "output": "\"Kesa-uchi\" - bu diagonal kesish harakati, ko'pincha qo'l yoki qilich bilan amalga oshiriladi."
    },
    {
      "id": 936,
      "input": "Karateda \"shuto-uke\" qanday ishlatiladi?",
      "output": "\"Shuto-uke\" - bu qo'lning tashqi qismini ishlatib, raqibning hujumini bloklash uchun qo'llaniladigan himoya harakatidir."
    },
    {
      "id": 937,
      "input": "Karate sportida \"sokuto-gari\" nima?",
      "output": "\"Sokuto-gari\" - bu oyoqning tashqi qismi bilan amalga oshiriladigan zarba bo'lib, ko'pincha raqibning oyoqlarini urib, uni beqaror holatga keltirish uchun ishlatiladi."
    },
    {
      "id": 938,
      "input": "Karateda \"tobi-geri\" qanday amalga oshiriladi?",
      "output": "\"Tobi-geri\" - bu sakrab orqaga qarab zarba berish texnikasidir, yuqori darajadagi himoya yoki hujumni amalga oshirish uchun ishlatiladi."
    },
    {
      "id": 939,
      "input": "Karate sportida \"mawashi-geri\" nima?",
      "output": "\"Mawashi-geri\" - bu aylanma oyoq zarbasi bo'lib, raqibni hayratga solish uchun ishlatiladi, odatda yuzga qaratiladi."
    },
    {
      "id": 940,
      "input": "Karate sportida \"jinsei\" nima?",
      "output": "\"Jinsei\" - bu hayot va o'z-o'zini rivojlantirish, karate orqali insonning butun shaxsiy o'sishi va maqsadlariga erishishning tasviridir."
    },
    {
      "id": 941,
      "input": "Karateda \"hiza-geri\" nima?",
      "output": "\"Hiza-geri\" - bu oyoq bilan orqaga qarab qilingan zarba turidir, ko'pincha raqibni tushirish yoki hayratga solish uchun ishlatiladi."
    },
    {
      "id": 942,
      "input": "Karate sportida \"uraken\" nima?",
      "output": "\"Uraken\" - bu orqa qo'l bilan amalga oshiriladigan zarba turidir, odatda raqibni orqa tomondan beqarorlashtirish uchun ishlatiladi."
    },
    {
      "id": 943,
      "input": "Karate musobaqalarida qanday qoidalar mavjud?",
      "output": "Karate musobaqalarida zarba berishning kuchi, aniq o'lchovlarga rioya qilish, raqibga zarar yetkazmaslik va himoya texnikalarini bajarish muhim hisoblanadi."
    },
    {
      "id": 944,
      "input": "Karateda \"suri-ashi\" pozitsiyasida qanday harakatlar qilinadi?",
      "output": "\"Suri-ashi\" - bu oyoqlarni sirpanish holatida ishlatish harakati, jangchi o'zining tezligini oshirish va qarshi hujumni amalga oshirish uchun foydalanadi."
    },
    {
      "id": 945,
      "input": "Karateda \"tsuki\" harakatining o'ziga xosligi nima?",
      "output": "\"Tsuki\" - bu to'g'ri qo'l bilan zarba berish texnikasidir, zarba ko'pincha raqibning yuqori yoki o'rta qismiga qaratiladi."
    },
    {
      "id": 946,
      "input": "Karateda \"shuto-uchi\" nima?",
      "output": "\"Shuto-uchi\" - bu qo'lning qirqilgan qismini ishlatib, raqibni urish texnikasidir, odatda raqibning yuziga qaratiladi."
    },
    {
      "id": 947,
      "input": "Karate sportida \"kata\" nima?",
      "output": "\"Kata\" - bu belgilangan shaklda harakatlar majmuasini anglatadi, bu jangchining texnikasi, kuchi va mahoratini sinovdan o'tkazish uchun ishlatiladi."
    },
    {
      "id": 948,
      "input": "Karate sportida \"jodan\" nima?",
      "output": "\"Jodan\" - bu yuqori darajadagi zarba turidir, odatda bosh yoki yuza qismlariga qaratilgan zarbalar uchun ishlatiladi."
    },
    {
      "id": 949,
      "input": "Karate musobaqalarida jangchilarga qanday ball beriladi?",
      "output": "Jangchilarga zarbalar, himoya harakatlari, va jangdagi nazorat asosida ballar beriladi. Raqibni tushirish yoki zarba berish ko'proq ball oladi."
    },
    {
      "id": 950,
      "input": "Karateda \"gedan-barai\" nima?",
      "output": "\"Gedan-barai\" - bu pastdan yuqoriga qarab amalga oshiriladigan himoya harakatidir, odatda raqibning oyoqlari yoki pastki qismiga qaratiladi."
    },
    {
      "id": 951,
      "input": "Karate sportida \"mawashi-zuki\" qanday amalga oshiriladi?",
      "output": "\"Mawashi-zuki\" - bu aylanma zarba bo'lib, qo'lni doira shaklida harakatlantirib raqibning yuziga yoki tanasiga zarba berishdir."
    },
    {
      "id": 952,
      "input": "Karate sportida \"kamae\" nima?",
      "output": "\"Kamae\" - bu jangchining turgan holati yoki pozitsiyasi bo'lib, jangga tayyor bo'lishni anglatadi. Bu holat jangchining xavfsizligini va kuchini oshiradi."
    },
    {
      "id": 953,
      "input": "Karateda \"tobi-mawashi-geri\" qanday ishlatiladi?",
      "output": "\"Tobi-mawashi-geri\" - bu sakrab, yuqoriga qarab zarba berish texnikasidir, ko'pincha raqibni hayratga solish uchun ishlatiladi."
    },
    {
      "id": 954,
      "input": "Karate sportida \"hansoku\" nima?",
      "output": "\"Hansoku\" - bu qoidabuzarlikni bildiradi, ya'ni sportchini musobaqadan chiqarish uchun jiddiy xato yoki xavfli harakatlar amalga oshirilganida qo'llaniladi."
    },
    {
      "id": 955,
      "input": "Karateda \"ochi\" qanday amalga oshiriladi?",
      "output": "\"Ochi\" - bu o'rtacha yoki pastki qismga qaratilgan zarba turidir, ko'pincha oyoqlar yordamida amalga oshiriladi."
    },
    {
      "id": 956,
      "input": "Karateda \"ushiro-geri\" qanday ishlatiladi?",
      "output": "\"Ushiro-geri\" - bu orqaga qarab oyoq bilan zarba berish texnikasidir, ko'pincha raqibni yengish yoki himoya qilish uchun ishlatiladi."
    },
    {
      "id": 957,
      "input": "Karateda \"gari\" nima?",
      "output": "\"Gari\" - bu oyoq bilan amalga oshiriladigan zarba bo'lib, zarba beruvchi o'zi bilan raqib orasidagi masofani to'ldirishi kerak."
    },
    {
      "id": 958,
      "input": "Karate sportida \"jodan-uke\" nima?",
      "output": "\"Jodan-uke\" - bu yuqori darajali himoya harakati bo'lib, bosh va yuqori tanani himoya qilish uchun ishlatiladi."
    },
    {
      "id": 959,
      "input": "Karate sportida \"sokuto-geri\" qanday amalga oshiriladi?",
      "output": "\"Sokuto-geri\" - bu oyoqning tashqi qismi bilan zarba berish texnikasidir, ko'pincha raqibning oyoqlarini yoki tanasini urib, uni beqarorlashtirish uchun ishlatiladi."
    },
    {
      "id": 960,
      "input": "Karateda \"uchi-uke\" nima?",
      "output": "\"Uchi-uke\" - bu ichki qo'l bilan amalga oshiriladigan himoya harakatidir, raqibning zarbasini to'xtatish uchun ishlatiladi."
    },
    {
      "id": 961,
      "input": "Karate sportida \"ko-uchi-gari\" nima?",
      "output": "\"Ko-uchi-gari\" - bu kichik oyoq zarbasi bo'lib, raqibning oyoqlarini urib, uni beqaror holatga keltirishga yordam beradi."
    },
    {
      "id": 962,
      "input": "Karateda \"hiza-geri\" nima?",
      "output": "\"Hiza-geri\" - bu oyoq bilan orqaga qarab qilingan zarba turidir, ko'pincha raqibni tushirish yoki hayratga solish uchun ishlatiladi."
    },
    {
      "id": 963,
      "input": "Karate sportida \"uraken\" nima?",
      "output": "\"Uraken\" - bu orqa qo'l bilan amalga oshiriladigan zarba turidir, odatda raqibni orqa tomondan beqarorlashtirish uchun ishlatiladi."
    },
    {
      "id": 964,
      "input": "Karate musobaqalarida qanday qoidalar mavjud?",
      "output": "Karate musobaqalarida zarba berishning kuchi, aniq o'lchovlarga rioya qilish, raqibga zarar yetkazmaslik va himoya texnikalarini bajarish muhim hisoblanadi."
    },
    {
      "id": 965,
      "input": "Karateda \"suri-ashi\" pozitsiyasida qanday harakatlar qilinadi?",
      "output": "\"Suri-ashi\" - bu oyoqlarni sirpanish holatida ishlatish harakati, jangchi o'zining tezligini oshirish va qarshi hujumni amalga oshirish uchun foydalanadi."
    },
    {
      "id": 966,
      "input": "Karateda \"tsuki\" harakatining o'ziga xosligi nima?",
      "output": "\"Tsuki\" - bu to'g'ri qo'l bilan zarba berish texnikasidir, zarba ko'pincha raqibning yuqori yoki o'rta qismiga qaratiladi."
    },
    {
      "id": 967,
      "input": "Karateda \"shuto-uchi\" nima?",
      "output": "\"Shuto-uchi\" - bu qo'lning qirqilgan qismini ishlatib, raqibni urish texnikasidir, odatda raqibning yuziga qaratiladi."
    },
    {
      "id": 968,
      "input": "Karate sportida \"kata\" nima?",
      "output": "\"Kata\" - bu belgilangan shaklda harakatlar majmuasini anglatadi, bu jangchining texnikasi, kuchi va mahoratini sinovdan o'tkazish uchun ishlatiladi."
    },
    {
      "id": 969,
      "input": "Karate sportida \"jodan\" nima?",
      "output": "\"Jodan\" - bu yuqori darajadagi zarba turidir, odatda bosh yoki yuza qismlariga qaratilgan zarbalar uchun ishlatiladi."
    },
    {
      "id": 970,
      "input": "Karate musobaqalarida jangchilarga qanday ball beriladi?",
      "output": "Jangchilarga zarbalar, himoya harakatlari, va jangdagi nazorat asosida ballar beriladi. Raqibni tushirish yoki zarba berish ko'proq ball oladi."
    },
    {
      "id": 971,
      "input": "Karateda \"gedan-barai\" nima?",
      "output": "\"Gedan-barai\" - bu pastdan yuqoriga qarab amalga oshiriladigan himoya harakatidir, odatda raqibning oyoqlari yoki pastki qismiga qaratiladi."
    },
    {
      "id": 972,
      "input": "Karate sportida \"mawashi-zuki\" qanday amalga oshiriladi?",
      "output": "\"Mawashi-zuki\" - bu aylanma zarba bo'lib, qo'lni doira shaklida harakatlantirib raqibning yuziga yoki tanasiga zarba berishdir."
    },
    {
      "id": 973,
      "input": "Karate sportida \"kamae\" nima?",
      "output": "\"Kamae\" - bu jangchining turgan holati yoki pozitsiyasi bo'lib, jangga tayyor bo'lishni anglatadi. Bu holat jangchining xavfsizligini va kuchini oshiradi."
    },
    {
      "id": 974,
      "input": "Karateda \"tobi-mawashi-geri\" qanday ishlatiladi?",
      "output": "\"Tobi-mawashi-geri\" - bu sakrab, yuqoriga qarab zarba berish texnikasidir, ko'pincha raqibni hayratga solish uchun ishlatiladi."
    },
    {
      "id": 975,
      "input": "Karate sportida \"hansoku\" nima?",
      "output": "\"Hansoku\" - bu qoidabuzarlikni bildiradi, ya'ni sportchini musobaqadan chiqarish uchun jiddiy xato yoki xavfli harakatlar amalga oshirilganida qo'llaniladi."
    },
    {
      "id": 976,
      "input": "Karateda \"ochi\" qanday amalga oshiriladi?",
      "output": "\"Ochi\" - bu o'rtacha yoki pastki qismga qaratilgan zarba turidir, ko'pincha oyoqlar yordamida amalga oshiriladi."
    },
    {
      "id": 977,
      "input": "Karateda \"ushiro-geri\" qanday ishlatiladi?",
      "output": "\"Ushiro-geri\" - bu orqaga qarab oyoq bilan zarba berish texnikasidir, ko'pincha raqibni yengish yoki himoya qilish uchun ishlatiladi."
    },
    {
      "id": 978,
      "input": "Karateda \"gari\" nima?",
      "output": "\"Gari\" - bu oyoq bilan amalga oshiriladigan zarba bo'lib, zarba beruvchi o'zi bilan raqib orasidagi masofani to'ldirishi kerak."
    },
    {
      "id": 979,
      "input": "Karate sportida \"jodan-uke\" nima?",
      "output": "\"Jodan-uke\" - bu yuqori darajali himoya harakati bo'lib, bosh va yuqori tanani himoya qilish uchun ishlatiladi."
    },
    {
      "id": 980,
      "input": "Karate sportida \"sokuto-geri\" qanday amalga oshiriladi?",
      "output": "\"Sokuto-geri\" - bu oyoqning tashqi qismi bilan zarba berish texnikasidir, ko'pincha raqibning oyoqlarini yoki tanasini urib, uni beqarorlashtirish uchun ishlatiladi."
    },
    {
      "id": 981,
      "input": "Karateda \"uchi-uke\" nima?",
      "output": "\"Uchi-uke\" - bu ichki qo'l bilan amalga oshiriladigan himoya harakatidir, raqibning zarbasini to'xtatish uchun ishlatiladi."
    },
    {
      "id": 982,
      "input": "Karate sportida \"ko-uchi-gari\" nima?",
      "output": "\"Ko-uchi-gari\" - bu kichik oyoq zarbasi bo'lib, raqibning oyoqlarini urib, uni beqaror holatga keltirishga yordam beradi."
    },
    {
      "id": 983,
      "input": "Kickboxing sportida \"jab\" nima?",
      "output": "\"Jab\" - bu oldinga qaratilgan tezkor qo'l zarbasi bo'lib, raqibni muvozanatdan chiqarmasdan himoyani yengish uchun ishlatiladi."
    },
    {
      "id": 984,
      "input": "Kickboxingda \"roundhouse kick\" qanday amalga oshiriladi?",
      "output": "\"Roundhouse kick\" - bu aylanma oyoq zarbasi bo'lib, raqibning boshiga yoki tanasiga qaratiladi."
    },
    {
      "id": 985,
      "input": "Kickboxingda \"cross\" nima?",
      "output": "\"Cross\" - bu kuchli, to'g'ri qo'l bilan beriladigan zarba bo'lib, raqibning yuziga yoki tanasiga qaratiladi."
    },
    {
      "id": 986,
      "input": "Kickboxingda \"hook\" nima?",
      "output": "\"Hook\" - bu yon tomondan beriladigan zarba bo'lib, ko'pincha raqibning jag'iga yoki boshiga qaratiladi."
    },
    {
      "id": 987,
      "input": "Kickboxingda oyoq zarbalarining afzalliklari nimalar?",
      "output": "Oyoq zarbalari uzoqroq masofaga erishish imkonini beradi va raqibni yengish uchun ko'proq kuchli zarbalar berishga imkon yaratadi."
    },
    {
      "id": 988,
      "input": "Kickboxingda \"uppercut\" qanday amalga oshiriladi?",
      "output": "\"Uppercut\" - bu pastdan yuqoriga qarab beriladigan zarba bo'lib, raqibning chinini yoki yuzini nishonga oladi."
    },
    {
      "id": 989,
      "input": "Kickboxingda \"spinning backfist\" nima?",
      "output": "\"Spinning backfist\" - bu aylanma tarzda orqa qo'l bilan beriladigan zarba bo'lib, raqibni hayratga solish uchun ishlatiladi."
    },
    {
      "id": 990,
      "input": "Kickboxingda \"leg kick\" qanday ishlatiladi?",
      "output": "\"Leg kick\" - bu oyoqning pastki qismi bilan raqibning oyoqlariga zarba berishdir, uni beqarorlashtirish yoki zaiflashtirish uchun ishlatiladi."
    },
    {
      "id": 991,
      "input": "Kickboxingda \"low kick\" nima?",
      "output": "\"Low kick\" - bu oyoqning pastki qismi bilan amalga oshiriladigan zarba bo'lib, ko'pincha raqibning oyoqlariga yoki pastki tanasiga qaratiladi."
    },
    {
      "id": 992,
      "input": "Kickboxingda \"teep\" nima?",
      "output": "\"Teep\" - bu oldinga qarab beriladigan oyoq zarbasi bo'lib, raqibni himoya qilish yoki unga masofa yaratish uchun ishlatiladi."
    },
    {
      "id": 993,
      "input": "Kickboxingda \"knee strike\" qanday amalga oshiriladi?",
      "output": "\"Knee strike\" - bu tizza bilan beriladigan zarba bo'lib, odatda raqibning tanasining yuqori qismiga yoki boshiga qaratiladi."
    },
    {
      "id": 994,
      "input": "Kickboxingda \"clinching\" nima?",
      "output": "\"Clinching\" - bu raqibni o'zining tanasiga qaratib, yaqin masofada kurashish va zarbalarni himoya qilish uchun ishlatiladigan texnika."
    },
    {
      "id": 995,
      "input": "Kickboxingda \"body shot\" nima?",
      "output": "\"Body shot\" - bu raqibning tanasiga qaratilgan zarba bo'lib, ko'pincha nafas olishni qiyinlashtirish va kuchini kamaytirish uchun ishlatiladi."
    },
    {
      "id": 996,
      "input": "Kickboxingda \"head kick\" qanday amalga oshiriladi?",
      "output": "\"Head kick\" - bu oyoq bilan yuqoriga qarab beriladigan zarba bo'lib, raqibning boshiga qaratiladi."
    },
    {
      "id": 997,
      "input": "Kickboxingda \"counterpunch\" nima?",
      "output": "\"Counterpunch\" - bu raqibning zarbasiga javoban amalga oshiriladigan zarba bo'lib, ko'pincha raqibni ushlab olish yoki zarbalarni to'xtatish uchun ishlatiladi."
    },
    {
      "id": 998,
      "input": "Kickboxingda \"switch kick\" qanday ishlatiladi?",
      "output": "\"Switch kick\" - bu oyoqni tezda o'zgartirib, boshqa oyoq bilan zarba berish texnikasidir, raqibni hayratga solish uchun ishlatiladi."
    },
    {
      "id": 999,
      "input": "Kickboxingda \"overhand punch\" nima?",
      "output": "\"Overhand punch\" - bu yuqoridan pastga qarab beriladigan zarba bo'lib, ko'pincha raqibning boshiga qaratiladi."
    },
    {
      "id": 1000,
      "input": "Kickboxingda \"bob and weave\" nima?",
      "output": "\"Bob and weave\" - bu raqibning zarbalaridan qochish va o'z pozitsiyasini o'zgartirish texnikasidir."
    },
    {
      "id": 1001,
      "input": "Kickboxingda \"feint\" nima?",
      "output": "\"Feint\" - bu qasddan qilingan noto'g'ri harakat bo'lib, raqibni chalg'itish va unga zarar yetkazish uchun ishlatiladi."
    },
    {
      "id": 1002,
      "input": "Kickboxingda \"dirty boxing\" nima?",
      "output": "\"Dirty boxing\" - bu yoping'ich jangda ishlatiladigan texnikadir, raqibni o'z pozitsiyasini zaiflashtirish va himoya qilish uchun ishlatiladi."
    },
    {
      "id": 1003,
      "input": "Kickboxingda \"parry\" nima?",
      "output": "\"Parry\" - bu raqibning zarbalarini to'xtatish va o'ziga moslashtirish uchun ishlatiladigan himoya harakatidir."
    },
    {
      "id": 1004,
      "input": "Kickboxingda \"attack combinations\" qanday ishlatiladi?",
      "output": "\"Attack combinations\" - bu bir necha zarbalar va harakatlar birlashmasidir, jangchi raqibni zaiflashtirish uchun bir nechta texnikalarni birlashtiradi."
    },
    {
      "id": 1005,
      "input": "Kickboxingda \"slip\" nima?",
      "output": "\"Slip\" - bu raqibning zarbasidan qochish uchun boshni yon tomonga siljitish harakatidir."
    },
    {
      "id": 1006,
      "input": "Kickboxingda \"check kick\" nima?",
      "output": "\"Check kick\" - bu oyoqni raqibning zarbasi bilan to'xtatish texnikasidir, uning kuchini kamaytirish uchun ishlatiladi."
    },
    {
      "id": 1007,
      "input": "Kickboxingda \"shadow boxing\" nima?",
      "output": "\"Shadow boxing\" - bu o'z-o'zini mashq qilish va texnikalarni takomillashtirish uchun amalga oshiriladigan bo'sh havoda jang qilishdir."
    },
    {
      "id": 1008,
      "input": "Kickboxingda \"sparring\" nima?",
      "output": "\"Sparring\" - bu jangchi o'zining raqibiga qarshi mashq qiladigan jang, asosan himoya va hujumni yaxshilash uchun ishlatiladi."
    },
    {
      "id": 1009,
      "input": "Kickboxingda \"punching bag\" nima?",
      "output": "\"Punching bag\" - bu mashqlar uchun ishlatiladigan qo'llab-quvvatlovchi to'plam, jangchining zarba kuchini va texnikasini yaxshilashga yordam beradi."
    },
    {
      "id": 1010,
      "input": "Kickboxingda \"body movement\" nima?",
      "output": "\"Body movement\" - bu tananing harakati va pozitsiyasi, zarbalarni o'zgartirish va raqibning hujumidan qochish uchun ishlatiladi."
    },
    {
      "id": 1011,
      "input": "Kickboxingda \"momentum\" nima?",
      "output": "\"Momentum\" - bu jangchining tezligi va kuchi, zarbalarni to'g'ri va samarali berish uchun kerak bo'ladi."
    },
    {
      "id": 1012,
      "input": "Kickboxingda \"balance\" nima?",
      "output": "\"Balance\" - bu jangchining tanasining barqarorligi, zarbalarni to'g'ri berish va raqibga qarshi kurashish uchun zarurdir."
    },
    {
      "id": 1013,
      "input": "Kickboxingda \"ring control\" nima?",
      "output": "\"Ring control\" - bu jangchining rinqdagi pozitsiyasini boshqarish, raqibning harakatlarini cheklash va unga hujum qilish imkonini yaratadi."
    },
    {
      "id": 1014,
      "input": "Kickboxingda \"conditioning\" nima?",
      "output": "\"Conditioning\" - bu jangchining jismoniy tayyorgarlik darajasi, uzoq davom etadigan janglarda kuchli bo'lishni ta'minlash uchun muhimdir."
    }
  ]